{
    "content": "TP2 \n\nANALYSE DES VIBRATIONS DES MACHINES \nTOURNANTES (VMS OU VIBROTEST 60) \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\nAnnée Universitaire : 2022-2023 \n\n  \n \n \n \n \n \n\fAttention : Deux rapports identiques auront une note égale à 0. \n\nRemarque Importante \n\nLe rapport à rendre doit :  \n\n•  Être  clair  et  rédigé  selon  les  normes  de  rédactions  de  rapport  (page  de  garde,  titre, \n\ntable  des  matières, \n\nrésumé, \n\nintroduction,  objectifs,  ……,  conclusions  et \n\nrecommandations). \n\n•  Contenir les explications des objectifs visés par le TP. \n\n•  Contenir les résultats et analyses. \n\n•  Respect la chronologie fournie à la fin de ce fascicule. \n\nL’objectif de ce travail pratique est de : \n\n•  Comprendre  les  bases  de  la  MPC  en  utilisant  l’analyse  vibratoire  des  machines \n\ntournantes, \n\n•  Prévoir les démarches pratiques à mettre en œuvre pour les applications industrielles, \n\n• \n\nIdentifier les méthodes, normes et procédures nécessaires, \n\n•  Utiliser  un  appareillage  spécifique  et  réaliser  l‘analyse  vibratoire  des  machines \n\ntournante. \n\nII. \n\nIntroduction \n\n1.  Maintenance conditionnelle \n\na.  Définition générale de la maintenance : \n\nMaintenir c’est assurer la disponibilité de l’outil de production au coût optimal. \n\nb.  Les différents types de maintenances \n•  Maintenance  curative  (après  un  arrêt  ou  une  casse)  :  Nécessite  une  équipe \n\nd’entretien  surdimensionnée.  Ne  permet  pas  de  maitriser  la  disponibilité  des \n\néquipements. \n\n•  Maintenance  systématique  (selon  un  échéancier  préétabli)  :  Engendre  le \n\nremplacement  prématuré  de  composants.  Ne  permet  pas  de  prendre  en  compte \n\nl’évolution réelle de leur état. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 2 sur 10 \n\n  \n \n               \n \n \n \n\f•  Maintenance \n\nconditionnelle \n\n:  Maintenance \n\npréventive \n\nsubordonnée \n\nau \n\nfranchissement  d’un  seuil  prédéterminé  d’un  paramètre  significatif  de  l’état  de \n\ndégradation du bien. \n\n•  Maintenance  prévisionnelle  :  Maintenance  préventive  subordonnée  à  l’analyse  de \n\nl’évolution surveillée de paramètres significatifs de la dégradation du bien, permettant \n\nde retarder et planifier les interventions. \n\n2.  Principe de la maintenance conditionnelle  \n\nElle est basée sur la détection précoce d’un défaut et du suivi de son évolution. Ceci permet \n\ndonc de programmer une intervention d’entretien le plus  tard possible  et uniquement  quand \n\ncela devient indispensable. \n\nLe succès grandissant de la maintenance conditionnelle des machines tournantes vient du fait \n\nqu’il existe des techniques efficaces d’identification de défaut et que les développements des \n\ncapteurs, systèmes d’acquisition de données et des systèmes informatisés de traitement de ces \n\ndonnées / mesures, permettent d’obtenir en temps réel et en langage clair des diagnostics, des \n\nalarmes, des pronostics. \n\nCeci  permet  donc  d’identifier  de  façon  très  précise  ce  qu’il  faut  faire  et  le  programmer  en \n\nperturbant au minimum la fabrication. \n\nCette  réduction  des  temps  d’arrêt  augmente  donc  la  rentabilité  des  installations  tout  en \n\ndiminuant les frais de maintenance. \n\n3.  Les avantages de la maintenance conditionnelle \n\n•  Diminution des arrêts de production ; \n\n•  Diminution  du  nombre  d’arrêts  de  production \n\nintempestifs  (la  disponibilité  des \n\néquipements) ; \n\n•  Suppression des arrêts systématiques \n\n•  Limitation  de  la  gravité  des  dégradations  (coûts  de  réparations,  amélioration  de  la \n\nsécurité) \n\n•  Programmation des réparations \n\n•  Approvisionnement  des  pièces  de  rechange  en  fonction  des  besoins  réels  (  coûts  de \n\nstockage) \n\n•  Planification  des  interventions  (l’organisation  des  intervenants,coûts  de  maintenance, \n\nmotivation du personnel par valorisation des tâches de maintenance) \n\n•  Interventions plus ciblées (localisation préalable des pannes,  la qualité des réparations) \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 3 sur 10 \n\n  \n \n               \n \n\fIII.  Analyse vibratoire des machines tournantes \n\n1.   \n\nPrincipes de l’analyse vibratoire \n\nLe  fonctionnement  de  tout  dispositif  comportant  au  moins  une  pièce  en  mouvement \n\ns’accompagne de bruits et vibrations. \n\nCes  vibrations  sont  caractéristiques  de  l’état  du  dispositif  et  constituent ce  qu’on  appelle  sa \n\nsignature  vibratoire.  Le  prélèvement  et  le  traitement  de  tout  ou  partie  de  cette  signature \n\npermet  de connaître rapidement l’état du dispositif et  de suivre son évolution  dans le temps \n\nsans effectuer le démontage. Toute machine comporte des pièces en mouvement qui exercent \n\ndes  efforts  sur  sa  structure  et  engendrent  des  déformations.  Ces  déformations  varient  au \n\nrythme du mouvement et se traduisent par des déplacements de la surface de la structure par \n\nrapport à elle-même (déplacements absolues) qui constituent les vibrations. \n\nUne  machine  idéale  ne  vibrerait  pas  car  toute  l’énergie  serait  employée  pour  effectuer  le \n\ntravail. \n\nLa machine vieillissante, les pièces se déforment et de légers changements dans les propriétés \n\ndynamiques apparaissent. Les arbres se désalignent, les paliers et les roulements s’usent, les \n\nrotors  se  déséquilibrent,  les  jeux  augmentent.  Tous  ces  facteurs  se  traduisent  par  une \n\naugmentation de l’énergie vibratoire et donc d’une baisse de l’énergie efficace. \n\nL’intérêt  de  signaux  prélevés  sur  des  machines  tournantes  est  de  pouvoir  accéder,  par \n\nl’intermédiaire  de  traitements  adaptés,  à  la  caractérisation  des  efforts  dynamiques,  et \n\nparticulièrement ceux résultants d’excitations anormales.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 4 sur 10 \n\n  \n \n               \n \n \n\f2.  Banc d’essai vibratoire  \n\n1)  Coffret de commande. \n\n2)  Dispositif de charge de roulement \n\n3)  Moteur à deux bouts d’arbre \n\n4)  Multiplicateur \n\n5)  Capot de protection asservi \n\n6)  Pompe centrifuge monocellulaire \n\n7)  Circuit de refoulement \n\n8)  Circuit d’aspiration \n\n9)  Réservoir \n\n3.  Présentation du banc : \n\nCe  banc  d’étude  sert  à  la  mise  en  évidence  des  phénomènes  vibratoires  sur  machines \n\ntournantes de façon satisfaire l’étude de la maintenance conditionnelle par l’analyse vibratoire \n\nen formation de maintenance industrielle. \n\nCe banc d’étude des vibrations permet, par son dimensionnement et sa constitution, de mettre \n\nen évidence une grande majorité des phénomènes vibratoires sur machines tournantes : \n\n✓  Un roulement monté sur un support assurant une charge variable, permet de comparer les \n\nvibrations d’un roulement usé ou défectueux avec celles d’un roulement en bon état. \n\n✓  Le balourd est mis en évidence par le déséquilibrage gradué de deux disques en rotation. \n\n✓  La  partie  opérative  autorise  le  désalignement  du  moteur  par  rapport  à  l’axe  de  rotation \n\ndes éléments adjacents. \n\n✓  Le réducteur, réversible en multiplicateur, permet d’étudier les bruits d’engrènement. \n\n✓  La  charge,  composé  d’un  réseau  hydraulique  élémentaire  (pompe  centrifuge,  vannes \n\nmanuelles sur le circuit d’admission et de refoulement, manomètre et vacuomètre) permet \n\nl’étude des bruits d’aubage ainsi que des bruits engendrés par la cavitation générée par la \n\nfermeture  de  la  vanne  sur  le  circuit  d’admission.  La  transparence  des  canalisations \n\nd’admission et de refoulement permet de visualiser le phénomène. \n\n✓  Un indicateur de débit à flotteur monté sur le refoulement. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 5 sur 10 \n\n  \n \n               \n \n \n \n \n\f4.   \n\nProcédure de réalignement (à ne pas faire) :  \n\nPour  aligner  parfaitement  les  différents  équipements  de  la  machine  cinématique,  il  est \n\nnécessaire  de  positionner  correctement  l’élément  central  qui  est  le  multiplicateur.  Pour  cela \n\ndeux  goupilles  ont  été  placées  de  part  et  d’autre  du  multiplicateur.  Le  réglage  s’effectue  en \n\nplaçant deux équerres en butée sur les deux goupilles et perpendiculaires aux deux arbres. Il \n\nsuffit  ensuite  de  positionner  le  multiplicateur  de  telle  sorte  que  ses  deux  arbres  deviennent \n\ntangents avec l’équerre. \n\nAvant de remettre en service le BANC DE VIBRATION, vérifier le lignage du multiplicateur \n\navec ses deux équipements adjacents en positionnant une arrête vive et parfaitement linéaire \n\nsur deux directions, axiales et radiales des accouplements, comme le montrent les figures ci-\n\naprès : \n\n5.  Procédure de charge du roulement : \n\nUtiliser  la  vis  prévue  à  cet  effet  montée  sur  la  cage  d’expérimentation  des  roulements  pour \ncharger le roulement et bloquer le contre-écrou. \n\nSi la mesure n’était pas significative, ne pas hésiter à augmenter la charge. \n\nA  l’issue  de  l’expérimentation,  décharger  le  roulement  en  dévissant  la  vis  de  charge  ou \ndémonter la cage d’expérimentation des roulements pour inhiber le défaut. \n\n6.  Procédure de désalignement moteur (à ne pas faire) : \n\nDébloquer  les  4  vis  de  fixation  du  moteur,  désaligner  le  moteur  au  moyen  des  poussoirs \nmontés sur les glissières et bloquer le moteur. \n\nTypiquement, un déplacement correspondant à un tour sur chaque poussoir est suffisant pour \nvisualiser les vibrations caractéristiques d’un défaut d’alignement. \n\nAprès l’expérimentation, il faut impérativement réaligner le moteur pour ne pas perturber les \nautres signatures. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 6 sur 10 \n\n  \n \n               \n \n \n \n \n \n \n \n \n \n\f7.  Procédure de pose des embases de prise de mesures :  \n\nPositionner sur les emplacements significatifs ou souhaités les embases, pour l’adaptation du \ncapteur de ‘‘prise de mesure’’ de l’équipement de mesure. \n\n8.    Procédure  de  mise  en  œuvre  pour  l’étude  des  supports  élastiques \n\n(à ne pas faire) : \n\nDéposer les 4 écrous de fixation ɸ 12 et les 4 rondelles maintenant les 4 entretoises entre le \nchâssis et la tôle supportant le moteur. \n\nLibérer les entretoises pour que la liaison entre la tôle supportant le moteur et le châssis soit \nassurée par les plots élastiques. \n\nEffectuer les analyses vibratoires souhaitées pour l’étude des supports élastiques. \n\nPositionner les entretoises à leurs emplacements respectifs. \n\nReposer les 4 rondelles et les 4 écrous de fixation ɸ 12. \n\n9.  Les points de mesures :  \n\nLa  vibration  étant  le  résultat  d’un  effort,  sa  mesure  principale  devra  se  faire  suivant  la \n\ndirection  de  l’effort.  Dans  le  cas  des  machines  tournantes,  la  plupart  des  efforts  sont \n\nengendrés  par  la  partie  mobile  donc  sont  eux-mêmes  tournants  et  les  mesures  principales \n\ndevront se faire dans le plan radial. \n\nSi l’effort est généralement constant dans ce plan, il n’en est pas de même de la réponse de la \n\nstructure.  Aussi  les  mesures  (amplitudes)  sont  en  général  différentes  suivants  les  rayons,  ce \n\nqui impose de faire au moins deux mesures : une verticale et une horizontale. \n\nImplantation des points de mesure \n\nLes mesures doivent être prises dans un premier temps sur tous les points du banc (palier de \n\nroulement, moteur, réducteur, pompe) sans balourd supplémentaire. \n\nVous  changez  le  palier  de  roulement  déjà  monté  par  le  deuxième.  Vous  devez  identifier  le \n\npalier  saint  du  palier  défectueux  à  partir  du  signal  acquis  en  faisant  une  interprétation \n\nconvenable. \n\nEnsuite vous rajoutez un balourd et refaites les mesures. Interpréter l’effet du balourd sur les \n\nsignaux et spectres mesurés. \n\nToutes les mesures doivent être faites à la même vitesse de rotation. La mesure de vitesse de \n\nrotation doit être faite à l’aide d’un top tour mis à votre disposition. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 7 sur 10 \n\n  \n \n               \n \n \n\fIV.  Logiciel d’acquisition et de traitement (voir guide d’utilisation) \n\nLes étapes de la manipulation à suivre (dans le cas où vous utilisez le Vibrotest 60) : \n\nEtape 1 : création site, ligne, machine, points de mesure \n\nCréer un nouveau site \n\nCréer une nouvelle ligne \n\nCréer une nouvelle machine \n\nEtape 2 : configuration des points de mesures \n\nChoix du capteur \n\nDéterminer les types de mesures (Global, BCU, Spectre, BCS) \n\nRégler les paramètres de chaque type de mesure (unité, mode de détection…) \n\nEtape 3 : acquisition de données \n\nCréation des routes \n\nConfigurer la route \n\nEnregistrer la route \n\nEtape 4 : charger la route sur la carte PC \n\nEtape 5 : effectuer les mesures sur le banc d’essai \n\nEnregistrer les mesures sur le collecteur de données \n\nEtape 6 : générer le rapport de la manipulation \n\nPS : Dans le cas où vous utilisez le VMS, cette procédure se fait directement en utilisant le \n\nlogiciel d’acquisition XPR 300 (onglet configuration). Voir documentation fournie pour plus \n\nd’explication. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 8 sur 10 \n\n  \n \n               \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fV. \n\nQuestions : \n\n1.  Quel est le rôle de la mesure global ? \n\n2.  Quel le rôle de la mesure spectrale ? \n\n3.  Quand est ce qu’on utilise l’une ou l’autre voire les deux ? \n\n4.  Si une machine tournante à une fréquence de 1800 RPM, quelle est sa fréquence en Hz ? \n\n5.  Un organe tournant de rayon 30 cm lié à un moteur se met à vibrer à la fréquence de 9 Hz. \n\nCalculer la vitesse linéaire d’un point de la périphérie pour obtenir cette vibration (en km/h) ? \n\n6.  La  vibration,  étudiée  selon  son  déplacement,  peut  être  représentée  par  une  sinusoïde \n\nd’équation y = a sinωt dont on peut connaitre à tout moment l’amplitude. On peut connaitre la \n\nvitesse  et  l’accélération  de  cette  vibration  par  dérivation  successives  de  cette  équation  par \n\nrapport au temps. Donner les équations de la vitesse et de l’accélération d’une vibration ? \n\n7.  En fonction des résultats de la question précédente, tracer les représentations du déplacement, \n\nde  la  vitesse  et  de  l’accélération  d’une  vibration  sur  le  document  réponse  en  précisant  les \n\nabscisses réelles sachant que la fréquence est de 25 Hz ?  \n\n8.  Relever  la  mesure  globale  et  le  spectre  de  fréquence  (BF,  MF  ou  HF)  sur  les  six  points  de \n\nmesures installés sur le banc d’essai pour l’ensemble des manipulations que vous allez faire : \n\n(Etat Initiale, Balourd gauche, Balourd droit, Balourd combiné et Changement de roulement). \n\n(Insérer les spectres significatifs dans votre rapport) \n\n9.  Interpréter tous les résultats que vous allez trouver.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 9 sur 10 \n\n  \n \n               \n \n \n \n \n \n \n \n \n \n\fStructure du compte rendu de TP \n\n1. Introduction  \n\n2. Etude cinématique  \n\na. Schéma cinématique  \n\nb. Calcul des fréquences vibratoires  \n\n3. Expérience 1 : Etat initial  \n\na. Description  \n\nb. Résultats  \n\n Niveau global  \n\n Analyse spectrale  \n\nc. Interprétation  \n\n4. Expérience 2 : Balourd gauche  \n\na. Description  \n\nb. Résultats  \n\n Niveau global  \n\n Analyse spectrale  \n\nc. Interprétation  \n\n5. Expérience 3 : Balourd droit  \n\na. Description  \n\nb. Résultats  \n\n Niveau global  \n\n Analyse spectrale  \n\nc. Interprétation  \n\n6. Expérience 4 : Balourd combiné  \n\na. Description  \n\nb. Résultats  \n\n Niveau global  \n\n Analyse spectrale  \n\nc. Interprétation  \n\n7. Questions supplémentaires  \n\n8. Conclusion et recommandation  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n             Page 10 sur 10 \n\n  \n \n               \n \n \n \n \n \n\f"
}