{
    "content": "TP5 \n\nALIGNEMENT DES ARBRES HORIZONTAUX \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\nAnnée Universitaire : 2022-2023 \n\n  \n \n \n \n \n \n\fAttention : Deux rapports identiques auront une note égale à 0. \n\nRemarque Importante \n\nLe rapport à rendre doit :  \n\n•  Être clair et rédigé selon les normes de rédactions de rapport (page de garde, titre, table \n\ndes matières, résumé, introduction, objectifs, ……, conclusions et recommandations). \n\n•  Contenir les explications des objectifs visés par le TP. \n\n•  Contenir les résultats et analyses. \n\n•  Respect la chronologie fournie à la fin de ce fascicule. \n\nL’objectif de ce travail pratique est de : \n\n•  Comprendre les bases de l’alignement des arbres,  \n\n•  Prévoir les démarches pratiques à mettre en œuvre pour les applications industrielles, \n\n• \n\nIdentifier les méthodes, normes et procédures nécessaires, \n\n•  Utiliser un appareillage spécifique et réaliser le lignage des arbres. \n\nI.  Alignement des arbres : \n\nL’alignement des arbres c’est la correction de la position relative de deux machines qui sont \n\naccouplées pour que les axes soient alignés lorsque les machines travaillent à une température \n\nde  service  normale.  Afin  d’obtenir  les  tolérances  requises  l’alignement  des  arbres  se  fait  en \n\ndéplaçant les paires de pieds avant et arrière d’une machine, verticalement et horizontalement. \n\nLes tolérances de l’alignement dépendent en grande partie de la vitesse de rotation des arbres. \n\nL’alignement des machines doit être réalisé dans les tolérances indiquées par le fabriquant. Le \n\ntableau ci-dessous peut être utilisé si aucune tolérance limite n’est indiquée. \n\nDéport de parallélisme \n\nDéfaut angulaire \n\nRPM \n\n0-1000 \n\n1000-2000 \n\n2000-3000 \n\n3000-4000 \n\n4000-6000 \n\nmm \n\n0.13 \n\n0.10 \n\n0.07 \n\n0.05 \n\n0.03 \n\nmm/100 mm \n\n0.10 \n\n0.08 \n\n0.07 \n\n0.06 \n\n0.05 \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 2 / 16 \n\n  \n \n \n \n \n\fAlignement d’arbres : Déterminez et réglez la position relative de deux machines connectées, \n\ncomme un moteur et une pompe, afin que les centres de rotation des arbres soient colinéaires \n\nlorsque les machines fonctionnent dans des conditions normales. La correction d’alignement \n\nd’arbres horizontal consiste à déplacer les paires de pieds avant et arrière d’une machine, \n\nverticalement et horizontalement, jusqu’à ce que les arbres soient alignés en fonction des \n\ntolérances autorisées. Le système comporte une table de tolérances.  \n\nII.  Système de mesure : FIXTURLASER GO Pro \n\nLe  FIXTURLASER  GO  Pro  est  un  système  laser  d’alignement  des  arbres  qui  fournit  les \n\nfonctions de mesure, d’alignement et de gestion des données. Comporte deux unités de mesures \n\nplacées sur chacun des arbres grâce à un dispositif de fixation spécial fourni avec le système. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 3 / 16 \n\n  \n \n \n \n \n \n \n \n \n \n\fAprès avoir tourné les arbres dans différentes positions de mesure, le système calcul la distance \n\nrelative entre les deux arbres, sur deux plans différents. Les distances entre les deux plans de \n\nmesure, la distance au couplage et les distances aux pieds de la machine sont saisies dans le \n\nsystème. La fenêtre d’affichage affiche alors les conditions d’alignement réelles, ainsi que la \n\nposition des pieds. La machine peut être réglée en fonction des valeurs indiquées.  \n\nLes résultats de l’alignement peuvent être enregistrés dans le gestionnaire de mémoire. \n\n Les mesures enregistrées en mémoire peuvent facilement être transférées à un PC à des  fins \n\nd’édition ultérieure.  \n\nIII.  FONCTIONS DE PRE-ALIGNEMENT \n\nPour obtenir le meilleur alignement d’arbres possible, il faut effectuer un certain nombre de \n\nvérifications préalables. Il est souvent nécessaire d’effectuer ces vérifications pour obtenir un \n\nalignement  précis.    Il  est  généralement  impossible  d’obtenir  l’alignement  souhaité  sans \n\neffectuer des vérifications préalables.   \n\nAvant de vous rendre sur le site, vérifiez les éléments suivants : \n\n• Quelles sont les tolérances requises ? \n\n• Certains mouvements sont-ils à prévoir ? \n\n• Le montage du système de mesure fait-il l’objet de certaines restrictions ? \n\n• Est-il possible de faire tourner les arbres ? \n\n• Quelles cales faut-il prévoir ? \n\nAvant d’installer le système d’alignement sur la machine, vérifiez l’assise, le boulonnage et le \n\ncalage  de  celle-ci.  Vérifiez  également  que  les  réglages  de  la  machine  peuvent  s’effectuer \n\nlibrement (y a-t-il assez d’espace pour la déplacer ?). \n\nUne fois les vérifications visuelles effectuées, certains points doivent être examinés :  \n\n• Vérifiez que la machine est à la bonne température pour l’alignement. \n\n• Éliminez les vieilles cales rouillées (vérifiez que vous pouvez les enlever).  \n\n• Vérifiez le dispositif de couplage et desserrez les boulons de couplage. \n\n• Vérifiez la stabilité des pieds. \n\n• Pièces mécaniques desserrées. \n\n• Vérifiez l’état du couplage et de l’arbre. \n\n• Contraintes au niveau des tuyauteries. \n\n• Alignement grossier. \n\n• Vérifiez l’écart de couplage (alignement axial). \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 4 / 16 \n\n  \n \n\fIV.  MONTAGE \n\n1.  Le capteur désigné par la lettre « M » doit  être monté sur la machine \n\nmobile  et  celui  désigné  par  la  lettre  «  S  »  sur  la  machine  fixe.  Les \n\ncapteurs seront assemblés sur leur fixation en V, et placés de chaque côté \n\ndu couplage.  \n\n2.  Maintenez la fixation en V en position verticale et montez-la sur les arbres \n\nde l’objet de la mesure. \n\nTirez sur l’extrémité ouverte de la chaîne, tendez-la de façon à éliminer le \n\nmou et attachez-la au crochet.  \n\n3.  Bien tendre la chaîne à l’aide de la vis de tension. Le cas échéant, utilisez \n\nle tenseur fourni. Évitez de trop serrer. Si le diamètre de l’arbre est trop \n\nimportant,  les  chaînes  peuvent  être  allongées  à  l’aide  de  chaînes \n\nsupplémentaires. \n\n4.  Réglez la hauteur du capteur en le faisant glisser sur les rails jusqu’à ce \n\nque les deux lasers soient alignés. Confirmez ces réglages en refermant les \n\ndeux pinces situées au dos des capteurs. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 5 / 16 \n\n  \n \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fV. \n\n DEMARRAGE DU PROGRAMME \n\nDémarrez le programme en touchant l’icône d’alignement d’arbre horizontal \n\ndu menu principal et appuyez sur OK. \n\nUne table de tolérances s'affiche dès que le programme est démarré.  \n\nSélectionnez la tolérance et appuyez sur OK. \n\nAccédez aux paramètres pour sélectionner les paramètres requis.  \n\nVI.  TABLE DES TOLERANCES \n\nLes tolérances  d’alignement dépendent  en grande partie de la vitesse de rotation des arbres. \n\nL’alignement des machines doit être effectué en fonction des tolérances du fabricant. La table \n\nfournie  avec  FIXTURLASER  GO  Pro  peut  être  utile  si  aucune  limite  n’est  indiquée.  Les \n\ntolérances suggérées peuvent servir de point de départ pour le calcul de tolérances en interne \n\nlorsque les tolérances recommandées par le fabricant ne sont pas disponibles. Ces tolérances \n\nreprésentent les déviations maximales autorisées par rapport aux valeurs recherchées.  \n\nSélection de tolérances \n\nLa flèche de gauche indique la tolérance sélectionnée.  \n\nSélectionnez la tolérance en les faisant défiler et appuyez sur OK. \n\nSaisissez une tolérance personnalisée \n\n1. Faites défiler jusqu'à la dernière rangée. \n\n2. Saisissez un nom de tolérance et une vitesse de rotation, et appuyez sur OK ou déplacez le \n\ncurseur vers la droite.  \n\n3. Saisissez une tolérance pour les valeurs d'angles, et appuyez sur OK ou déplacez le curseur \n\nvers la droite. \n\n4. Saisissez une tolérance pour les compensations, et appuyez sur OK ou déplacez le curseur \n\nvers la droite. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 6 / 16 \n\n  \n \n \n \n\fVII.  PARAMÈTRES \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 7 / 16 \n\n  \n \n \n \n \n\fVIII.  SAISIE DES DIMENSIONS \n\nSOFTCHECK : Allez à Softcheck pour vérifier les pieds boiteux. Voir le chapitre « Softcheck ». \n\nVALEURS CIBLES: Allez à Valeurs cibles pour saisir les valeurs cibles.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 8 / 16 \n\n  \n \n \n \n \n \n \n\fIX.  METHODE DE MESURE \n\nMéthode Tripoint™ \n\nAvec la méthode Tripoint, les conditions d’alignement peuvent être calculées en enregistrant \n\ntrois points tout en faisant pivoter les arbres d’au moins 90 degrés.  \n\nREMARQUE  :  Les  arbres  doivent  être  couplés  lors  d’une  mesure  à  l’aide  de  la  méthode \n\nTripoint afin d’obtenir des résultats aussi fiables et précis que possible.  \n\nCONSEIL : Plus l’angle de mesure des trois points est grand, plus le nombre de mouvements et de \n\nrépétition des mesures sera faible. Angle minimum entre les mesures : 45°.  \n\nUne flèche verte clignotante indique les positions de mesure appropriées. \n\nX.  ENREGISTREMENT DES POINTS DE MESURE \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 9 / 16 \n\n  \n \n \n \n \n \n \n \n \n \n\fXI.  RESULTATS DES MESURES \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 10 / 16 \n\n  \n \n \n \n \n \n \n \n\fXII.  ÉVALUATION DES RESULTATS \n\nLes valeurs angulaires et de compensation servent à déterminer la qualité d’alignement. \n\nCes  valeurs  sont  comparées  aux  tolérances  d’alignement  afin  de  déterminer  les  éventuelles \n\ncorrections  nécessaires.  Si  les  tolérances  appropriées  sont  sélectionnées  dans  la  table  de \n\ntolérances, les symboles décrits ci-dessus indiquent si les valeurs d’angle et de compensation \n\nrespectent ou non ces tolérances. \n\nLes valeurs de pied indiquent les positions des pieds de la machine mobile sur lesquelles des \n\ncorrections peuvent être effectuées. \n\nEn fonction du résultat, le programme guidera également l'utilisateur.  \n\nTout d'abord, le programme recommandera toujours à l'utilisateur de sauvegarder la mesure. \n\nPuis,  si  le  résultat  de  mesure  indique  que  la  machine  est  mal  alignée,  il  sera  conseillé  à \n\nl'utilisateur d'aller à la section calage.  \n\nSi le résultat de mesure se trouve au sein des tolérances, le système conseillera à l'utilisateur \n\nde quitter la phase de mesure. \n\nEnregistrer le résultat de mesure.                                        \n\nAller à calage.   \n\nXIII.  CALAGE \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 11 / 16 \n\n  \n \n \n \n \n\fXIV.  ALIGNEMENT \n\nXV.  AUTRES FONCTIONS \n\nIndicateur de desserrage \n\nLe système comporte une fonction de détection de jeu de couplage et de desserrage destinée à \n\nfournir  une  précision  optimale.  Il  affiche  l’indicateur  de  desserrage  si  l’une  des  conditions \n\nsuivantes est remplie : \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 12 / 16 \n\n  \n \n \n \n \n\f· Les unités M et S sont éloignées de plus de 3 degrés. \n\n· La position angulaire mutuelle des unités M et S change de plus de 0,7° aux points de mesure \n\nsuivants, par rapport au premier point de mesure. \n\nUne fois le jeu de couplage ou le desserrement éliminé pour éviter l’une ou l’autre des situations \n\nci-dessus, le message de desserrement disparaît automatiquement. \n\nSymbole de valeur cible \n\nLorsque des valeurs cibles sont utilisées dans la mesure, cela est indiqué par la présence d’un \n\nsymbole de valeur cible dans le coin supérieur droit de l'écran. \n\nÉcran basculé \n\nL'écran peut être basculé pour avoir le moteur sur le côté gauche. \n\nSélectionnez écran basculé dans les paramètres.  \n\nMesure avec inclinomètres désactivés \n\nSi les inclinomètres ne fonctionnent pas correctement, p.ex. en cas de fortes vibrations, il est \n\npossible de les désactiver. \n\n• Désactivez les inclinomètres dans les paramètres. \n\nUne fois les inclinomètres désactivés, le système fonctionnera normalement, hormis en ce qui \n\nconcerne les points suivants : \n\n• Les  mesures  doivent  être  enregistrées  conformément  à  la  «  méthode  de  l'horloge  ». \n\nEnregistrez la première mesure à 9 h, faites pivoter les arbres de 180° et enregistrez la deuxième \n\nmesure à 3 h, faites pivotez de 90° vers l'arrière jusqu'à 12 h afin d'enregistrer la troisième et \n\ndernière mesure. \n\n• Pendant l'alignement, utilisez les boutons haut et bas pour passer de l'affichage horizontal à \n\nl'affichage vertical de la machine et vice versa.  \n\nChangement d'affichage.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 13 / 16 \n\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fXVI.  CONSIGNES DE SECURITE \n\n•  Enlevez les piles pour éviter tout endommagement. \n\n•  Ne jamais regarder directement le rayon laser. \n\n•  Ne jamais diriger le rayon laser directement dans les yeux de quelqu’un. \n\n•  Les commandes, réglages ou exécutions de procédures autre que ceux indiqués dans le \nprésent document sont susceptibles d’entrainer une exposition a des rayonnements. \n\n•  Les  unités  de  mesure  (M4  et  S4)  peuvent  être  branchées  au  chargeur  pour  être \n\nrechargées tout en restant dans la mallette. \n\n• \n\nIl est important que le capot de la mallette soit ouvert pendant le chargement ; dans le \n\ncas  contraire,  le  système  ne  pourrait  être  correctement  chargé  et  pourrait  se  trouver \n\nendommagé. \n\n•  Le système doit être nettoyé avec un chiffon ou un tampon en coton humidifié à l’aide \n\nd’une solution savonneuse peu concentrée, hormis les surfaces vitrées du détecteur et \n\ndu laser, qui doivent être nettoyées à l’alcool. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 14 / 16 \n\n  \n \n \n \n \n \n \n\f•  Pour un fonctionnement optimal, les ouvertures de diodes laser, les surfaces de détection \n\net les bornes des connecteurs doivent être exempts de graisse et de poussière. L’unité \n\nd’affichage doit être maintenue propre et la surface de l’écran doit être protégée contre \n\nles rayures. \n\n•  Évitez d’utiliser des chiffons en papier, qui \n\n•  Risquent de rayer la surface du détecteur. \n\n•  Évitez d’utiliser de l’acétone. \n\nXVII.  Questions  \n\nEtablir une méthode mathématique pour aligner deux axes ? \n\nEffectuer l’alignement des arbres en utilisant les comparateurs à Cadran, ainsi le fichier \nfourni ? \n\nIl est impératif de rédiger le compte rendu sur place \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 15 / 16 \n\n  \n \n \n \n \n \n \n \n \n\fStructure du compte rendu de TP \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 16 / 16 \n\n  \n \n \n \n\f"
}