{
    "content": "TP7 \n\nSIMULATION DES VIBRATIONS AVEC SIMULINK  \n\nANALYSE MODALE EXPERIMENTALE \n\nMINISHAKER \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\nAnnée Universitaire : 2022-2023 \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 0 / 11 \n\n \n  \n \n \n \n \n \n\fAttention : Deux rapports identiques auront une note égale à 0. \n\nRemarque Importante \n\nLe rapport à rendre doit :  \n\n•  Être clair et rédigé selon les normes de rédactions de rapport (page de garde, titre, table \n\ndes matières, résumé, introduction, objectifs, ……, conclusions et recommandations). \n\n•  Contenir les explications des objectifs visés par le TP. \n\n•  Contenir les résultats et analyses. \n\nL’objectif de ce travail pratique est de : \n\n•  Comprendre les bases de la smuiltaion des vibration par Simulink. \n\n•  Ecriture des équations adaptées au calcul numérique : \n\n•  Construction de schémas-blocs \n\n•  Étudier le comportement dynamique d’un système à 1DDL. \n\n•  Etudier le comportement dynamique d’un système à 2DDL. \n\n•  Simulation numérique d’une fonction échelon \n\n•  Simulation numérique d’une fonction créneau \n\n•  Simulation numérique d’une fonction Rampe \n\n•  Prévoir les démarches pratiques à mettre en œuvre pour les applications industrielles, \n\n• \n\nIdentifier les méthodes, normes et procédures nécessaires. \n\n1.  Introduction : \n\nTous les systèmes n’ont pas de solution analytique, c’est en particulier le cas quand l’excitation \n\nest  complexe  ou  quand  les  systèmes  sont  non  linéaires.  Il  est  alors  nécessaire  d’utiliser  des \n\ntechniques de calcul numérique pour obtenir une solution approchée. \n\nLe but de cette partie est de présenter une approche particulièrement conviviale de la résolution \n\nnumérique,  celle  de  la  boite  à  outils  SIMULINK  dans  l’environnement  MATLAB.  Cette \n\ntechnique requiert une mise en forme des équations particulières et la construction d’un schéma \n\nbloc, représentant les équations, qui sera utilisé par le logiciel pour résoudre numériquement \n\nlorsque les paramètres appropriés seront entrés. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 1 / 11 \n\n \n \n \n \n \n\f2.  Ecriture des équations adaptées au calcul numérique : \n\nPour chaque équation, une variable distincte a sa dérivée d’ordre le plus élevé à gauche du \n\nsignal égal est a un coefficient unité. Les autres termes sont écrits à droite du signal égal. Si \n\non  a  dû  diviser  tous  les  termes  à  droite  par  le  coefficient  su  terme  à  gauche,  on  laisse \n\ngénéralement  le  terme  diviseur  devant  une  parenthèse  qui  contient  tous  les  termes  de \n\nmanière à bien identifier, dans le schéma bloc, le terme diviseur qui correspond souvent à \n\nun paramètre clef du système ( la masse par exemple). \n\nExemple 1 :  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 2 / 11 \n\n \n \n \n \n \n \n \n \n\f3.  Construction de schémas-blocs \n\nDifférentes opérations telles que l’addition, la multiplication par une constante, l’intégration \n\n(on évite la dérivation à cause de son caractère instable en calcul numérique) sont représentées \n\npar des symboles et intégrées dans un schéma-bloc qui permet à l’ordinateur de procéder à la \n\nrésolution numérique de l’équation. \n\nRemarque : Les symboles utilisés dans le texte pour représenter les opérations sont très proches \n\nde  ceux  utilisés  dans  SIMULINK,  ils  pourront  varier  avec  le  logiciel,  par  contre  le  schéma \n\ngéneral des lignes qui relient les opérations restera le même. \n\n1.  Point de distribution \n\nLorsqu’un signal se divise en deux embranchements ou plus, on appelle ce point un point de \n\ndistribution. La figure 5.17 indique la représentation adoptée dans un tel cas. \n\n2.  Sommation \n\nQuant deux ou plusieurs signaux s’additionnent, on obtient une opération de sommation, dont \n\nle schéma-bloc peut être donné de deux façon différentes masi équvalentes, telles que montrées \n\nà la figure 5.18. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 3 / 11 \n\n \n \n \n \n \n \n \n\f3.  Multiplication par une constante (ou gain) \n\nLa multiplication par une constante (ou gain) se représente très simplement par un bloc où \n\nla constante est indiqué comme sur la figure 5.19. En vibration, les gains seront composés \n\ndes paramètres physiques de la structure (m,c,k) ou des paramètres modaux. \n\n4.  Intégration \n\nL’intégration se représente par le symbole 1\n\n𝑠⁄  par référence à la représentation sous forme \nde fonction de transfert ou l’intégration est équivalente à la division par la variable s (figure \n\n5.20). Un paramètre important à entrer sera la valeur initiale, point de départ de l’intégration \n\nnumérique,  c'est-à-dire  𝑥̇ (0)  dans  l’intégrateur  qui  donne  la  vitesse  et  𝑥(0)  dans \n\nl’intégrateur qui donne le déplacement. \n\n4.  Signaux d’excitation (ou signaux sources) \n\nToutes sortes de signaux sont disponibles pour l’excitation, fonction échelon, rampe, \n\nexcitation harmonique, excitation aléatoire, fonctions trigonométriques, etc \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 4 / 11 \n\n \n \n \n \n \n \n\f5.  Graphique de sortie \n\nIl y des fonctions de visualisation rapide de n’importe quelle variable dans le diagramme telle \n\nque  « scope ».  Cependant,  pour  pouvoir  facilement  éditer  les  graphiques  de  sortie,  il  est \n\nrecommandé d’envoyer, à l’aide de « Workspace », les résultats dans un ficher de sortie qui \n\nseront ensuite visualisés dans Matlab. Ceci est illustré dans la figure 5.21 où deux fichiers de \n\nsotie sont utilisés, un pour la variable f(t) et un pour la variable t extraite de la simulation à \n\nl’aide de la fonction « Clock »  \n\n6.  Principe de construction du schéma-bloc \n\nVous développerez certainement votre propre approche de construction d’un schéma-bloc avec \n\nl’expérience, Cependant pour commencer l’approche suivante est suggérée : \n\ni.  Tracer  autant  de  ligne  d’intégration  horizontales  qu’il  y  a  d’équation  (donc \n\nd’inconnues), sur chaque ligne mettez autant d’intégration en série qu’i y a de niveau \n\nde différenciation entre les expressions extrêmes de la variable. \n\nii.  Pour les variables connues (sources d’excitation), indiquez-les à part ou construisez-\n\nleur  une  ligne  d’intégration  si  la  variable  est  présente  à  plus  d’un  niveau  de \n\ndifférentiation dans l’équation. \n\niii.  Placer  un  « gain »  en  amont  de  chaque  ligne  ayant  pour  valeur  celle  du  coefficient \n\ndevant le crochet. \n\niv.  « Amenez » chacune des expressions dans le crochet dans une sommation située en \n\namont  du  gain.  Pour  chaque  expression  « tirez  un  fil »  de  là  où  est    la  variable, \n\nmultipliez  par  une  constante  au  besoin  (« gain »)  et  entrez  le  résultat  dans  la \n\nsommation en l’affectant du bon signe.²² \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 5 / 11 \n\n \n \n \n \n \n \n\fTP1 : Schéma Bloc de la réponse libre d’un système à 1DDL : \n\nFaites le schéma-bloc de l’équation différentielle à 1DDL (Equation 5.41) en considérant qu’il \n\nn’y a pas de force externe. \n\nLa masse est de 1, l’amortissement égal à 2.5 et la rigidité est k. \n\nRéponse :  \n\nQuestions supplémentaires : \n\na.  Justifier le schéma bloc proposé. \n\nb.  Dessiner les résultats trouvés. \n\nc.  Varier les données et représenter les résultats en conséquences. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 6 / 11 \n\n \n \n \n \n \n \n \n \n\fTP2 : Schéma Bloc de la réponse libre d’un système à 2DDL : \n\nFaites le schéma-bloc de l’équation différentielle à 2DDL (Equation 5.44) en considérant qu’il \n\nn’y a pas de force externe. \n\nRéponse :  \n\nQuestions supplémentaires : \n\nd.  Justifier le schéma bloc proposé. \n\ne.  Dessiner les résultats trouvés. \n\nf.  Varier les données et représenter les résultats en conséquences. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 7 / 11 \n\n \n \n \n \n \n \n \n \n\f7.  Paramètres importants pour la simulation numérique \n\nLe pas de temps utilisé dans le calcul doit être suffisamment petit par rapport au phénomène \n\nobservé.  Par  exemple  en  vibration,  l’ingénieur  a  souvent  une  bonne  idée  de  la  fréquence \n\nd’oscillation du phénomène qu’il modélise. Il choisira donc un pas de temps de l’ordre de 10 \n\nfois plus petit que la période correspondante. \n\nL’approche recommandée dans un premier temps est donc de fixer le pas de diminution du pas \n\nde temps (option « fixed step ») à cette valeur et d’observer par essai-erreur si une diminution \n\ndu pas de temps change le résultat. Les options plus sophistiquées du logiciel telle que l’option \n\n« variable  step »  pourront  être  utilisées  plus  tard,  un  des  inconvénients  de  cette  option  est \n\nd’avoir  un  pas  de  temps  tellement  grand  que  la  représentation  temporelle  comprendra  des \n\nsegments de droite visibles. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 8 / 11 \n\n \n \n \n \n \n\fTP3 : Simulation numérique d’une fonction échelon \n\nFaites le schéma-bloc de la fonction échelon appliqué à un système à 1DDL. \n\nRéponse :  \n\nQuestions supplémentaires : \n\na.  Justifier le schéma bloc proposé. \n\nb.  Dessiner les résultats trouvés. \n\nc.  Varier les données et représenter les résultats en conséquences. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 9 / 11 \n\n \n \n \n \n \n \n \n \n \n\fTP4 : Simulation numérique d’une fonction créneau \n\nFaites le schéma-bloc de la fonction créneau appliqué à un système à 1DDL. \n\nRéponse :  \n\nQuestions supplémentaires : \n\na.  Justifier le schéma bloc proposé. \n\nb.  Dessiner les résultats trouvés. \n\nc.  Varier les données et représenter les résultats en conséquences. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 10 / 11 \n\n \n \n \n \n \n \n \n \n\fTP5 : Simulation numérique d’une fonction Rampe \n\nFaites le schéma-bloc de la fonction rampe appliqué à un système à 1DDL. \n\nRéponse :  \n\nQuestions supplémentaires : \n\na.  Justifier le schéma bloc proposé. \n\nb.  Dessiner les résultats trouvés. \n\nc.  Varier les données et représenter les résultats en conséquences. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\n        Page 11 / 11 \n\n \n \n \n \n \n \n\f"
}