{
    "content": "TP8 \n\nEQUILIBRAGE DES MASSES À PISTON \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH \n\nAnnée Universitaire : 2022-2023 \n\nAnnée Universitaire: 2017-2018 \n\n  \n \n \n \n \n \n\fAttention : Deux rapports identiques auront une note égale à 0. \n\nRemarque Importante \n\nLe rapport à rendre doit :  \n\n•  Etre clair et rédigé selon les normes de rédactions de rapport (page de garde, titre, table \n\ndes matières, résumé, introduction, objectifs, …. conclusions et recommandations). \n\n•  Contenir les explications des objectifs visés par le TP. \n\n•  Contenir les résultats et analyses. \n\n•  Respect la chronologie fournie à la fin de ce fascicule. \n\nL’objectif de ce travail pratique est la : \n\n•  Détermination des forces et moments d’inertie primaires et secondaires pour différentes \n\nconfiguration de moteur les plus communs – moteur à un, deux ou quatre cylindres. \n\n•  Détermination des forces et moment d’inertie primaires et secondaires pour différentes \n\nréglages de manivelle.  \n\n•  Effet de l’ajout d’une masse additionnelle sur un ou plusieurs pistons en fonction du \n\nréglage de manivelle  \n\n•  Comparaison  des  valeurs  mesurées  des  forces  et  des  moments  avec  les  valeurs \n\nthéoriques \n\n1. \n\nDescription \n\nModèle  de  moteur  quatre  cylindres  en  ligne  de  table  permettant  de  déterminer  les  forces  et \n\nmoments  d’inertie  primaires  et  secondaires  de  masses  en  mouvement  alternatif  et  de  les \n\néquilibrer.  Ce  système  est  un  excellent  complément  à  l’appareil  d’étude  de  l’équilibrage \n\nstatique et dynamique (TM1002).  \n\nUne colonne support se fixe à une table ou un établi adapté (non fourni) possédant une faible \n\nfréquence propre de résonance. La colonne supporte une poutre cantilever sur laquelle est fixée \n\nle modèle de moteur quatre cylindres. Ce moteur possède un vilebrequin, des bielles, des bagues \n\n(coussinets  de  tête  de  bielle),  des  pistons  et  une  culasse.  Un  module  de  contrôle  et \n\nd’instrumentation séparé (fourni) permet de commander le moteur qui entraîne le vilebrequin.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 2 / 12 \n\n  \n \n \n\fLe  vilebrequin  possède  des  parties  réglables.  Les  étudiants  peuvent  modifier  les  positions \n\nangulaires de chaque partie par rapport aux autres parties afin de changer l’angle de manivelle. \n\nAfin  d’éviter  tout  problème  lors  des  essais,  les  différentes  parties  du  vilebrequin  ont  été \n\néquilibrées pour chaque angle permis par les bielles.  \n\nLe vilebrequin est équipé d’un capteur qui est relié au module de contrôle et de mesure afin de \n\nmesurer  et  d’afficher  la  vitesse  moteur.  Ce  capteur  fourni  une  impulsion  à  chaque  passage \n\ncorrespondant  au point mort haut  du premier piston.  Chaque piston possède un trou taraudé \n\npermettant aux étudiants d’ajouter des masses (fournies avec le système) afin de faire varier \n\nson poids.  \n\nLa colonne support vient se fixer à un établi robuste (non fourni), de manière à ce que le centre \n\nde masse du moteur soit situé sur l’axe de la poutre cantilever. Celle-ci est équipée de jauges \n\nde  déformation  afin  de  déterminer  les  déformations  en  flexion  et  en  torsion.  Les  jauges  se \n\nconnectent au module de contrôle et de mesure qui étalonne et traite leurs signaux et fourni les \n\nsorties pour l’oscilloscope optionnel (OS1).  \n\nLes  étudiants  déterminent  d'abord  les  vitesses  de  résonnance  du  moteur.  Ils  testent  ensuite \n\ndifférentes  configurations  de  moteur  pour  comprendre  la  notion  d'équilibrage  et  comment \n\nréaliser celui-ci avec des masses à mouvement alternatif déséquilibrées.   \n\nUn capot transparent démontable avec un micro contacteur de sécurité protège les étudiants des \n\npièces en mouvement. \n\nAccessoires nécessaires : \n\nUn Oscilloscope (OS1) – nécessaire pour visualiser les forces dynamiques, les formes d’ondes \n\ndes moments et les amplitudes. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 3 / 12 \n\n  \n \n\f2. \n\nExpériences \n\n•  Expérience 1 : Choix des vitesses de votre expérience. \n\n•  Expérience 2 : Forces dans un moteur à un cylindre. \n\n•  Expérience 3 : Forces et Moments dans un moteur à deux cylindres. \n\n•  Expérience 4 : Forces et Moments dans un moteur à quatre cylindres. \n\nFigure 1: Principe de fonctionnement d'un moteur essence 4 Temps \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 4 / 12 \n\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fExpérience 1 : Choix des vitesses de votre expérience. \n\nBut : \n\nTrouver les fréquences résonnantes principales de vibration pour le moteur dans sa marge de \n\nvitesse normale, ainsi vous pouvez les éviter dans vos expériences postérieures. \n\nNote : \n\nComme  mentionné  dans  la  section  de  théorie,  le  moteur  a  jusqu’à  quatre  fréquences  de \n\nrésonance principales dans sa marge de vitesse normale ou il vibrera verticalement et en rotation \n\navec une amplitude plus grande que celle provoqué par les forces et les moments déséquilibrés, \n\nceci  affectera  vos  résultats  normaux  d’expérience  quand  vous  trouverez  des  forces  et  des \n\nmoments, ainsi vous devez trouver les fréquences résonnantes de vibration et les éviter dans les \n\nexpériences postérieures. \n\nProcédure : \n\n1.  Créez une table des résultats blanche, semblable au tableau 2 \n\nVitesse (rev.min-1) \n\nForce (N) \n\nMoment (Nm) \n\n300 \n\n350 \n\n400 \n\n450 \n\n500 \n\n550 \n\n600 \n\n650 \n\n700 \n\n750 \n\n800 \n\n850 \n\n900 \n\n950 \n\n1000 \n\nTable 1 : Récapitulatif des résultats \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 5 / 12 \n\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\f3.  Mettre  le  moteur  à  l’angle  de  la  manivelle  0-0-180-270.  Ce  paramétrage  donne  un \n\nmoteur asymétrique qui montrera facilement les quatre principales résonantes. \n\n4.  Connectez l’oscilloscope. \n\n5.  Démarrer  le  moteur  à  une  vitesse  minimale  et  augmenter  lentement  à  300  rev.min-1. \n\nEnregistrer  la  force  maximale  (PIC)  et  tensions  du  moment  et  multiplie  les  par  les \n\nconstantes pour trouver la force et les moments de Newton et Newton mètres. \n\n6.  Dans les étapes de 50 rev.min-1 jusqu’à 1000 rev.min-1, augmenter la vitesse du moteur \n\net enregistrer les valeurs maximales de force et de moment. Vous devez noter que le \n\nmoteur vibre plus sur certaines vitesses (ses fréquences de résonnances). \n\nATTENTION \n\nNe pas laisser le moteur vibrer à ses fréquences résonnantes pendant de longues périodes \n\n(pas plus de quelques secondes). Il créera des niveaux de bruit élevés et peut endommager \n\nvotre table et ses fixations. \n\nAnalyse des résultats : \n\nRéaliser un graphique de force et de moment (axe vertical) contre la vitesse. \n\nVotre graphique devrait afficher une tendance générale de hausse de force et de moments quand \n\nla vitesse augmente, mais il doit aussi montrer trois ou quatre inhabituelles ‘pics’ où il atteint \n\nune fréquence de résonnance (vitesse), vous trouverez peut-être qu’un des pics commence près \n\nde la vitesse maximale de moteurs, laissant seulement trois pics évidents. \n\nDe vos résultats, vous pouvez voir la vitesse que vous devez éviter pour vos autres expériences.  \n\nCes résultats montrent que vous pouvez utiliser uniquement en toute sécurité de vitesse jusqu’à \n\nenviron 500 rev.min-1 avec le moteur utilisé dans cet essai.  \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 6 / 12 \n\n  \n \n \n \n \n \n\fExpérience 2 : Forces dans un moteur à un cylindre. \n\nBut : \n\n-  Comparer des résultats calculés et réels des forces dans un moteur à un cylindre. \n\n-  Prouver la théorie qu’un moteur a un cylindre à des moments très petits ou nuls. \n\nProcédure : \n\n1.  Créez une table de résultats blanche, semblable au tableau 2. \n\nForces dans un moteur à un cylindre \n\nMoteur \n\nAngle \n\nAngle \n\nAngle \n\nAngle \n\nVitesse \n\nForce \n\ncrête \n\nmanivelle A \n\nmanivelle B \n\nmanivelle C \n\nmanivelle D \n\n(rev.min-1) \n\nmesurée (N) \n\nUn cylindre  0 \n\n0 \n\n0 \n\n0 \n\nTable 2 : tableau des résultats \n\n2.  Placez les angles de la manivelle sur 0-0-0-0. Ceci met tous les pistons dans la même \n\ndirection, simulant un moteur à un cylindre. \n\n3.  Connectez l’oscilloscope pour monter les forces et les moments. \n\n4.  Tournez le moteur à une vitesse appropriée, à partir de n’importe quelle de ses vitesses \n\nde résonnance (expérience 1), mais assez haut pour avoir de bonnes formes d’onde. \n\n5.  Esquissez la forme d’onde de force et notez sa valeur de crête. \n\n6.  Arrêtez le moteur et éteignez l’alimentation. \n\nAnalyse des résultats : \n\nEsquissez la disposition du piston pour comprendre comment le moteur fonctionne. Notez que \nle rendement de moment est très petit et peut être ignoré, prouvant la théorie pour un moteur à \nun cylindre. \n\nUtilisez les équations de la section théorie pour trouver les forces de perturbation primaires et \nsecondaires maximales et théorique du piston a une vitesse donnée, les additionnes ensemble \npour trouver la force crête totale et la comparer avec vos résultats actuels. \n\nComparez la forme d’onde avec celle donnée pour un simple cylindre da la section de théorie, \nprouvant que la force secondaire et primaire se combinent pour donner une forme d’onde non \nsinusoïdale, sui atteint le maximum positif du haut du centre mort. \n\nRépétez  l’expérience  avec  les  masses  supplémentaires  sur  les  positions  intérieures,  notez \ncomment les forces augmentent pour la même vitesse de moteur. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 7 / 12 \n\n  \n \n \n \n \n\fExpérience 3 : Forces et Moments dans un moteur à deux cylindres. \n\nBut :  \n\nMontrez les forces et les moments dans un moteur à deux cylindres (twin 180)  et comparez \n\navec la théorie \n\nProcédure : \n\n7.  Créez une table de résultats blanche, semblable au tableau 3. \n\nForces dans un moteur à un cylindre \n\nMoteur \n\nAngle \n\nAngle \n\nAngle \n\nAngle \n\nVitesse \n\nForce  crête \n\nMoment crête \n\nmanivelle \n\nmanivelle \n\nmanivelle \n\nmanivelle \n\n(rev.min-1) \n\nmesurée (N) \n\nmesuré (Nm) \n\nA \n\n0 \n\nB \n\n0 \n\nC \n\n180 \n\nD \n\n180 \n\nDeux \n\ncylindres \n\n(twin 180) \n\nTable 3 : tableau des résultats \n\n8.  Placez les angles de la manivelle sur 0-0-180-180. Ceci met les pistons A et B ensemble \n\ncomme un, et les pistons C et D ensemble comme un mais à 180 degrés en opposition \n\nde phase que A et B, Ceci simule un moteur à deux cylindre (twin 180). \n\n9.  Connectez l’oscilloscope pour monter les forces et les moments. \n\n10. Tournez le moteur à une vitesse appropriée, à partir de n’importe quelle de ses vitesses \n\nde résonnance (expérience 1), mais assez haut pour avoir de bonnes formes d’onde. \n\n11. Esquissez  la  forme  d’onde  de  force  et  notez  sa  valeur  de  crête  (déconnectez  chaque \n\nentrée séparément pour vous aider à voir les deux différentes formes d’ondes. \n\n12. Arrêtez le moteur et éteignez l’alimentation. \n\nAnalyse des résultats : \n\nEsquissez la disposition du piston pour comprendre comment le moteur fonctionne. \n\nComme dans la dernière expérience, Utilisez les équations de la section théorie pour trouver les \n\nforces de perturbation primaires et secondaires maximales et théorique du piston a une vitesse \n\ndonnée,  les  additionnés  ensemble  pour  trouver  la  force  crête  totale  et  la  comparer  avec  vos \n\nrésultats actuels. Comparez la forme d’onde de la force avec celle donnée dans la théorie, elle \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 8 / 12 \n\n  \n \n \n \n \n \n\fdoit être sinusoïdale et montre principalement les forces secondaires (à une vitesse double de \n\nvilebrequin) \n\nUtilisez les équations de la section théorie pour trouver les moments théoriques à une vitesse \n\ndonnée, et les comparer avec vos résultats actuels. Comparez la forme d’onde du moment avec \n\ncelle de la théorie, elle doit être sinusoïdale et montre principalement les moments primaires (à \n\nune vitesse double de vilebrequin) \n\nRépétez l’expérience avec les masses supplémentaires sur une paire du piston, notez comment \n\nles valeurs crêtes de la force et du moment sont supérieures pour la même vitesse de moteur. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 9 / 12 \n\n  \n \n \n \n \n\fExpérience 4 : Forces et Moments dans un moteur à quatre cylindres. \n\nBut : \n\nMontrez les forces et les moments dans deux différents moteurs à quatre cylindres et comparez \n\navec la théorie \n\nProcédure : \n\n1.  Créez une table de résultats blanche, semblable au tableau 4. \n\nForces dans un moteur à un cylindre \n\nMoteur \n\nAngle \n\nAngle \n\nAngle \n\nAngle \n\nVitesse \n\nForce  crête \n\nMoment crête \n\nmanivelle \n\nmanivelle \n\nmanivelle \n\nmanivelle \n\n(rev.min-1) \n\nmesurée \n\nmesuré (Nm) \n\nA \n\n0 \n\nB \n\n180 \n\nC \n\n180 \n\nD \n\n0 \n\n(N) \n\nStandard \n\n180 \n\n90 degré \n\n0 \n\n180 \n\n90 \n\n270 \n\nTable 4 : tableau des résultats \n\n2.  Placez les angles de la manivelle sur 0-180-180-0. Ceci simule un moteur standard avec \n\nun ordre de mis à feu 1-3-4-2. Les deux pistons B et C se déplacent comme une paire et \n\nles deux pistons extérieur A et D se déplacent comme une paire mais à 180 degrés avec \n\nles pistons de milieu. \n\n3.  Connectez l’oscilloscope pour monter les forces et les moments. \n\n4.  Tournez le moteur à une vitesse appropriée, à partir de n’importe quelle de ses vitesses \n\nde résonnance (expérience 1), mais assez haut pour avoir de bonnes formes d’onde. \n\n5.  Esquissez  la  forme  d’onde  de  force  et  notez  sa  valeur  de  crête  (déconnectez  chaque \n\nentrée séparément pour vous aider à voir les deux différentes formes d’ondes. \n\n6.  Arrêtez le moteur et éteignez l’alimentation. \n\n7.  Répétez l’expérience avec des angles de manivelle 0-180-90-270 ceci simule un moteur \n\navec deux paires de pistons déphasé à 180 degrés entre eux et chaque paire déphasé é à \n\n90 degrés. A chaque alternance le piston atteint le sommet du centre mort tous les 90 \n\ndegrés. \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 10 / 12 \n\n  \n \n \n \n \n \n \n \n \n \n\fAnalyse des résultats : \n\nEsquissez la disposition du piston pour comprendre comment le moteur fonctionne. \n\nComme dans la dernière expérience, Utilisez les équations de la section théorie pour trouver les \n\nforces  de  perturbation  primaires  et  secondaires  maximales  et  théorique  du  piston  a  une  vitesse \n\ndonnée, les additionnés ensemble pour trouver la force crête totale et la comparer avec vos résultats \n\nactuels. Comparez la forme d’onde de la force avec celle donnée dans la théorie, les deux moteurs \n\ndoivent montrer des forces primaires à faible valeur, montrant qu’ils sont bien équilibrés pour les \n\nforces de premier ordre. Le moteur standard doit montrer des forces de second ordre prouvant le \n\nproblème démontre en théorie. Cependant le moteur à 90 degrés des forces secondaires nulles ou \n\ntrès basses et faible force résultante. \n\nUtilisez les équations de la section théorie pour trouver les moments théoriques à une vitesse donnée, \n\net les comparer avec vos résultats actuels. Comparez la forme d’onde du moment avec celle de la \n\nthéorie, elles doivent montrer que le moteur standard est mieux équilibré pour les moments. \n\nCeci  démontre  que  les  ingénieurs  préfèrent  les  moteurs  standard  0-180-180-0  que  0-180-270-90 \n\ngrâce à leurs moments équilibrés même si ce n’est pas le cas pour les forces. \n\nEssayez différentes dispositions pour voir si vous pouvez améliorer la disposition 0-180-180-0 \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 11 / 12 \n\n  \n \n \n \n \n \n \n\fStructure du compte rendu de TP \n\nProf. Smail ZAKI / Prof. Mohamed ABOUSSALEH   \n\n        Page 12 / 12 \n\n  \n \n \n \n\f"
}