{
    "content": "Psychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nCHAPITRE 1\nCOMMENT COMMUNIQUER EFFICACEMENT?\n\nIntroduction\n1. Attitudes, Croyances, Valeurs\n2. Consonance cognitive\n3. Dissonance cognitive\n4. Attitudes de Porter\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nDÉFINITIONS\n\n• Attitudes / Attitudes https://www.youtube.com/watch?v=QVh-kJRskPw\n\nSe sont des réactions personnelles stables et constantes que l’on retrouve face à une\nsituation , événement, etc.\nC’est un État mental et neurophysiologique exerçant une influence dynamique sur l’individu\nen le préparant à agir d’une manière particulière face à un événement .\n\n• Comportements/behaviors\n\nIls représentent l’acte, l’action ( manière d’agir)\n\nC’est l’ensemble des réactions ( agissement) adoptées par l’individu , dans son \nenvironnement et face à des  situations données. (Avoir un comportement hypocrite,  \nméfiant)\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nDÉFINITIONS\n\n• Croyances/beliefs\n\nElles représentent ce que nous pensons ..\nIssues du milieu dans lequel nous vivons, certaines font partie de notre  culture.\n\nOn distingue 5 types de croyances:\n\n• Croyances collectives partagées par tous\n\n• Croyances personnelles résultent de notre expérience\n• Croyances d’autorité proviennent du groupe de référence auquel  nous appartenons\n• Croyances sans conséquences n’ont pas d’importance et peuvent  être remises en cause\n\nfacilement.\n\n• Pensées/Cognition\n\nEnsemble de Facultés psychologiques tant affectives qu’intellectuelles.\n\nValeurs/ Values  : Elles reflètent l’importance que nous attribuons à nos actes, aux  choses, aux gens, \naux événements à un moment donné. Par exemple,  Valeurs personnelles (famille, travail, ne pas voler, ne \npas mentir..)  Valeurs morales (républicaines, démocratiques, liberté, égalité,  fraternité, solidarité)\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nTHÉORIE DE LA DISSONANCE \nCOGNITIVE\n\n•\n\n•\n\nLe psychologue social Leon Festinger a développé pendant presque un ½ siècle la théorie de la\ndissonance cognitive ( Festinger , 1957).\nAppelée aussi la théorie d’ action opinion. C’est le fait de proposer des actions qui peuvent aller dans\nle sens contraire de nos croyances et attitudes.\n\n• La dissonance cognitive repose sur trois hypothèses fondamentales:\n\n1. Les humains sont sensibles aux incohérences entre les actions et les croyances\n2. La reconnaissance de cette incohérence entraînera la dissonance , et va motiver un  individu \n\nà résoudre la dissonance\n\n3. Dissonance sera résolu dans l'une des trois façons ( changer les croyances, changer  l’action, \n\nchanger la perception de l’action)\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nEXEMPLES:\n\nO  Je fumes alors que je sais que c’est mauvais pour la santé, je le dis\n\n• O  Dites-vous que tout le monde triche alors pourquoi pas vous ?\n\n• O  J'ai choisi X , mais il y a des choses qui me plaisent dans Y\n\n• O On demande à un vendeur d’écouler des micro-ordinateurs abîmés sans révéler les  \ndommages aux clients\n\n• Quand les attitudes, valeurs et croyances sont en contradiction, ceci plonge le sujet dans\nun état inconfortable, un malaise psychologique, une tension, etc.\n\n•\n\n• Les individus préfèrent la consonance entre attitude et comportement.\n\n• Ils cherchent alors à changer soit d’attitude, soit de comportement pour revenir à l’état de\nconsistance cognitive.\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nEXEMPLES DE CONSONANCE/DISSONANCE  \nCOGNITIVES\n\n•\n\nLa consonance: C’est le fait d’adapter nos pensée à nos actes,  de réduire les contradictions et donc les\ndissonances.\n\n•\n\n•\n\n•\n\nExemple 1: Je pense qu’il est mauvais de fumer, je le dis et je ne fume pas\n\n• Valeur = discours= comportement => congruence= consonance\n\nExemple 2: Je pense qu’il est mauvais de fumer, je le dis et je fume\n\n•\n•\n\nValeur= discours # comportement => incongruence= \ndissocance\n\nExemple 3: Je pense qu’il est mauvais de fumer, je ne le dis pas et je fume\n\n•\n\nValeur # discours=comportement =>  incongruence=dissonance\n\n\fPsychosociologie de la communication. S3 cycle ingénieur 2022-23\n\nCOMMUNICATION OPTIMALE \n\n• Attitudes de Porter\n\n• Selon Porter, une situation optimale de la communication permet\n\nl’expression d’autrui et défini l’attitude d’ECOUTE ACTIVE,\nc’est-à-dire, une situation où l’autre ne se sent ni jugé, ni analysé, ni interprété, ni guidé par des conseils, ni manipulé ou\nharcelé par des questions, etc. Il s’agit d’une situation où il y a :\n\n–\n–\n–\n–\n–\n\nnon évaluation,\nnon interprétation\nnon Conseil/aide/soutien\nnon questionnement systématique /enquête\ncompréhension ( reformulation)\n\n• Situation optimale selon Rogers\n•\n\nL’orientation non directive de C. Rogers estime qu’ une situation optimale de la communication doit être similaire à la\nrelation thérapeutique ( la centration est fixée sur le sujet) est fondée sur 4 composantes:\n\n–\n–\n–\n–\n\nL’acceptation inconditionnelle de l’autre\nLa neutralité bienveillante\nL’authenticité\nL’empathie\n\n\f"
}