{
    "content": "Comment réussir une communication optimale ? \n\nDissonance et consonance cognitive \n\nAttitudes de porter \n\nEcoute bienveillante ou empathie : Carl Rogers  \n\n1-  Dissonance cognitive : Exemples et analyse \n\n“ Sylvain veut devenir végétarien pour l’écologie, mais il ne parvient pas à se passer de son \nhamburger.  Pour réduire son stress il recourt à des pensées qui le rassurent : “Finalement, \nl’écologie ça n’est pas si important que ça !” ou “Oh, un hamburger par semaine, ça va hein, \nc’est presque comme-ci j’étais végétarien !”. Ou encore   “Oui, mais mon hamburger ne vient \npas d’un grand groupe de fastfood mais d’un restaurant où la viande est locale et vient de la \nferme !” \n\nAnalyse : En premier lieu, sylvain a modifié la croyance elle-même : “Finalement, l’écologie \nça n’est pas si important que ça !”. \n\nIl a aussi modifié l’action : “Oh, un hamburger par semaine, ça va hein, c’est presque \ncomme-ci j’étais végétarien !”. \n\nEnfin, il a ajouté une autre donnée pour se justifier : “Oui, mais mon hamburger ne vient pas \nd’un grand groupe de fastfood mais d’un restaurant où la viande est locale et vient de la \nferme !” \n\nCes trois modifications entreprises par Sylvain visent à baisser le taux d’anxiété crée par la \ndissonance cognitive et lui permettent d’ajuster ses pensées, ses croyances… à son action. \n\nExemple 2 : Brigitte n’aime pas son emploi, mais elle y reste depuis des années. Elle sait \nqu’elle aimerait faire autre chose, mais ne peut se résoudre à quitter cette inconfortable \nsécurité. Avec le temps, elle a fini par se dire « À quoi bon… Je ne saurais rien faire d’autre \nde toute manière. ». Aujourd’hui Brigitte est fermement convaincue qu’elle ne peut rien faire \npour améliorer sa situation et elle est toujours malheureuse dans son travail… \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 1 \n\n \n \n \n \n \n \n \n \n \n \n\fAnalyse : À travers ce processus destructeur, Brigitte a manipulé sa vision de la réalité \npour faire diminuer le malaise qui s’insinuait en elle de plus en plus. Avec le temps, elle a \nfini par croire que ses fausses justifications correspondent à la réalité !  \n\nExemple 3 : Denis trouve toujours les mots pour justifier son attitude désagréable vis-à-vis \ndes autres. Voici quelques exemples de la mauvaise tournure que prennent ses pensées en \npareille situation : « Ce n’est pas si grave, elle va s’en remettre… » ; « De toute manière, elle \nl’a bien cherché ! » ; « Il est normal d’écraser les autres. C’est comme ça que vivent les gens \naujourd’hui. Seuls les plus forts gagnent ! » \n\nAnalyse : Denis tend à légitimer ses actions même si elles sont répréhensibles. L’identité de \nDenis est loin d’être équilibrée.  Pour se justifier, il a recours à plusieurs distorsions \ncognitives.  \n\n • Denis minimise la portée du mal qu’il fait aux autres (ce n’est pas si grave, elle va s’en \nremettre) \n\n• Il justifie ses paroles et ses actes (de toute manière, elle l’a bien cherché) \n• Il donne de la valeur à ses paroles et à ses actes « Il est normal d’écraser les autres. C’est \ncomme ça que vivent les gens aujourd’hui. Seuls les plus forts gagnent ! » \n\nExemple 4 : Danielle, quant à elle, est une femme très appréciée dans son travail. N’étant \ntoutefois pas parfaite, comme tout être humain, il lui arrive d’être désagréable avec les autres. \nQuand c’est le cas, elle reconnaît ses torts avec une certaine facilité. Lorsqu’elle agit d’une \nmanière qui contredit ses valeurs personnelles, elle se sent fautive et prend les mesures \nappropriées pour se faire pardonner. Elle ne veut pas répéter des attitudes qui sont aussi \nnuisibles à elle-même qu’aux autres. \n\n Analyse : En agissant de la sorte, Danielle rétablit la cohérence de son identité en fonction de \nses valeurs. Danielle est une femme cohérente et équilibrée. \n\nLa concordance entre le discours, les actes et les pensées permet à l’individu d’être \ndans un certain équilibre, d’apporter confiance en soi, harmonie et motivation  \n→ bien-être individuel et social.   \n\nSouvent, la tension induite par la dissonance cognitive est telle que nous sommes facilement \namenés à employer la deuxième solution suggérée plus haut : justifier le comportement ou la \ncognition en aménageant la cognition conflictuelle. \n\n→  Pour  retrouver  un  état  d’équilibre.  Il  est  important  de  pouvoir  s’en  rendre  compte.  Être \nconscient  de  ce  mécanisme  quand  nous  l’utilisons  et  ne  pas  en  faire  usage  pour se  mentir  à \nsoi-même. \n\nhttps://www.youtube.com/watch?v=UzLCAwVGVOc \n\nhttps://www.youtube.com/watch?v=8FbQCQgqNFI \n\nhttps://www.youtube.com/watch?v=52TNSjeUzIg \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 2 \n\n \n \n  \n \n\f2-  Les attitudes de porter  \n\nLe psychologue américain Elias Porter a décrit différents comportements que l’on peut \nadopter en termes d’écoute.  \n\nIl a distingué les 6 attitudes d’écoute typiques :  \n\nLe jugement-évaluation, l’interprétation, le soutien, l’investigation-enquête, la suggestion-\nautoritaire et la compréhension-empathie. \n\nAttitude Evaluation – jugement : Emettre un avis sur ce qu’exprime notre interlocuteur, sur \nun plan logique ou moral. \n Porter un jugement (positif ou négatif) : « c’est nul » « c’est bien » « je pense que… » \n« j’estime que… » « à mon avis… ». « Vous avez raison », « vous avez tort »,  \n\n Position de pouvoir par rapport à l’autre : Peut engendrer des réactions violentes et négatives \nde la part de personnes qui ne souhaitent pas être jugées ou qui ne comprennent pas et \nn’admettent pas l’attitude de jugement. \n\nConséquences : Effet POSITIF : Avec un prérequis : légitimité, compétence, intention \nclaire et partagée. Donne des points de repère pour être rassuré ou pour identifier des \npoints de progrès  \n\nEffet négatif : dévalorisation de l’estime, attitude défensive, soumission, besoin de se \njustifier, relation de dépendance, culpabilité. \n\nAttitude d’interprétation : Fait passer les propos de l’interlocuteur par le filtre de notre \nperception personnelle et de nos convictions. « Vous dites ça parce que vous croyez que … » \nou bien : « Vous voulez faire telle chose pour avoir la possibilité de… »  \nInterpréter les propos d’autrui en fonction de ses propres croyances et de ses valeurs.  « Si tu \ndis ça, c’est parce que… » « Je sais pourquoi tu m’expliques ça… » « En réalité, je sais que \n… » \nConséquences : Effet POSITIF : Si l’interprétation est exacte, sentiment d’être compris. \n Effet négatif : sentiment d’incompréhension, désintérêt, agressivité, dépendance. \n\nAttitude de soutien : « Je vous comprends, moi aussi j’ai connu de telles situations »,  \nSe positionner en protecteur, se placer en position de conseiller, protecteur et d’expert en \nsoutenant l’interlocuteur, dédramatisant la situation, cherchant à consoler, compatir. « Inutile \nde t’inquiéter, je vais t’aider… » « Ce n’est pas grave, ça va s’arranger… » « Tu ne vas te \nmettre dans tous tes états pour si peu ! » « Si j’étais toi… » « A ta place… » \n\nConséquences :  - Effet POSITIF : Se sentir soutenu dans la difficulté, redonner envie de \nse battre. \n -Effet négatif : sentiment d’être pris en pitié, limitation de l’autonomie, baisse d’estime \npersonnelle.   Soutenir en continu une personne= risque de dépendance,  \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 3 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fAttitude de suggestion ou écoute autoritaire  \n\nDonner un conseil, une consigne ou apporter une solution immédiate. Cela consiste à décider \nà la place de l’interlocuteur. \n\nElle consiste à décider ce que l’autre doit faire. » y’a qu’à » « Il faut que… » « voilà ce qu’il \nfaut faire » ; ou : « vous devriez essayer ceci ou cela » \n\nA moins d’identifier clairement les enjeux de la demande et les besoins car, à défaut, si la \nsolution n’est pas celle attendue elle pourra tout simplement être rejetée en bloc \n\nConséquences : - Effet POSITIF : Si légitimité, compétence, intention claire et partagée, \nl’attitude de décision pour donner un axe pertinent d’action sera considérée comme \nefficace et favorable au progrès \n-Effet négatif : risque d’opposition, relation de domination/soumission, agressivité… \n\nAttitude d’investigation-enquête : Enchaînement de questions systématiques selon le point \nde vue de celui qui les pose.  \n« Pourquoi ? » « Comment ?» « Quand ? » « Qui donc ? » « Quoi ? »  \n\nConséquences :- Effet POSITIF : L’enquête neutre (centrée sur lui) est perçue par l’autre \ncomme une aide, elle l’aidera à expliciter son problème, à se clarifier. L’enquête orientée \n(centrée sur soi), si elle est comprise dans son intention (faire réfléchir l’autre pour son \ndéveloppement), elle sera perçue comme une aide. Si je vais trop dans les détails, je \nrisque d'orienter l'autre, de ne pas le laisser parler, de diriger en fait la conversation.  \n- Effet négatif : sentiment d’être pris au piège, culpabilité, confusion. \n\nAttitude de compréhension-empathie  \n\nComprendre et accepter la vision de l’autre. Pour cela, il faut opérer en questionnant et en \nreformulant ses propos, sans émettre de jugement.  \n\nLa règle d’or de cette écoute est « J’accepte l’autre tel qu’il est. » \n\n Dans les faits, cela se traduit par une reformulation sans jugement, une verbalisation \némotionnelle, etc. « D’après toi… » « Je vois que… » « Tu dis que tu ressens de la peine… »  \n\nConséquences : sentiment d’être compris, respecté, confiance en soi. \n\nExercices : Trouvez une formulation pour chaque type d’écoute selon Porter \n\nVous constatez que l’un de vos collaborateurs est souvent à l’écart et semble démotivé depuis \nplusieurs semaines. Lorsque vous le saluez, il répond vaguement : « ça va ». Mais son \nexpression montre le contraire. \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 4 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n\f Vous décidez finalement de l’inviter à discuter en tête-à-tête. Dans le cadre de cet entretien \nde suivi, il finit par s’ouvrir à vous. Votre collaborateur se plaint des remarques que son \ncollègue lui fait sur le manque de rapidité dans l’exécution de ses tâches.  \n\nCorrigé :  \n\nAttitude de jugement : «je pense en effet que tu passes trop de temps sur certaines tâches et \nque ce n’est pas bien pour l’avancement du travail ». \n\nAttitude d’interprétation : « Je sais pourquoi les remarques de ton collègue te gênent : tu \npenses qu’il se moque de toi pour te décrédibiliser ». \n\nAttitude de soutien : « Ce n’est pas si grave, ne t’en fais pas pour ça, à ta place je ne me \ntourmenterai pas pour si peu ». \n\nAttitude de suggestion : « Tu n’as qu’à ignorer ses remarques, il ne faut pas croire tout ce \nqu’il te dit ». \n\nAttitude d’enquête : « Sur quoi portent ses remarques ? ». « Quand est-ce que cela a \ncommencé ? ». « Est-ce qu’il ne porte ces jugements que sur toi ? ». \n\nAttitude d’empathie : « D’après toi, ses remarques sur le temps que tu consacres à tes tâches, \nont-elles pour objectif de te nuire ? ».  \n« Je vois que tu te sens mis à l’écart ». « Tu ressens de la frustration car tu ne te sens pas \nintégré, c’est ça ? ».  \n« Si je comprends bien, ta motivation au travail diminue, car en pensant bien faire, tu finis par \nêtre critiqué par tes collègues ?»  \n« Que souhaites-tu changer dans les relations avec ton collègue ? ». \n\nCe dernier type d’écoute renvoie à l’attitude empathique. Il s’agit d’une écoute bienveillante, \nêtre capable d’accompagner sans se montrer autoritaire.  \n\nL’attitude d’empathie a pour avantage de laisser l’interlocuteur s’exprimer librement sans \nse sentir jugé, de manière authentique en livrant ses ressentis. Il peut ainsi chercher par lui-\nmême des solutions. Cette attitude permet de renforcer la confiance en soi et la \nresponsabilisation de l’interlocuteur. \n\nLa compréhension de ces types d’écoute est utile pour adapter son attitude dans les échanges \navec les interlocuteurs. En effet, le type d’écoute choisie aura des effets plus ou moins positifs \nou négatifs sur la qualité de la communication et sur l’autonomie de l’interlocuteur.  \n\n3-  Carl Rogers :  L’écoute active  \n\nL’écoute active est une notion issue des travaux du psychologue Carl Rogers.  \n\nOn parle aussi d’écoute attentive ou empathique.  \n\nL’idée générale est de permettre à un interlocuteur de s’exprimer totalement et librement, par \nune écoute motivée et une attention sincère. \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 5 \n\n \n  \n \n \n \n \n \n \n \n \n  \n \n\fPlus concrètement, l’écoute active consiste à désirer comprendre l’autre, et à le lui montrer. \nElle s’inscrit dans le cadre de la bienveillance dans la relation que ce soit sur le plan personnel \nou professionnel  \n\nÉcouter activement, c’est :  \n\n•  Entendre ce que dit une personne, en y portant une attention véritable ; \n•  S’assurer d’avoir bien compris ce que cette personne désirait communiquer, en la \n\nquestionnant et/ou en reformulant sa pensée ; \n\n•  Placer et maintenir son interlocuteur en confiance, en adoptant un mode de \n\ncommunication verbale et gestuelle adapté. \n\n=/= L’écoute passive qui est le fait d’écouter distraitement, d’une oreille, sans vraiment se \nconcentrer sur les paroles de notre interlocuteur ni chercher à en approfondir le sens.   \n\nAvantages de l’écoute active  \n\nCommenté [EAA1]:  \n\nElle présente un intérêt certain car elle facilite la communication et les relations humaines.  \n\nSavoir écouter, et favoriser l’écoute entre individus permet : \n\n•  D’éviter les conflits, les incompréhensions, les non-dits ; \n•  De minimiser les désaccords, les luttes d’influences et leurs conséquences ; \n•  De pouvoir mieux échanger et négocier lorsque cela est nécessaire, en tenant compte \n\nde l’avis de chacun afin de prendre les meilleures décisions possibles ; \n\n•  D’instaurer une bonne entente générale, une ambiance saine, plus sereine et plus \n\nagréable, d’avoir de bonnes relations avec son entourage. \n\nPour prendre du recul sur vos capacités d’écoute quelques questions peuvent \nvous aider afin de vous situer : \n\nEtes-vous généralement concentré lorsqu’une personne vous parle ?  \n\nAvez-vous tendance à attendre passivement qu’il ait achevé ?  \n\nPensez-vous parfois à autre chose lors de vos conversations, par exemple à ce que vous \nallez répondre ? \n\nSavez-vous écouter sans juger ?  \n\nÊtes-vous capable de laisser vos propres pensées ou vos idées de côté ?  \n\nVos opinions ont-elles tendance à s’immiscer dans les propos de vos interlocuteurs ? \n\nSi vous êtes manager, laisserez-vous les personnes juger et estimer leur travail, ou aurez-\nvous tendance à essayer de les amener là où vous le voulez en orientant vos questions ? \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 6 \n\n \n \n\fTenez-vous compte de la personnalité et des émotions de vos interlocuteurs lorsque \nceux-ci veulent vous expliquer quelque chose ? \n\nSavez-vous mettre vos interlocuteurs en confiance ? Pensez-vous que les autres viennent \nfacilement vous parler ? \n\nNous avons tous parfois du mal à entendre ce que les autres nous disent. \n\nLa différence peut être de taille entre ce que nous avons entendu (ou pensé entendre) et ce \nqu’une personne a réellement voulu nous dire. \n\nNotre perception personnelle interfère forcément dans nos conversations et peut nous amener \nà filtrer les propos de nos interlocuteurs.  \n\nOn ne retient alors que ce qui est pertinent à nos yeux pour conforter notre point de vue, ou \npour traduire ce qui ne fonctionne pas dans le point de vue de l’autre.  \n\nS’engager dans l’écoute active, c’est essayer de remédier à ces interférences, ou au moins de \ndiminuer leur impact dans la qualité de nos échanges avec autrui.  \n\nPour améliorer votre écoute active :  \n\nApprenez à accorder toute votre attention à la personne qui vous parle. Ne vous laissez pas \nmener par vos propres sentiments ou impulsions.  \n\nAssurez-vous d’avoir bien compris ce que la personne cherche à vous dire  \n\nAccorder une attention bienveillante à son interlocuteur \n\nLorsque vous êtes en train de discuter avec une personne : \n\nNe préparez pas ce que vous allez dire pendant que l’autre vous parle,  \n\nMontrez à la personne que vous êtes attentif pour la rassurer et l’inciter à tout dire. Regardez \nlà.  \n\nPour l’encourager à s’exprimer pleinement, vous pouvez acquiescer verbalement, ou par votre \nattitude (signe de tête, sourire). \n\nMême si vous avez compris où elle veut en venir, laissez la personne achever ses propos. \nVeillez à ne pas couper ou interrompre : cela est déstabilisant. \n\nSi vous avez des idées ou des arguments à exposer, attendez que votre interlocuteur ait achevé \nde s’exprimer avant de prendre la parole.  \n\nN’intervenez pas, même si vous n’êtes pas tout à fait d’accord.  \n\nEfforcez-vous d’abord de vérifier que vous avez bien saisi son message avant de délivrer le \nvôtre. \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 7 \n\n \n\f Peu importe que vous soyez d‘accord, ou que vous ne le soyez pas, ou que vous ayez quelque \nchose à ajouter : apprenez à écouter. Vous en parlerez ensuite. \n\nVérifier la bonne compréhension du message passé par son interlocuteur \n\nAprès avoir accordé toute votre attention à la personne qui vous parle, il reste important d’être \nsûr d’avoir saisi son message, et de lui montrer que vous l’avez écoutée et considérée.  \n\nVous pouvez reformuler les propos entendus, ou paraphraser certaines idées. Cela permettra à \nla personne de vérifier qu’elle a été comprise, et de se reprendre ou de préciser sa pensée si tel \nn’est pas le cas. \n\nVous pouvez poser quelques questions, pour montrer l’intérêt que vous portez à ce qui vous \nest dit, ou pour vérifier ou compléter votre compréhension \n\nSi la discussion est longue, proposez à votre interlocuteur de résumer ensemble l’essentiel du \nmessage, ou ses différents points. \n\nDans tous les cas, essayez de sortir de votre jugement, et de vous mettre à la place de la \npersonne en face de vous, de ressentir ses émotions et sa façon de voir les choses. Même si \nelle diffère de la vôtre.   \n\nVisez à déchiffrer le message plus que les mots.  \n\nTenez compte de la posture (la personne semble-t-elle à l’aise, gênée, stressée), \n\n Des sentiments (le sujet est-il neutre ou susceptible d’impliquer de l’émotion)  \n\nDe la personnalité pour comprendre comment la personne ressent et aborde la situation dont \nvous parlez.  \n\nPsychosociologie de la Communication. Prof. A. El Arfaoui.S3, cycle ingénieur2022-23. p. 8 \n\n \n \n \n \n \n \n \n \n\f"
}