{
    "content": "Introduction à l’analyse transactionnelle : 1-Les Etats du moi \n\nProcédez à une analyse des différents états du moi dans les situations suivantes : \n\nSituation 1 : Après un trajet éprouvant dans la circulation, charlotte arrive en pestant contre tous \nles  imbéciles  qui  ne  savent  pas  conduire.  « A  qui  on  ne  devrait  jamais  donner  de  permis,  qui \ndépassent  n’importe  où,  et  semblent  ignorer  le  clignotant ! ».  Une  fois  calmée,  elle  arrive  à  se \nmettre au travail. Son assistante lui soumet un problème délicat qui occupe toute son attention. \nTrès concentrée, elle réfléchit rapidement aux solutions possibles. Quelques coups de fil plus tard, \nune issue est en vue, charlotte se détend. Près de la machine à café, elle retrouve ses collègues qui \nracontent des histoires drôles, elle éclate de rire joyeusement. \n\nSituation 2 : Pierre est informaticien de métier, il a un côté très neutre qui fonctionne bien dans \nson métier. Face à une crise, il reste calme, trouve des solutions. Ne perdant pas ses moyens, Il \ncontinue à réfléchir calmement. Un jour, une jeune collaboratrice a éclaté en sanglots pendant \nqu’il lui expliquait une procédure, désemparé, il a continué son discours, espérant qu’elle allait se \nressaisir. Puis il a renoncé, a marmonné une vague conclusion, et laissé la jeune femme seule dans \nson bureau \n\nSituation 3 : Charlotte veut que tous les documents émanant de son équipe soient impeccablement \nprésentés dans la forme et irréprochables sur le fond, face à une proposition incomplète, elle peut \nse mettre en colère en s’adressant à ses collaborateurs : « Tu appelles ça un document client ? Tu \nvas me réécrire ça pour demain, et cette fois je veux quelque chose de sérieux. » De même, si elle \ns’aperçoit qu’elle a commis une erreur, pire si on le lui fait remarquer-, elle est furieuse contre \nelle-même : « Quelle imbécile ! Comment ai-je pu écrire ça ? » \n\nSituation 4 : Charlotte sort d’une réunion avec des clients qui ne s’est pas très bien passée. Elle va \nensuite en rendre compte à son chef, qui répond : \n\n1-  « Vous avez été mauvaise, là. Il va falloir vous ressaisir et vite. » \n2-  « Quoi ?  Mais  vous  l’avez  fait  exprès !  Et  vous  vous  prenez  pour  une  professionnelle ? \nMême un étudiant n’aurait pas commis une erreur pareille ! Quelle gourde ! ma pauvre \nfille ! »  \n\nSituation 5 : « Charles a tendance à vouloir tout régenter. Ce haut dirigeant a toujours prétendu \nsavoir ce qui est bon pour tout le monde. Au sein de l’entreprise automobile où il exerce la fonction \nde directeur technique, ses collaborateurs le craignent car il voit tout de suite ce qui ne va pas, et \nl’exprime  de  façon  fort  critique.  Comme  ce  sont  des  adultes,  certains  supportent  mal  cet \nautoritarisme. Ils ont l’impression d’être traités comme des idiots, certains se disputent avec lui, \nparfois  même  quittent  les  réunions  sur  un  coup  de  colère.  D’autres  l’admirent  et  boivent  ses \nparoles – ce qu’il apprécie. Mais quand ces derniers se trouvent seuls face à un problème, ils sont \nassez perdus : comment décider de la marche à suivre, sans leur maître pour les guider. »  \n\nSituation 6 : Richard a une forte tendance à prendre en charge les autres. Dans son entreprise, il \nse sent personnellement responsable de chacun de ses gars. Parlant de lui en tant que manager, il \naime dire : « Tous savent qu'ils peuvent compter sur moi, à tout moment, ils peuvent faire appel \nà moi s'ils le désirent. » Il a une grande proximité physique, de langage, d'idées avec les hommes \nqu'il côtoie. Le matin il est souvent là avant tout le monde et prend soin de saluer chacun. Dans le \ngroupe,  il  s'est  d'emblée  fait  remarquer  par  sa  façon  de  voler  au  secours  de  chacun.  Ses \ncollaborateurs s'en remettent à lui pour toutes les décisions importantes et pour « recoller les pots \ncassés  »  quand  il  y  a  un  problème.  Visiblement,  il  s'était  rendu  totalement  indispensable  au \npersonnel de son entreprise qui, en son absence, avait besoin de continuer à se référer à lui.  \n\nPsychosociologie de la communication. Prof. Asmae El Arfaoui. S3. Cycle ingénieur. 2022-23.  \n\n[Tapez ici] \n\n \n \n \n \n\f"
}