{
    "content": "COMPARAISON DES ETATS DU MOI \n\nCOMPORTEMENT GENERAL : prescripteur, directif, protecteur, emprunté aux parents et à la \nculture. \n\nATTITUDES PHYSIQUES : bras croisés et menton rentré, tête en arrière, dos droit et rigide, \nsourcils froncés, doigt tendu, regards par-dessus les lunettes, attitude de jugement ou \nd'évaluation, la tête appuyée sur la main avec un doigt sur la bouche et un doigt levé le long de la \njoue. Il peut être froid, méprisant, dominateur. \n\nVOIX : assurée, autoritaire, péremptoire, critique, indignée, tranchante, dégoûtée, intimidante, \nemphatique, en colère, énergique. \n\nEXPRESSIONS VERBALES : les proverbes, phrases sentencieuses, slogans, maximes et \ncitations moralisantes \n\nMOTS : c'est bien, c'est mal, discipline, moral, immoral, valeurs, idiot, bon, pertinent, ridicule, \nsain, normal-anormal, défauts-qualités, soigné, responsable-irresponsable, juste-injuste, vrai-\nfaux, tu dois, tu devrais, il faut, il faudrait, important, toujours, jamais, vraiment. \n\nCONTENU : jugements de valeur, normes, morale, règles de conduite, principes, définitions, \néthique, limites. \n\nATTITUDES PAR RAPPORT A DES FAITS ET DES PERSONNES :   approbation, réaffirme ce \nqui doit ou devrait être, la façon dont il faut ou faudrait réagir. \n\nMONOLOGUES INTERIEURS \n\nEn positif : j'aime que les choses soient en ordre, que les gens se comportent comme il convient. \nEn négatif : on me considère comme un persécuteur. On me dit que je suis autoritaire. Exigeant \navec moi-même et avec les autres. \n\nAVANTAGES : transmet ce qui structure le corps social et donc favorise l'intégration de \nl'individu, voire dans certains cas sa survie. Ses « réponses » sont sécurisantes. Il protège \ndu danger en posant des limites. \n\nINCONVENIENTS : peut, s'il est trop rigide, inhiber l'expression individuelle, nier la sensibilité, \ncensurer la créativité. Fondamentalement conservateur, il peut être inadapté à son \nenvironnement actuel. Persécuteur possible. \n\nPARENT NOURRICIER \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 1 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\fCOMPORTEMENT GENERAL : aidant, réconfortant, emprunté aux parents, aux figures \nparentales et à la culture. \n\nATTITUDES PHYSIQUES : gestes d'accueil et d'ouverture, donne des tapes sur l'épaule, bras \nouverts, souriant, donne des signes d'encouragement, regarde quelqu'un travailler en se tenant \nderrière lui, penché en avant, attitude enveloppante. \n\nVOIX : apaisante, chaleureuse, soucieuse de l'autre, réconfortante. \n\nEXPRESSIONS VERBALES : n'hésite pas à me demander si tu as besoin de quelque chose, \nsois sûr que, ne t'en fais pas, je m'en occupe, où est-ce que ça fait mal, c'est bon pour toi, sois \nprudent, ce n'est pas grave, je vais le faire à ta place, voici comment faire, \n\nMOTS : sécurité, danger, protection, conseil, aide, comme ceci, exemple, magnifique, très bien, \nconfiance, aider, accueil, soutien. \n\nCONTENU : recettes ou façons de faire, habitudes, traditions. \n\nATTITUDES PAR RAPPORT A DES FAITS OU PERSONNES : y voit des signes \nd'encouragement ou de découragement, de chances ou de dangers, des joies ou des \nsouffrances potentielles. \n\nMONOLOGUES INTERIEURS \n\nEn positif : j'aime m'occuper des autres, je sais que je fais bien, avoir le sentiment d'être utile. \nEn négatif : les gens me traitent comme si j'étais un sauveteur professionnel ; je les prends en \ncharge. Ils me pompent toute mon énergie et j'ai l'impression que finalement je leur fais plus de \nmal que de bien. Après tout ce que j'ai fait pour eux ! Mais je ne peux pas les abandonner, \nfinalement ils sont plus à plaindre que moi. \nAVANTAGES : protège et crée les conditions nécessaires à l'épanouissement de l'enfant, à sa \nsécurité, ce qui est une des conditions importantes de l'apparition d'un véritable adulte. \nINCONVENIENTS : il peut empêcher le développement de l'autre. Trop de protection finit par \nétouffer. \n\nENFANT SPONTANE \n\nCOMPORTEMENT GENERAL : libre, spontané. Tient peu compte des contraintes de \nl'environnement social. \n\nATTITUDES PHYSIQUES : aimant s'amuser, bouger, explorer, créer, langage corporel varié, \npeu de pudeur physique, saute, applaudit, se trémousse, regard direct, très expressif, vit toutes \nses sensations, bâille, s'étire, court, chante. \n\nVOIX : haute, libre, énergique, spontanée, fluctuante, sans inhibition. \n\nEXPRESSIONS VERBALES : langage simple, onomatopées, imitations, répétitions, parle pour \nlui-même, exclamations, interjections, je veux, je ne veux pas. \n\nMOTS : chic, berk, ouais, merde, zut, hé, ah, c'est bon, pas bon, aïe, oh la la, bof, chouette ! \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 2 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\fCONTENU : besoins physiologiques et biologiques de base, sensations (plaisir et souffrance) et \némotions : joie, peur, colère, tristesse. \n\nATTITUDES PAR RAPPORT AUX FAITS OU AUX PERSONNES : voit des sources de plaisir \nou de souffrance, ce qui déclenche des émotions. \n\nMONOLOGUES : positifs ou négatifs suivant que l'émotion est en relation avec la situation ou \nl'environnement. \n\nAVANTAGES : source de toute énergie et de tout plaisir, l'Enfant Spontané est la base \nbiologique sur laquelle s'édifie la personnalité. \n\nINCONVENIENTS : l'Enfant Spontané peut être un enfant « sauvage » ; \n\nENFANT ADAPTE SOUMIS \n\nCOMPORTEMENT GENERAL : réagit en soumission aux figures parentales et institutions. \n\nATTITUDES PHYSIQUES : soumise, tenant compte des autres en les mettant à \nl'aise, respectueux des usages et des normes, réservé. \n\nVOIX : respectueuse, raisonnable, plaintive, hésitante.  \n\nEXPRESSIONS VERBALES : j'aimerais bien, vous avez raison, j'essaie, s'il vous plaît, pourriez-\nvous…  Phrases anonymes en « il » et « on ». \n\nMOTS : coupable, honte, timide, essayer. \n\nMONOLOGUES : ce n'est pas correct, il ne faut pas exagérer, ça ne sert à rien de se faire \nremarquer, moi je sais coopérer, finalement l'essentiel c'est qu'on s'entende, mon avis \nn'apportera pas grand-chose. \n\nAVANTAGES : intègre les automatismes sociaux utiles pour la vie en société. \n\nINCONVENIENTS : l'excès de soumission mène à l'indécision, au trouble. \n\nENFANT ADAPTE REBELLE \n\nCOMPORTEMENT GENERAL : réagit en opposition aux figures parentales et institutions. \n\nATTITUDES PHYSIQUES : rebelle, tenant compte des autres en se révoltant (il peut aller jusqu'à \nla violence), coupe la parole, il élève la voix, sourire malicieux, éventuellement grossier, il répond \ndu tac au tac. \n\nVOIX : violente, énergique, forte, contenue, rageuse. \n\nEXPRESSIONS VERBALES : vous n'avez pas le droit, vous pouvez toujours courir, j'aimerais \nbien voir ça, je ne veux pas. \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 3 \n\n \n \n \n \n \n \n \n                                       \n \n \n \n \n \n \n \n\fMOTS : fier, oser, droit. \n\nMONOLOGUES : c'est toujours pareil, je vais me défendre, il ne faut pas se laisser faire, ils n'ont \npas le droit, je vais leur montrer que je sais me défendre, les autres se laissent faire. \n\nAVANTAGES : protège l'Enfant Libre face aux excès de pouvoir.  \n\nINCONVENIENTS : l'excès de rébellion mène à l'agitation ou à la violence \n\nL'ENFANT CREATEUR \n\nCOMPORTEMENT GENERAL :  lunatique. Enfant absorbé dans ses rêves et ses créations. \n\nATTITUDES PHYSIQUES : agité, actif, bruyant, détruit pour comprendre, complètement absorbé \ndans ce qu'il fait. \n\nVOIX :  monte et descend, mal articulée, curieuse, investigatrice sonore, manipulatrice. \n\nEXPRESSIONS VERBALES : et si ? Pourquoi ? Pose de « grandes » questions sur des \névidences ou des sujets tabous, j'ai une idée, expressions argotiques nouvelles, ah oui, je vois... \n(intuitivement), jeux de mots. \n\nMOTS : intuition, arranger, supposition, peut-être, hum ! hum ! \n\nCONTENU : intuitions, idées magiques, comment manipuler les gens. \n\nATTITUDES PAR RAPPORT AUX FAITS OU AUX PERSONNES : intérêt ou ennui, amusement \nou indifférence. \n\nMONOLOGUES \n\nPositifs : Ce qui me plaît, c'est d'aborder une nouvelle personne, un nouveau travail, un nouveau \nproblème et de deviner ce qu'il y a derrière. Généralement, la première impression, c'est la \nbonne. \n\nNégatifs : je sens des choses confuses, des forces occultes autour de moi. Des gens qui essaient \nde me faire faire ce dont je n'ai pas envie. Je crois qu'un jour quelqu'un viendra qui saura m'aimer \net m'apprécier, et j'essaie d'y penser beaucoup pour le faire arriver plus tôt. \n\nAVANTAGES : peut constituer pour l'Adulte particulièrement dans le domaine des relations \nhumaines, un guide précieux. Comprend bien l'Enfant, et stimule l'activité créatrice et artistique. \n\nINCONVENIENTS : le brillant du Petit Inventeur n'est souvent que de surface et aide à entretenir \ndes idées magiques, des superstitions, des rêves secrets qui tant qu'ils n'ont pas été mis au \ngrand jour par l'Adulte, biaisent toute l'activité de la personne. \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 4 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fL'ADULTE \n\nCOMPORTEMENT GENERAL : neutre, écoute, reformule, cherche les informations objectives, \nprend de la distance pour mieux comprendre la réalité, les situations. \n\nATTITUDES PHYSIQUES : posture droite et détendue, ouverte et neutre, attentive, fréquents \ncontacts oculaires avec l'interlocuteur, regard direct et neutre. \n\nVOIX : égale, détendue, neutre, affirmation, négation, claire, confiante, calme. \n\nEXPRESSIONS VERBALES : je vois ce que vous voulez dire, si je vous comprends  \n\nbien, hypothèses, en résumé ;  phrases claires et concises, techniques, informatives, logiques, \nont un contenu précis. \n\nMOTS : quoi, quand, où, pourquoi, qui, comment, combien, oui, non, alternative, possibilité, \nprobablement, relativement, je pense, faits, résultats, objectifs, moyens, méthode, exacte, \ninexacte, hypothèses. \n\nCONTENU : faits, idées, probabilités. Informations sur la personne elle-même et sur son \nenvironnement. \n\nORIGINE : logique et culturelle. \n\nMONOLOGUES \n\nPositifs : j'ai confiance en moi. Quand je prends un problème en main, si je décide de le \nrésoudre, alors je prends le temps et les moyens voulus et j'y arrive. \n\nNégatifs : l'adulte exclusif, sans contact avec l'Enfant ou le Parent, nie la richesse humaine de la \npersonnalité. Il devient alors froid, distant, sans morale, et sans spontanéité. \n\nAVANTAGES : le véritable agent de transformation, il a la capacité de gérer et d'intégrer le \npotentiel des autres états du Moi. \n\nINCONVENIENTS : s'il n'intègre pas les besoins du parent et l'Enfant, \nil   peut   sembler froid, sans   valeurs   et   sans   sentiments   profonds . Son développement est \nlent et il lui faut longtemps pour être réellement capable de prendre la direction de la personne. Il \ndépend de l'énergie de l'Enfant et du Parent, et doit donc être en accord avec eux pour bien \nfonctionner. \n\nLES ETATS DU MOI ET LA RESOLUTION DE PROBLEMES \n\nParent Normatif \n\nIl est gardien de la «loi», des valeurs et veille au respect des limites et des normes. Il dirige le \nchoix de solutions vers celles qui sont en accord avec ses valeurs. Cette attitude peut être \ninadaptée à la situation actuelle, ce qui est nuisible si elles sont imposées.  \nEx : - Nous avons toujours fait comme cela et avec succès. Il n'y a pas de raison d'en changer. \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 5 \n\n \n \n \n \n \n \n \n \n \n \n \n \n\fParent Nourricier \n\nIl valorise la personne et lui donne le droit à l'erreur. Il l'encourage à bien faire. Cependant trop \nrassurant, le Parent Nourricier peut encourager la faiblesse, excuser l'inefficacité. Bref, il peut \nencourager et décourager. \nEx : - Ne vous inquiétez pas pour cette erreur, de toute façon, l'expérience vous sera profitable. \n\nEnfant Spontané \n\nIl ignore l'existence des problèmes, il n'en a pas. Il dit clairement ce qu'il veut et ce qu'il ne veut \npas. Quand le plaisir ou la souffrance sont trop intenses, il les exprime fortement.  Les sensations \nsont extrêmement fines et riches d'informations pour l'Enfant Créateur et pour l'Adulte.             \n\n Ex : - Chouette \n\nEnfant adapté \n\nIl répond aux problèmes en épousant des modèles préétablis dont l'efficacité compte moins que \nle rapport qu'ils ont avec l'autorité (soumission ou rébellion). En cas de situation inhabituelle, il \nsera peut-être inhibé par la crainte et l'hésitation.         \n\nEx : - De toute façon, que voulez-vous faire ? ça ne changera jamais. \n\nEnfant créateur \n\nL'Enfant Créateur occupe une place importante dans la résolution de problèmes. La qualité de \nses observations en matière de relations humaines (faites dans le foyer familial) lui permet \nsouvent « d'inventer ». Mais son raisonnement est peu élaboré, il s'en tient donc à des solutions \nsimples, quelquefois géniales mais souvent simplistes ou irréalistes.      Ex : - Il y a quelque \nchose qui se mijote, j'en suis sûre. Regarde cette activité.  Je sens que je suis une bonne piste, \nj'en suis certain. \n\nAdulte \n\nLa résolution de problèmes est la fonction permanente de l'Adulte. Il émet des hypothèses, \névalue des solutions sans jugements de valeur et sans émotions. Son fonctionnement dépend de \nla qualité des informations et des programmes dont il dispose.  L'Adulte est souvent contraint par \nl'urgence de faire appel aux solutions toutes faites que lui proposent les autres états du moi. \n\nPsychosociologie de la communication. Cycle ingénieur S3. Prof. A.El Arfaoui 2022-23 p. 6 \n\n \n \n\f"
}