{
    "content": "UMI    E.N.S.A.M – Meknès \n\n Année universitaire 2021/22 \n\nExamen d’Ecoconception Session Ordinaire \nÉnoncé  \n\nDurée : 1h 30 \n\nLa feuille des réponses est séparée de la feuille de l’énoncé. \n\n1. Etude de cas : profil environnemental normalisé d'une Machine à café \n\nDans cette étude de cas on veut identifier le profil environnemental normalisé d'une Machine à café \nen plastique avec une résistance chauffante, fabriqué par une entreprise Belge. Lors de la 1ére étape \nl’Unité fonctionnelle a été définie comme étant : la Production de 5 tasses de café, deux fois par \njour pendant 5 ans et Le café doit rester chaud au moins 30 minutes. Pour définir les Frontières du \nsystème, nous avons déterminé les processus élémentaires qui doivent être inclus et les quantité de \nproduit nécessaire pour remplir la fonction,  pour l’Unité  Fonctionnelle définie.  Cette Frontière \ncomprend : l’Assemblage de la machine à café, la Production de l’emballage, la Production des \nfiltres en papier, la Production des grains de café, la Production de café (utilisation) et la Fin de vie \nde la machine à café.  \n\nEnsuite,  il  fallait  établir  l’inventaire  des  émissions  et  des  consommations  pour  chaque  flux  du \nprocessus : Assemblage de la machine à café, son emballage, production du café … Lors de l’étape \nd’évaluation, il fallait estimer des impacts environnementaux à partir des données de l’inventaire. \nAprès la classification et la caractérisation l'ensemble du cycle de vie de la machine à café se traduit \npar les émissions suivantes :  \n\n  Réchauffement climatique : 6,1 kg d'équivalent CO2  \n  Acidification : 56,2 g d'équivalent SO2  \n  Eutrophisation : 2,88 g d'équivalent PO4  \n  Ozone troposphérique : 7,57 g d'équivalent éthylène. \n\nidentifier \n\nil  a  été  dit  nous  voulons \n\nComme \nle  profil \nenvironnemental  normalisé  de  la  machine  a  café.  Un  profil \nenvironnemental  normalisé  permet  de  comparer  les  scores \nindividuels  pour différentes catégories d'impact.  Pour obtenir un \nprofil environnemental normalisé de cette machine à café, tous les \nchiffres  calculées  précédemment  sont  divisés  par  la  quantité \nd'émissions de substances adéquates en Belgique sur une période \nd'un an rassemblées dans le tableau qui suit : \n\nRéchauffement climatique \nAcidification  \nEutrophisation \nOzone troposphérique \n\n1.85*1014g CO2/an \n7.09*1011g SO2/an \n1.17*1011g PO4/an \n1.84*1011g ethylene/an \n\nAprès normalisation on obtient un résultat composé de quatre indicateurs nombres un pour chaque \ncatégorie d'impact. Ces indicateurs ont une unité commune, l’année. \n\n1 \n\n \n \n \n \n \n \n \n \n \n \n\fUMI    E.N.S.A.M – Meknès \n\n Année universitaire 2021/22 \n\n3 : Etude de cas : Comparaison des solutions Emballage plastique et carton  \n\nMISE EN CONTEXTE :  Vous êtes en charge de mener une étude comparative sur l’utilisation \nde  différents  emballages  pour  le  compte  d’une  entreprise  qui  vaudrait  remplacer  l’emballage \noriginal en plastique par un emballage utilisant le carton, misant sur les caractères renouvelable, \nrecyclable, voire biodégradable de ce matériau.  \nVotre mission consiste à utiliser l’approche cycle de vie pour mesurer le gain environnemental.  \n\nPhase 1 Extraction de matières premières et fabrication : \n\nS1 : Solution d’emballage en plastique :  une enveloppe individuelle en polypropylène \n(PP), insérée dans un plateau en polystyrène (PS) (20 enveloppes par plateau), placée dans \nune boîte en polyéthylène-téréphtalate (PET). \n\n  Les quantités de matières premières par boite sont comme suit : PP extrudé 0,06Kg, \n\nen PS injecté 0,04Kg, en PET 0,036Kg.  \n\n  Transport « matières premières » par camion, pour 10 000 boites : 4200 Km \n\nS2 :  Solution  d’emballage  utilisant  le  carton :  une  enveloppe  individuelle  en \npolypropylène (PP), insérée dans une boîte en carton blanchi (20 enveloppes par boîte), \nune bande de carton ondulé est utilisée comme renfort et un film de polypropylène (PP) \nrecouvrant le tout.  \n\n  Les quantités de matières premières par boite sont comme suit : enveloppe en PP \nextrudé 0,054Kg, carton blanchi 0,05Kg, Bande en carton ondulé plié 0,01Kg, Film \nen PP 0,085Kg. \n\n  Transport « matières premières » par camion, pour 10 000 boites : 5650Km. \n\nPhase 2 :de distribution et de fin de vie  \n\n  Distribution en Train de marchandises produit fini équivalent 10 000 boites : 250 Km. \n  Fin  de  vie :  PET  (100%  incinération),  PS  et  PP  (100%  incinération),  Carton  (100% \n\nrecyclage), Film LDPE (100% incinération). \n\nNous supposons que :  \n\n-  Une tonne de matière plastique émet durant tout son cycle de vie une moyenne de : 2728 Kg \n\néquivalent CO2. \n\n-  Une tonne de carton émet durant tout son cycle de vie :  538 kg équivalent CO2.  \n-  Le taux moyen d'émissions de CO2 d'un poids lourd « camion » est de : 7Kg équivalent \n\nCO2 par Kilomètre. \n\n-  Le  taux  moyen  d'émissions  de CO2 d'un  train  Autorail  X  73  500  est  de  :  19,24  Kg \n\néquivalent CO2 par Kilomètre. \n\n-  La fin de vie du plastique génère pour chaque tonne une quantité moyenne de pollution \n\nd’aire équivalent CO2 de 2939 Kg équivalent CO2 pour une combustion à 100%.  \n\n2 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\f"
}