{
    "content": "Université Moulay Ismail                                                            Année universitaire 2020/2021 \nE.N.S.A.M - Meknès. \n\nExamen d’Ecoconception Session Ordinaire \nDurée : 1h 15 \n\nNB :  pour  la  partie  QCM  répondez  sur  la  feuille  des  questions  et  n’oubliez  pas  de  mettre  votre  nom  et \nprénom. Les Téléphones portables sont strictement interdits. \n\nNom :   \n\nPrénom : \n\nQuestions à choix multiples QCM : (10 pts) \nPlusieurs mentions peuvent être vraies. Entourer la ou les mentions varies.  \n\n1 Un aspect environnemental  \n\na)  Se rapporte à un élément afférent aux produits, activités et services de l’entreprise  \nb)  Est par exemple l’emballage d’un produit.  \nc)  Est la modifications qu’un impact environnemental peut causer à l’environnement  \nd)  A forcément un impact négatif sur l’environnement \n\n2 Les déchets Recyclables sont ;  \n\na)  Sont des déchets Biodégradables \nb)  Doivent être triées pour être recyclé \nc)  Sont toujours recyclées \nd)  Peuvent servir à fabriquer un nouveau produit. \n\n3 L'empreinte écologique est  \n\na)  Un indicateur qui comptabilise la pression exercée par l’environnement sur l’homme.  \nb)  Mesure  la  surface  de  terres  nécessaires  pour  produire  les  ressources  qu'un  individu, \n\nconsomme et pour absorber les déchets qu’il génère. \n\nc)  Un indicateur qu’il faut réduire en adoptant des pratiques écologiques \nd)  Un indicateur qu’il faut augmenter en faisant appel aux énergies renouvelables \n\n4 La nomenclature des installations classées pour la protection de l’environnement \n\na)  Se base sur une classification des risques des installations  suivant leurs conséquences  sur \n\nl’environnement \n\nb)  A été introduit au Maroc par la Loi n°11-03 relative à la protection de l’environnement \nc)  A  été  introduit  au  Maroc  par  la  Loi  n°  12-03  relative  aux  Etudes  d’Impacts \n\nd) \n\nEnvironnementaux \nImpose aux entreprises Non Classées d’installer des équipements de mesure de la pollution \net de transmettre périodiquement les relevés effectués aux autorités publiques.  \n\n5 Une approche produit pour la Protection de l’environnement \n\na)  Comprend les démarches d'écoconception et d'éco labellisation.  \nb)  N’est pas complémentaire à l’approche site pour la Protection de l’environnement. \nc)  Prend en compte l'ensemble du cycle de vie du produit \nd)  Se concentre sur les problèmes liés à l’étape de production \n\n6 Le concept « penser cycle de vie » de la démarche d’écoconception  \n\na)  Consiste à mettre en œuvre un outil d’évaluation qui va permettre à l’entreprise de connaître \n\nson produit et de l’améliorer. \n\nb)  Consiste à englober toutes les étapes du cycle de vie du produit.  \nc)  Consiste à adopter une approche multicritère pour ne pas avoir un transfert d’impacts. \nd)  Consiste à intégrer l’écoconception tout au long du processus de conception  \n\n1 / 3 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fUniversité Moulay Ismail                                                            Année universitaire 2020/2021 \nE.N.S.A.M - Meknès. \n\n7 Le concept « mise en œuvre des outils d’évaluation » de la démarche d’écoconception \n\na)  Consiste à mettre en œuvre un outil d’évaluation qui va permettre à l’entreprise de connaître \n\nson produit et de l’améliorer. \n\nb)  Consiste à intégrer l’écoconception tout au long du processus de conception  \nc) \n\nImpose de faire appel à un outil d’évaluation quantitatif comme l’analyse de cycle de vie \n(ACV) \n\nd)  Tolère l’utilisation d’un outil qualitatif d’évaluation comme la roue de l’écoconception. \n\n8 L’Evaluation du produit à l’aide d’une méthode d’analyse Environnementale ; ACV, Roue \nd’écoconception …  \n\na)  Ne peut être effectuée que lors de la conception détaillée,  \nb)  Peut être effectuée lors de la conception préliminaire, \nc)  Peut conduire à une re conception du produit, s’il s’avère que les impacts environnementaux \n\ndépassent le niveau acceptable.  \n\nd)  Peut être effectuée même si les spécifications ; des matériaux, des composants, des moyens \n\nde production, des modes de transport ne sont pas détaillées. \n\n9 Les Directives d’écoconception sont  \n\na)  Des \n\nrecommandations  qui  permettant  au  concepteurs  de \n\nréduire \n\nles \n\nimpacts \n\nenvironnementaux d'un produit.  \n\nb)  Sélectionnées au cours de la phase de conception détaillée.  \nc)  Appliquées tout au long du projet de développement produit.  \nd)  Appliquées lorsque l’analyse d'impact environnemental a été détaillée  \n\n10 Pour réduire les Impacts Environnementaux d’un produit en phase d’utilisation  \n\na) \nb) \nc) \nd) \n\nIl faut augmenter sa durée de vie technique et esthétique \nIl faut diminuer sa durée de vie esthétique \nIl faut faciliter sa maintenance  \nIl suffit d’augmenter sa durée de vie technique  \n\nQuestions de réflexion :  \n\n1  Citer  un  exemple,  que  vous  connaissez,  de  produit  Eco  conçue  par  une  entreprise. \nDécrire de manière succincte ce produit, ces caractéristiques, le démarche suivie pour l’Eco \nconcevoir, les impacts environnementaux qui ont été réduits, a quelle étape de cycle de vie… ?  \n\nRépondre entre 6 et 10 lignes. (4pts) \n\n2 Pour faire de l’écoconception il faut adopter le concept penser cycle de vie. Décrire \nce concept et citer des exemples de mesures qu’on peut prévoir, à chaque étape du cycle de vie \ndu produit, pour avoir un produit écologique.  Répondre entre 6 et 10 lignes. (3pts) \n\n3 Etude de Cas : Produit : Bloc avant de voiture – Entreprise : Faurecia  \n\nLorsqu’on  conçoit  un  produit,  il  faut  chercher  à  économiser,  le  plus  possible,  la  matière \npremière, or l'étude de la constitution d'un produit peut révéler un manque d'optimisation des quantités \nde matière vis-à-vis des fonctions auxquelles le produit doit répondre. Cet excédent peut être réduit selon \ndifférents moyens :  \n\n•  par  l'intégration  de  fonctions,  c'est-à-dire  l'utilisation  d'un  même  support  pour  regrouper \ndifférentes fonctions au sein d'un même produit. En plus d'une économie de matière, le regroupement \n\n2 / 3 \n\n \n \n \n \n \n \n\fUniversité Moulay Ismail                                                            Année universitaire 2020/2021 \nE.N.S.A.M - Meknès. \n\nde fonctions dans un élément donné simplifie la composition du produit et peut faciliter les processus \nde production, le montage et le démontage du produit.  \n\n• par l'optimisation des formes et des volumes qui peuvent permettre, à résistance mécanique égale, \nde réduire la quantité de matériaux nécessaires et la consommation de ressources lors de la production.  \n\n• par l'optimisation de la forme et de la contenance des emballages. Plus le rapport entre le volume \nglobal occupé par l’emballage et le volume de son contenu est faible, plus la forme de l’emballage est \noptimisée.  \n\nFigure 1 : Bloc avant de voiture de l’équipementier FAURECIA \n\nLa  réduction  de  la  quantité  de  matériau  utilisé  influe  directement  sur  l’environnement.  Les \nressources primaires extraites sont diminuées, ainsi que le volume des déchets récupérés en fin de vie \ndu  produit.  Les  gains  se  répercutent  également  tout  au  long  de  la  phase  de  conception  du  produit  : \nréduction des coûts d’achat, de la consommation de ressources, de la production ainsi que du transport. \nLe bloc avant de voiture Faurecia a été conçu en se posant les questions suivantes :  \n\n• L’optimisation de la quantité de matériau utilisé a-t-elle été prise en compte lors de la conception \n\ndu produit ?  \n\n• La résistance mécanique des matériaux a-t-elle été étudiée ? Quels sont les procédés permettant \n\nun gain de matière en tirant profit de la résistance mécanique des matériaux ?  \n\n• Quelles fonctions doit remplir la pièce, le produit ? Quels sont les différents supports de fonctions \n\nnécessaires ? Quelles fonctions peut-on regrouper au sein d’une seule pièce ?  \n\n• La forme de l’emballage est-elle optimisée par rapport au volume de son contenant ?  \n\nCela  conduit  à  raisonner  non  plus  par  pièce  mais  par  module,  l'équipementier  FAURECIA \ngénère  des  bénéfices  en  termes  d'assemblage,  de  stockage  et  d'investissement.  Une  seule  armature \nappelée « face avant » est utilisée pour le support de différentes pièces : pare-chocs, moto-ventilateur, \néclairage, etc. Grâce à ce regroupement de fonctions,  le processus  de production est  simplifié  :  il se \ndéroule  en  une  seule  étape  et  permet  l’obtention  de  pièces  finies  directement  à  partir  de  la  phase \nd’injection. \n\nQuestion :  A  partir  de  cette  étude  de  cas,  décrire  quels  sont  les  impacts  environnementaux \nréduites grâce  a cette écoconception ? A  quelle étape  de cycle  de vie  du  produit  ces  impacts  ont  été \nréduits ? est-ce que cette démarche peut être adopté par d’autres entreprises pour écoconcevoir d’autres \nproduits ? et comment ? Répondre entre 6 et 10 lignes. (3pts) \n\n3 / 3 \n\n \n\f"
}