{
    "content": "Introduction à l’analyse transactionnelle \n\n3- Les positions de vie \n\n         Psychosociologie de la communication \n\n           Prof. Asmae El Arfaoui \n\nCharlotte rentre de son travail contente : Elle a réussi une présentation difficile. Elle est \n\nfière de sa prestation. Elle se tourne vers pierre, lui raconte son succès, et attend qu’il la \n\nfélicite.  Mais  Pierre  semble  indifférent  à  sa  joie.  Charlotte  se  sent  incomprise, \n\nabandonnée et en colère. Pierre est retourné à son ordinateur, beaucoup plus simple à \n\ncomprendre que les femmes. Il se sent coupable, mais ne sait pas trop de quoi. Il se dit \n\nqu’avec  Charlotte,  il  n’est  guère  à  la  hauteur :  non  seulement  elle  est  beaucoup  plus \n\nbrillante et intelligente que lui, mais il ne sait pas la comprendre \n\nCharlotte a une vision assez positive d’elle-même alors que Pierre a une vue dévalorisée \n\nde lui-même, chacun a une vision de lui-même qui peut être positive ou négative. C’est \n\nce que l’AT appelle « la position de vie » \n\n \n \n \n \n \n \n \n \n \n \n \n\fCharlotte a demandé à un de ses collaborateurs un rapport sur un produit concurrent. \n\nCelui-ci  a  remis  son  travail,  mais  Charlotte  ne  le  retrouve  plus.  Zoé,  son  assistante,  a \n\ncherché  partout  et  ne  l’a  pas  trouvé  non  plus.  Charlotte  se  sent  vaguement  fautive, \n\npourtant  elle  pense  que  c’est  Zoé  qui  l’a  mal  rangé.  Elle  devient  agressive  envers  son \n\nassistante  et  s’énerve.  Mais,  deux  jours  plus  tard,  en  fouillant  un  de  ses  tiroirs,  elle \n\nretrouve son dossier. Un peu confuse, Charlotte le montre à Zoé, s’excuse du bout des \n\nlèvres,  et  finit  par  lui  dire  que  cela  ne  serait  pas  arrivé  si  cette  dernière  était  mieux \n\norganisée.  Pour  Charlotte,  il  est  vraiment  difficile  de  reconnaître  ses  erreurs,  elle  a \n\nl’impression d’être faible, exposée et vulnérable » \n\nCharlotte a du mal à occuper la position basse, elle a du mal à s’excuser même si elle a \n\ntort, elle a besoin de rester en position haute c’est d’ailleurs sa tendance que ce soit avec \n\nson équipe de travail ou avec Pierre  \n\nLa position de vie ? \n\n = la valeur que je me donne à moi-même et aux autres, \n\n =Idée positive ou négative que j’ai de moi, des autres et du monde.  \n\n Elle est intimement liée à :  \n\nNos  croyances,  notre  culture  (familiale,  sociale,  spirituelle…) ;  à  nos  expériences  et  nos \ninteractions passées. \n\nElle influence la manière dont un individu pense, agit et entre en relation avec les autres.  \n\nNous pouvons distinguer 4 positions de vie (ou 4 façons de voir les relations entre soi-même \n\net autrui).  \n\n1. Je suis OK, vous êtes OK (+ +) je vais de l’avant  \n\n2. Je ne suis pas OK, vous êtes OK (- +) je m’en vais (Fuite) \n\n3. Je suis OK, vous n’êtes pas OK (+ -) Vas-t-’en (se débarrasser de l’autre) \n\n4. Je ne suis pas OK, vous n’êtes pas OK (- -) Je ne sais où aller (être dans l’impasse) \n\nL’Analyse transactionnelle utilise les termes « être OK » ou « ne pas être OK » pour indiquer \n\nla position + et - \n\n \n \n \n \n \n \n\fLes différentes positions de vie \n\nPierre se sent peu important, il a l’impression que les  autres se débrouillent mieux que \n\nlui. Quand il est en butte aux colères de Charlotte ou à l’indifférence de ses collègues, il \n\nest très mal à l’aise même s’il ne le montre pas, il rentre dans son coin et ne parle pas \n\nbeaucoup. Cependant, grâce à ses réussites professionnelles, à sa capacité de débloquer \n\ndes situations difficiles et à l’amour de Charlotte, il prend conscience de son bonheur, il \n\nlui  arrive  même,  depuis  quelques  temps,  de  se  rebeller  lorsqu’il  s’estime  dans  son  bon \n\ndroit, surtout dans sa vie professionnelle  \n\nPierre se sent peu important, il a l’impression que les autres se débrouillent mieux que \n\nlui. (Tendance à être dans la position (- +) je ne vaux pas grand-chose par rapport aux \n\nautres  qui  sont  mieux  que  moi).  Quand  il  est  en  butte  aux  colères  de  Charlotte  ou  à \n\nl’indifférence de ses collègues, il est très mal à l’aise même s’il ne le montre pas, (il est en \n\n \n \n \n \n\fposition  -  -  passivité,  renoncement,  je  ne  vaux  rien  les  autres  non  plus).  Cependant, \n\ngrâce à ses réussites professionnelles, à sa capacité de débloquer des situations difficiles \n\net  à  l’amour  de  Charlotte,  il  prend  conscience  de  son  bonheur,  (position  ++  je  suis \n\npositif, les autres aussi, je vais de l’avant) il lui arrive même, depuis quelques temps, de \n\nse rebeller (tenir la position + -) lorsqu’il s’estime dans son bon droit, surtout dans sa vie \n\nprofessionnelle  \n\nCharlotte dirige son équipe avec beaucoup d’exigence, elle est rarement satisfaite de ses \n\nsubordonnés qui souffrent parfois de ses critiques et de ses difficultés à accepter ce qui \n\nn’est  pas  parfait  à  ses  yeux.  Mais  des  fois,  il  lui  arrive  d’être  en  difficulté  avec  son \n\npatron  surtout  lorsqu’elle  n’arrive  pas  à  le  ramener  à  ses  arguments  ou  lorsqu’il  Lui \n\nreproche  durement  de  rater  ses  objectifs  certaines  réunions.  Quand  rien  n’a  réussi  au \n\nbureau et qu’elle rentre chez elle pour trouver Pierre absorbée par son ordinateur et son \n\nbébé  hurlant  sans  que  rien  ne  semble  le  calmer,  il  lui  arrive  de  se  décourager,  de \n\nmanquer  d’énergie,  de  se  sentir  vide  bien  qu’elle  soit  combattive  et  volontaire. \n\nHeureusement  quand  tout  va  mieux  dans  sa  famille,  quand  elle  a  le  sentiment  d’avoir \n\nbien  travailler,  et  que  ses  collaborateurs  ont  avancé  en  faisant  ce  qu’elle  leur  avait \n\ndemandé, elle se sent à nouveau confiante et positive.  \n\nChacun va passer régulièrement par les quatre positions en fonction de la représentation qu’il \n\nse fera d’une situation ou d’une autre et de la chaîne interactionnelle qui en découlera.  \n\nExemple de passage par les quatre cadres \n\n«  Je  suis  au  travail  et  mon  supérieur  vient  me  trouver  pour  me  demander  d’effectuer \nune  recherche  concernant  le  produit  que  nous  lançons  actuellement.  Il  m’explique  ce \nqu’il attend, je l’écoute et lui fais part de mon accord. Je me sens compétant pour faire \nce travail et trouve la demande légitime. \nJe  commence  alors  le  travail  lorsqu’un  collègue  s’approche  de  moi  et  commence  à  me \nparler de son Week- end. Il me vante les mérites de la voile et m’explique ce que cela lui \napporte de pratiquer ce sport. Je ne connais rien à la voile et de plus cela m’ennuie de \nl’écouter  car  j’ai  un  travail  à  faire.  Je  me  dis  que  je  ne  peux  supporter  davantage  la \nsituation et sous prétexte d’un dossier à aller chercher, je m’éclipse.  \nPlus tard dans la  journée, ma secrétaire entre l’air dépitée  et m’avoue avoir oublié de \nposter un courrier important que je lui avais remis deux jours plus tôt. Je me mets en \ncolère et lui dit que je vais le faire moi-même, ajoutant que je ne peux lui faire confiance.  \nLe  téléphone  sonne  alors  et  ma  femme  m’apprend  que  les  ouvriers  qui  réalisent  des \ntravaux à notre domicile doivent s’absenter pour un autre chantier et vont laisser notre \nappartement en l’état pendant deux semaines. Elle n’a pu obtenir qu’ils terminent notre \nchantier  avant  de  commencer  l’autre.  Je  raccroche  en  me  disant  que  je  ne  peux  en \nsupporter davantage. Je me sens vidé et déprimé.  \n\n \n \n\fOn voit bien dans cet exemple comme on peut passer rapidement d’une position à l’autre    \n\n Chacun pourra trouver des exemples personnels de changements rapides de position. \nPositions de vie et comportements \n\nLes positions de vie et les états du moi \n\nLa position de vie + - à position de domination. \n\nL'état  du  moi  dominant  est  donc  le  Parent  mais,  associé  ici  à  une  position  de  vie  où  on \ndévalorise l’autre tout en se survalorisant. Ils s'appelleront : \n\nLe PERSECUTEUR (Parent  Normatif  négatif) ;  la  personne  énonce  la  norme  non  pour  sa \nvaleur  propre,  mais  pour  assurer  son  contrôle  sur  les  autres.   Ces  sentiment  ou  émotions \npréférentielles seront le mépris ou de colère  \n\n \n \n \n \n \n \n \n\fLe SAUVETEUR (Parent  Nourricier) ;  la  personne  aide  les  autres  non  pour  les  aider  à \ndevenir autonomes mais au contraire pour les maintenir sous sa dépendance. Ces  sentiments \nou émotions préférentiels seront la pitié. \n\nLa position de vie - + à position de dominé. \n\nL'état du moi au contrôle ici est l'Enfant Adapté, qui peut être Soumis ou Rebelle.  \n\nOn  peut  qualifier  l'Enfant  Adapté  dans  une  position -  + de  VICTIME,  ayant  2  types  de \ncomportements, soumis ou rebelle.   \n\nLa VICTIME Soumise tendra à susciter chez l'autre le comportement de SAUVETEUR, \n\n La VICTIME Rebelle tendra à activer chez les autres un comportement de PERSECUTEUR  \n\nChaque personne a une position préférée qu'elle utilise notamment sous stress. \n\n L'objectif  consiste  à  être  conscient  de  la  manière  dont  cette  position  influence  ses \n\nrelations aux autres et surtout de se créer des alternatives.  \n\nEn effet, les deux positions précédentes sont notamment épuisantes et improductives : \n\nDominant  (+  -)  :  la  personne  va  lutter  constamment  pour  positionner  les  autres  dans  la \n\nposition inverse (- +) ; \n\nDominé (- +) : la personne cherche à se convaincre sans cesse de son impuissance. \n\nLa  position  à  viser  est  bien  entendu  la  position  + /+  qui  permet  un  équilibre  dans  les \n\nrelations et favorise les issues favorables dans les conflits \n\nLa  position  de  vie  (+  +)  ne  consiste  pas  à  être  gentil  mais  plutôt  à  affirmer  ses  besoins, \n\naccepter ceux des autres, et rechercher le meilleur compromis.  \n\nLe concept des positions de vie est très lié à l'image que nous avons de nous et à la valeur \n\npersonnelle que nous nous attribuons.  \n\n \n \n \n \n \n \n \n \n\fApprendre à adopter une position (+ +) nous permet de développer en même temps notre \n\nestime de soi. \n\nLes positions de vie sont fluctuantes : Elles évoluent en fonction de nos diverses situations \nInteractionnelles.   \n\nBien  que  nous  ayons  une  position  fondamentale  de  départ,  nous  changeons  de  position \n\nselon notre humeur et la quantité de stress que nous subissons.  \n\nDe  même  nous  pouvons  traverser  des  périodes  positives,  durant  lesquelles  nos  liens  sont \n\nsolides  et  enrichissants,  nous  obtenons  ce  que  nous  désirons,  et  nous  nous  sentons  ++, \n\nmais  il  suffit  de  quelques  orages  dans  notre  vie  affective  ou  professionnelle  pour  que  nous \n\nrevenions à notre position favorite.  \n\nIl est normal de passer par les quatre positions et donc inutile de vouloir à tout prix maintenir \nla position ++.  \n\nCependant,  la  prise  de  conscience  de  la  position  que  l’on  utilise  et  qu’utilisent  ses \ninterlocuteurs peut aider à mieux comprendre la chaîne interactionnelle en cours et à la      \nmodifer progressivement. \n\nOn  peut  ainsi  progressivement  apprendre  à  utiliser  davantage  le  cadre  ++  sans  pour  autant \ns’interdire d’aller dans les autres cadres. \n\nPosition sociale et position psychologique  \n\nNous avons tous une position privilégiée – même si nous nous apercevons que cette position \n\nn’est  pas  toujours  celle  que  nous  montrons,  et  qu’il  y’a  un  décalage  entre  ce  que  nous \n\nressentons  et  ce  que  nous  exprimons,  nous  pouvons  montrer  une  image  dominatrice  et \n\navoir l’air sûr de nous pour cacher une faiblesse ressentie. A l’inverse certaines personnes \n\npeuvent paraître faibles sans ressource et en position basse et se sentir intérieurement en \n\ncolère et méprisantes, ce genre d’émotions évite de rencontrer les vraies personnes \n\nIl arrive que ce que je montre à l'autre ne soit pas exactement le reflet de ce que je pense de \n\nlui  :  mon  patron,  pour  favoriser  \"l'émulation\",  me  fait  travailler  avec  un  collègue  que  je \n\nconsidère vraiment inférieure, je lui dis néanmoins : \"Bonjour, je suis ravi de travailler avec \n\ntoi  sur  ce  projet\"… C'est  ce  que  l'on  nomme la  position  de  vie  \"sociale\"  (celle  que  l'on  va \n\nmontrer, ici +/+). \n\n \n \n \n \n \n \n\f Je vais montrer aux autres une position de vie différente de celle que je ressens au même \nmoment parce que je pense qu’elle est adaptée aux circonstances. \n\nLa position de vie existentielle : Cette position de vie correspond à nos croyances profondes  \n\nsur nous-même et les autres. C’est la base de notre personnalité. C’est celle dans laquelle nous \n\n passons le plus de temps. \n\nhttps://www.youtube.com/watch?v=ew-_LmDFwsY&ab_channel=Noverraz-coaching \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fCharlotte dirige son équipe avec beaucoup d’exigence, elle est rarement satisfaite de ses \n\nsubordonnés qui souffrent parfois de ses critiques et de ses difficultés à accepter ce qui \n\nn’est  pas  parfait  à  ses  yeux.  Mais  des  fois,  il  lui  arrive  d’être  en  difficulté  avec  son \n\npatron  surtout  lorsqu’elle  n’arrive  pas  à  le  ramener  à  ses  arguments  ou  lorsqu’il  Lui \n\nreproche  durement  de  rater  ses  objectifs  certaines  réunions.  Quand  rien  n’a  réussi  au \n\nbureau et qu’elle rentre chez elle pour trouver Pierre absorbée par son ordinateur et son \n\nbébé  hurlant  sans  que  rien  ne  semble  le  calmer,  il  lui  arrive  de  se  décourager,  de \n\nmanquer  d’énergie,  de  se  sentir  vide  bien  qu’elle  soit  combattive  et  volontaire. \n\nHeureusement  quand  tout  va  mieux  dans  sa  famille,  quand  elle  a  le  sentiment  d’avoir \n\nbien  travailler,  et  que  ses  collaborateurs  ont  avancé  en  faisant  ce  qu’elle  leur  avait \n\ndemandé, elle se sent à nouveau confiante et positive.  \n\nCharlotte dirige son équipe avec beaucoup d’exigence, elle est rarement satisfaite de ses \n\nsubordonnés qui souffrent parfois de ses critiques et de ses difficultés à accepter ce qui \n\nn’est pas parfait à ses yeux  (Charlotte est majoritairement en position (+  -). Elle a une \n\nposition  haute  vis-à-vis  des  membres  de  son  équipe  et  de  Pierre).  Mais  des  fois, \n\n(Cependant  elle  passe aussi par  la  position  (- +)  quand  il  lui  arrive  d’être  en  difficulté \n\navec  son  patron  surtout  lorsqu’elle  n’arrive  pas  à  le  ramener  à  ses  arguments  ou \n\nlorsqu’il Lui reproche durement de rater ses objectifs certaines réunions. (Charlotte est \n\n \n \n \n \n \n \n \n \n \n \n\frarement  en  position  (--  –)  elle  est  combative  et  volontaire  cependant,  Quand  rien  n’a \n\nréussi  au  bureau  et  qu’elle  rentre  chez  elle  pour  trouver  Pierre  absorbée  par  son \n\nordinateur  et  son  bébé  hurlant  sans  que  rien  ne  semble  le  calmer,  il  lui  arrive  de  se \n\ndécourager,  de  manquer  d’énergie,  de  se  sentir  vide  bien  qu’elle  soit  combattive  et \n\nvolontaire. Heureusement quand tout va mieux dans sa famille, quand elle a le sentiment \n\nd’avoir  bien  travailler,  et  que  ses  collaborateurs  ont  avancé  en  faisant  ce  qu’elle  leur \n\navait  demandé,  elle  se  sent  à  nouveau  confiante  et  positive.  (La  position  (--  --) \n\nheureusement ne dure jamais longtemps, Charlotte se sent à nouveau en position (+ +) \n\nPour la semaine prochaine \n\nIdentifiez une relation déséquilibrée qui vous a  conduit(e) à une situation de blocage ou qui \n\nvous génère de l’inconfort (exemple : difficultés dans la relation / conflit, non-dit, malaise…). \n\nLa  solution  ne  pourra  venir  que  du  dialogue  que  vous  aurez  avec  l’autre  personne.  Voici \n\nquelques éléments pour guider votre analyse de la situation et identifier des options : \n\nExaminez la situation actuelle : Si je sens qu'il y a un problème, je ramène cet état \ndu Moi (parent ou enfant.) à l'Etat du moi Adulte \" ici et maintenant.\" Car il est \nsans affect. Il est concret, il reformule, dédramatise, il reste aux commandes, il \nne juge pas. Il s’affirme, sans agressivité ni soumission. \n\nQuel  est  mon  positionnement  dans  la  relation  avec  le  principal  interlocuteur  (moi/l’autre)  – \n\nEt/ou la position de l’autre personne dans la relation à mon égard ? \n\n(– +) : attitudes d’infériorité, de dépendance, manque d’estime de soi et/ou manque de confiance en soi. \n\nPas de prise de responsabilité, laisser-faire, refus du conflit, arrangeant \n\n(+ -) : attitudes de supériorité, de domination, de rapport de force.  \n\n(- -) : passivité, résignation, désengagement, retrait, évitement, découragement. Pas d’échange. \n\nQuelles  sont  les  erreurs  qui  relèvent  de  ma  responsabilité  –  Et/ou  les  erreurs  qui  relèvent  de  sa \n\n \n \n \n \n \n \n\fresponsabilité / celles qui relèvent de notre responsabilité à chacun ? \n\nPour aller vers une relation gagnant-gagnant : \n\n-Quels sont mes principaux objectifs ou mes besoins dans la relation (explicites et implicites) / Quels sont \n\nles principaux objectifs ou les besoins de mon interlocuteur ? \n\n-En quoi « l’autre » peut-il m’aider à atteindre mes objectifs ou à satisfaire mes besoins ? Mes attentes à \n\nson  égard  sont-elles  réalistes,  explicites,  acceptables… ?   Comment  puis-je  aider  mon  interlocuteur  à \n\natteindre ses objectifs ou à satisfaire ses besoins ? Ses attentes à mon égard … \n\n-Pour changer votre Position de Vie dans la relation ; si vous êtes positionné comme : \n\n(+ –) : listez au moins cinq qualités ou points forts que vous pouvez reconnaître à la personne \n\n(– +) : listez au moins cinq de vos qualités et valeurs personnelles \n\nPour  éviter  de  tomber  dans  les  pièges  associés  à  la  Position  de  Vie  de  l’autre  personne ;  si  elle  se \n\npositionne comme : \n\n(+  –) :  évitez  de  passer  en  Position  de  Vie  « complémentaire »,  c’est-à-dire  (-  +) ;  vous  lui \n\ndonneriez  le  bâton  pour  vous  faire  battre.  Evitez  aussi  d’entrer  en  compétition  en  adoptant  une \n\nPosition de Vie identique (+ -) qui va vous conduire à la surenchère, la critique, l’agression ou la \n\nfausse bienveillance. Bref, tendez vers la Position de Vie Gagnant-Gagnant. \n\n(– +) : votre interlocuteur cherche inconsciemment une personne qui sera en Position de Vie (+ -\n\n) ; ainsi elle se sentira soit rabaissée, soit prise en charge. Veillez à adopter une \n\nPosition de Vie qui soit au maximum (+ +). Par exemple en l’incitant à se positionner, à donner \n\nson point de vue, à prendre des responsabilités, etc. \n\n \n \n \n \n \n \n \n \n \n\f \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fBien que nous ayons une position fondamentale de départ, nous changeons de position selon \n\nnotre humeur et  la quantité de stress  que nous subissons. Nous changeons aussi en fonction \n\ndes situations ou des personnes que nous rencontrons,  \n\nDe  même  nous  pouvons  traverser  des  périodes  positives,  durant  lesquelles  nos  liens  sont \n\nsolides et enrichissants, nous obtenons ce que nous désirons, et nous nous sentons ++, mais il \n\nsuffit de quelques orages dans notre vie affective ou professionnelle pour que nous revenions \n\nà notre position favorite.  \n\nExercice de réflexion :   \n\nPour chacune de ses situations, demandez-vous ce que vous diriez, sur vous et sur les autres, \n\nsi cette situation vous arrivait. \n\nVotre  patron  ne  répond  pas  au  mail  dans  lequel  vous  avez  détaillé  vos  idées  concernant  le \n\nprojet qu’il vous a confié. \n\nVous vous présentez à un entretien et vous êtes assis plus bas que la personne qui vous reçois \n\nDemandez-vous  à  quelle  position  de  vie  correspond  chacune  de  vos  réponses,  vous  pouvez \n\naussi  chercher  des  situations  que  vous  avez  vécues  et  déterminer  les  positions  de  vie \n\ncorrespondantes   \n\nMême s'il existe une position de vie \" existentielle \" relativement stable, nous ne restons pas \n\ndans  celle-ci  en  permanence  et  nous  évoluons  entre  quatre  positions  au  fil  du  temps,  en \n\nfonction de notre contexte personnel et de nos interlocuteurs. \n\nNous  pouvons  alors  choisir  d'adopter  une  position  de  vie  et  devons  même  le  faire  pour \n\ndévelopper un cadre de travail et des relations saines. \n\npondantes. \n\n \n \n \n \n \n \n\f+ - (OK / non OK) ou   JE + TU - \n\nCette \n\nsolution \n\nest \n\ncelle \n\nde \n\nl'expansion \n\net \n\nde \n\ndomination. \n\nLa  personne  s'identifie  à  ce  qui  est  grandiose  et  glorieux.  Elle  recherche  l'originalité,  la \n\nperfection  et/ou  la  revanche.   Elle  est  d'une  susceptibilité  excessive  à  la  critique,  elle  est \n\nagressive et batailleuse. Elle ne peut supporter d'être sans aucune valeur, en faute, ou encore \n\nsans défense.  Elle manque de considération pour les autres : les dévalorise ou ne leur fait pas \n\nconfiance.  Elle  interprète  les  positions  de  vie  en  termes  de  pouvoir.  Elle  est  forte  et \n\ndynamique, \n\nmais \n\nmanque \n\nde \n\nsensibilité.  \n\nJe m'accepte comme je suis et je n'accepte pas l'autre comme il est  ; je me sur-valorise et je \n\ndévalorise l'autre.  Devant  un  problème,  je cherche un coupable et le coupable c'est l'autre. \n\nJe  l'attaque,  c'est  ta  faute  ;  je  le  chasse  ou  je  l'élimine.    Attitudes  de  domination  et \n\nd'agressivité.  Les  événements  sont  traduits  en  termes  de  pouvoir.  Les  sentiments  qui  me \n\ncaractérisent : le mépris et la pitié, la colère. \n\n+ +  (OK /OK)  ou  JE+  TU+ \n\nC'est la solution la plus constructive : dans cette position, la personne prend conscience de ses \n\npropres responsabilités, agit de façon réaliste et constructive. Elle a confiance en ses propres \n\ncapacités. Elle vit des sentiments d'amitié, d'unité, de force, d'accord avec elle-même et avec \n\nla \n\nvie. \n\nElle tend à la réalisation et l'actualisation de son potentiel, elle veut vivre profondément à tous \n\nles niveaux (sensations, émotions, idées, valeurs). Elle est honnête avec elle-même, active et \n\nproductive. \n\nCette  position  ne  signifie  pas  «  tout  le  monde  il  est  beau,  tout  le  monde  il    est    gentil \n\n»,    mais   je    m'accepte  sans  méconnaissances  et  j'estime  qu'avec  l'autre,  je  peux  avoir  des \n\nrapports  constructifs.   Devant  un  problème  je  cherche  une  solution,  une  synergie,  une \n\ncoopération.   Les \n\névénements \n\nsont \n\ngérés \n\navec \n\nune \n\nattitude \n\nde \n\ngagnant. \n\nLes émotions sont celles de l'Enfant spontané, peur, joie, colère, tristesse. \n\n- -  (non OK / non OK)  ou  JE - TU - \n\nLa solution de résignation. Souvent en retrait et désintéressée, elle est complaisante à l'égard \n\nde  ses  propres  faiblesses,  elle  remet  ses  obligations  au  lendemain  ou  bien  les  oublie. \n\nCette  personne  préfère  ne  rien  demander  plutôt  que  d'essuyer  un  refus  ;  aversion  au \n\nchangement, évite  de  s’engager,  elle  est  improductive,   destructrice  et  autodestructrice.  \n\n\fJe ne suis peut-être pas terrible, mais les autres c'est pas mieux.  Il n'y a rien que l'on puisse \n\nfaire.  Devant  un  problème  je  cherche  un  coupable,  et  c'est  tout  le  monde,  c'est  notre  faute. \n\nAttitudes  d'abandon,  de  résignation.  La  tentation  n'est  pas  le  suicide  ou  l'homicide  mais  la \n\nfolie. Les événements sont observés en spectateur résigné.  L'attirance  improductive et auto-\n\ndestructrice pour les voies de garage provoque des sentiments de dérision, d'indifférence. \n\n- +  (non OK / OK) ou  JE - TU + \n\nLa personne cherche avant tout à être aimée par les autres Elle se soumet aux autres et dépend \n\nd'eux.  Elle cultive et exagère son sentiment d'impuissance et sa souffrance et se présente en \n\nvictime.   Elle  se  sent  coupable,  inférieure,  méprisable,  dépressive,  suicidaire,  stupide, \n\nrejetée.   Elle  a  aussi  de  l'admiration  pour  la  fierté  et  l'agressivité  chez  les  autres,  a  besoin \n\nd'aide  et  ces  besoins  deviennent  des  demandes.   Elle  a  aussi  un  fort  besoin  de  se  faire \n\nremarquer,  et  croit  qu'on  se  sert  d'elle.   Elle  ne  supporte  pas  d'être  seule  et  interprète  les \n\npositions \n\nde \n\nvie \n\nen \n\nterme \n\nd'amour. \n\nJe me dévalorise et je sur-valorise l'autre.  Devant un problème, je cherche un coupable, et le \n\ncoupable, c'est moi. Je prends la fuite, c'est ma faute. J'ai des envies de suicide. Mes attitudes \n\nsont  d'admiration,  de  honte,  de  culpabilité.   Les  événements  sont  traduits  en  termes \n\nd'amour.  Les sentiments qui me caractérisent : la peur, la tristesse. \n\n \n \n \n \n \n \n \n \n \n \n \n\f \n \n \n\fChacun va passer régulièrement par les quatre positions en fonction de la représentation \nqu’il se fera d’une situation ou d’une autre et de la chaîne interactionnelle qui en \ndécoulera.  \n\n«  Je  suis  au  travail  et  mon  supérieur  vient  me  trouver  pour  me  demander  d’effectuer \nune  recherche  concernant  le  produit  que  nous  lançons  actuellement.  Il  m’explique  ce \nqu’il attend, je l’écoute et lui fais part de mon accord. Je me sens compétant pour faire \nce travail et trouve la demande légitime. \nJe  commence  alors  le  travail  lorsqu’un  collègue  s’approche  de  moi  et  commence  à  me \nparler de son Week- end. Il me vante les mérites de la voile et m’explique ce que cela lui \napporte de pratiquer ce sport. Je ne connais rien à la voile et de plus cela m’ennuie de \nl’écouter  car  j’ai  un  travail  à  faire.  Je  me  dis  que  je  ne  peux  supporter  davantage  la \nsituation et sous prétexte d’un dossier à aller chercher, je m’éclipse.  \nPlus tard dans la  journée, ma secrétaire entre l’air dépitée  et m’avoue avoir oublié de \nposter un courrier important que je lui avais remis deux jours plus tôt. Je me mets en \ncolère et lui dit que je vais le faire moi-même, ajoutant que je ne peux lui faire confiance.  \nLe  téléphone  sonne  alors  et  ma  femme  m’apprend  que  les  ouvriers  qui  réalisent  des \ntravaux à notre domicile doivent s’absenter pour un autre chantier et vont laisser notre \nappartement en l’état pendant deux semaines. Elle n’a pu obtenir qu’ils terminent notre \nchantier  avant  de  commencer  l’autre.  Je  raccroche  en  me  disant  que  je  ne  peux  en \nsupporter davantage. Je me sens vidé et déprimé.  \n\n«  Je  suis  au  travail  et  mon  supérieur  vient  me  trouver  pour  me  demander  d’effectuer \nune  recherche  concernant  le  produit  que  nous  lançons  actuellement.  Il  m’explique  ce \nqu’il attend, je l’écoute et lui fais part de mon accord. Je suis en position OK+/OK+, je \nme sens compétant pour faire ce travail et trouve la demande légitime. \nJe  commence  alors  le  travail  lorsqu’un  collègue  s’approche  de  moi  et  commence  à  me \nparler de son Week- end. Il me vante les mérites de la voile et m’explique ce que cela lui \napporte de pratiquer ce sport. Je ne connais rien à la voile et de plus cela m’ennuie de \nl’écouter  car  j’ai  un  travail  à  faire.  Je  me  dis  que  je  ne  peux  supporter  davantage  la \nsituation et sous prétexte d’un dossier à aller chercher, je m’éclipse.  Je suis en position \nOK -/ OK+ et fuis le collègue envahissant. \nPlus tard dans la  journée, ma secrétaire entre l’air dépitée  et m’avoue avoir oublié de \nposter un courrier important que  je lui avais remis deux jours plus tôt. Je me mets en \ncolère et lui dit que je vais le faire moi-même, ajoutant que je ne peux lui faire confiance. \nJe suis en position OK+/ OK-, je me débarrasse de ma secrétaire tout en justifiant mon \ngeste et donc ma position OK+. \nLe  téléphone  sonne  alors  et  ma  femme  m’apprend  que  les  ouvriers  qui  réalisent  des \ntravaux à notre domicile doivent s’absenter pour un autre chantier et vont laisser notre \nappartement en l’état pendant deux semaines. Elle n’a pu obtenir qu’ils terminent notre \nchantier  avant  de  commencer  l’autre.  Je  raccroche  en  me  disant  que  je  ne  peux  en \nsupporter  davantage.  Je  me  sens  vidé  et  déprimé.  Je  suis  en  position  OK-/OK-  et \nrenforce mon opinion que moi comme les autres ne sommes pas à la hauteur. » \n\n \n \n \n \n \n \n \n \n\fOn voit bien dans cet exemple comme on peut passer rapidement d’une position à l’autre    \n\n Chacun pourra trouver des exemples personnels de changements rapides de position. \n\nA  titre  d’exercice,  on  pourrait  reprendre  l’exemple  et  voir  comment  on  aurait  pu \nmaintenir la position OK+/OK+ dans l’ensemble des situations. \n\n \n \n \n \n \n \n\f"
}