{
    "content": "Psychosociologie de la communication \n\nNiveau 2éme année-cycle Ingénieur \n\nIntroduction \n\n1-Définitions  \n2-Différentes approches en psychologie \n\nLa psychologie : \nLa “psychologie” == l’étude scientifique (logo) de l’âme (psukhê). \n== « l'ensemble des manières de penser, de sentir, d'agir qui caractérisent  \nUne personne, un animal, un groupe, un personnage”.  \nElle met l’accent sur : \nLes processus internes, mentaux (les modalités de fonctionnement).  \nLes faits psychiques, la connaissance des sentiments, des idées, des comportements \nd'autrui, \n\nLes caractéristiques de personnalité (la manière d’être, de se comporter, plutôt que le fait \nde posséder tel ou tel trait de personnalité) \n\nLa sociologie :  \nLa « sociologie » est l’étude du groupe et de sa structure. C’est-à-dire les  \nModes d’organisation, les stratégies d’acteurs et de communication, etc.   \nElle permet d’étudier : \n\n⃰⃰⃰⃰La  manière  d'être,  la  façon  de  se  comporter,  de  réagir,  d’échanger  en  fonction  de \nl’environnement (Habitus selon Pierre Bourdieu) \n\nL’individu (agent social), ses comportements dans la société, ses pratiques individuelles et \ncollectives, etc. \n\nL’ensemble  des  mécanismes  par  lesquels  les  individus  acquièrent  des      rapports  sociaux \nentre  les  hommes  et  assimilent  les  normes,  les  valeurs  et  les  croyances  d’une  société  ou \nd’une collectivité. \n\n La psychosociologie ? \n\n \n \n \n \n  \n \n \n⃰⃰⃰⃰\n⃰⃰⃰⃰\n⃰⃰⃰⃰\n \n\fLa  psychosociologie  consiste  en  une  association  entre  la  psychologie  humaine  et  la \nsociologie.  \n\n→Elle étudie les interactions entre les gens et en tire des conclusions. \n\nLa psychosociologie ou psychologie sociale \n\n == l’étude psychologique des faits sociaux \n\n == étude des interactions sociales grâce à un ensemble de théories et de méthodes qui lui \nsont propres. \n\n→ Elle tente d’expliquer les conduites sociales en étudiant les processus de relations entre \nles individus.  \n\n--  La  façon  dont  les  personnes  s’influencent  entre  elles  et  se  perçoivent  entre  elles  dans  un \ngroupe.  \n\nLa  psychologie  sociale  emprunte  une  voie  scientifique  pour  tenter  de  comprendre  et \nd’expliquer comment les pensées, les sentiments et les comportements des individus sont \ninfluencés par ceux d’autres individus.  \n\nObjectifs pédagogiques du module :  \n\n- Être capable d’analyser des situations de communication \n- Apprendre à mieux se connaître pour aller plus loin dans son développement personnel \n-  Prendre  conscience  des  mécanismes  de  fonctionnement  des  comportements  (Filtres, \nattitudes, jeux psychologiques…) \n- Apprendre à comprendre, contrôler et à gérer ses émotions  avec confiance, affirmation et \nmaitrise de soi,  \n- Apprendre à accueillir les émotions des autres et à gérer les situations relationnelles \n- Apprendre à définir son positionnement relationnel et mieux fonctionner avec les autres \n-  Découvrir  les  techniques  qui  permettent  d’atteindre  plus  facilement  vos  objectifs \nprofessionnels \n\nObjectifs spécifiques du module \n\n- Faire découvrir le fonctionnement et la complexité de l’acte de communiquer  \n\n- Déterminer les chemins usuels de tout acte de communication, d’en détecter les blocages, \nles parasites et les interférences éventuelles ; \n- Aider chaque apprenant à définir ses propres compétences dans l’acte de communiquer ; \n-  Développer  des  compétences  propres  pour  que  chacun  puisse  améliorer  ses  capacités  à \ndévelopper une communication efficace \n\nDifférentes approches en Psychologie : \n\nJusqu’au XIXe siècle, ce que l’on appelle processus psychiques était dans un ensemble de \nchoses appelé philosophie, la psychologie n’existait pas.  \n\n \n \n \n \n\fA  partir  du  XIXe  siècle,  on  voit  apparaître  des  disciplines  scientifiques,  On  assiste  à \nl’apparition de la psychologie, la sociologie, l’anthropologie et l’histoire, on fait la différence \nentre sciences humaines et sciences physiques ; \n\nPour  l’époque,  c’était  très  important  de  savoir  exactement  ce  qui  peut  définir  une  science \n(applique une méthode de vérification ou de falsification, pour valider une théorie).  \n\nPour  se  différencier  de  la  philosophie  il  fallait  pour  la  psychologie  trouver  des \nconnaissances certaines.  \n\nOn  a  coutume  de  faire  remonter  la  naissance  de  la  psychologie  scientifique  aux  travaux  de \n\nWilhelm Wundt (1832-1920), lequel a fondé le premier laboratoire entièrement consacré à la \n\nrecherche  psychologique  expérimentale,  à  l’université  de  Leipzig  en  Allemagne  en  1879. \n\nC’est  la  raison  pour  laquelle  différents  auteurs  considèrent  que  1879  constitue  l’année  de \n\nnaissance de la psychologie. \n\nDepuis sa naissance à la fin du XIXe siècle, la psychologie n’a cessé de se transformer. \n\nElle est définie comme la science de la vie mentale : ses phénomènes et ses conditions… \n\nCes phénomènes sont les sentiments, les désirs, les cognitions (connaissances), \n\nraisonnements, décisions etc. » (W. JAMES, 1890.)  \n\n« l’étude scientifique du comportement de l’espèce vivante en contact avec le monde \n\nexterne. » (K.KOFFKA, 1925)  \n\n« L’analyse scientifique des processus mentaux de l’être humain et les structures \n\nmnésiques en vue de comprendre le comportement humain ». (R.MAYER, 1981). \n\nLe comportement qui constitue l’objet d’étude de la psychologie est l’ensemble d’actions \net de réactions qu’on peut observer, évaluer et soumettre à l’expérience. \n\n Ce comportement obéit à des lois biologiques (hérédité) et culturelles (acquisition).  \n\nEtant donné la richesse et la complexité du comportement, les psychologues ont développé \n\n plusieurs approches pour l’appréhender  \n\nLes  principales  approches,  qui  représentent  les  grandes  orientations  théoriques  de  la \n\npsychologie :  le  Behaviourisme,  la  psychanalyse,  la  psychologie  cognitive,  la  psychologie \n\nhumaniste, la psychologie sociale et culturelle. \n\n \n \n \n \n \n \n \n \n \n \n\fApproche behavioriste \n\nLe béhaviorisme (ou comportementalisme, vient de l'anglais behavior qui signifie  \n\n« comportement »)  \n\n== une approche de la psychologie à travers  l'étude des interactions de l'individu avec le \nmilieu.  \n\nPour  les  behavioristes  une  méthode  de  recherche  véritablement  scientifique  doit  être \nlimitée à l'étude des comportements objectifs et observables.  \n\nEn fait, ils croient que  tout comportement peut être considéré comme une réponse à un \n\nstimulus  (un  objet  ou  un  événement,  interne  ou  externe,  qui  stimule  ou  fait  répondre  un \n\norganisme).  \n\n→ Le comportement est déterminé par le facteur situationnel. \n\n  Expérience  de  Pavlov  (1849-1936)  qui  parle  de  réflexes  conditionnés,  =>  S-R  (stimulus- \nRéponse) \n\nWatson (1879-1958) et Skinner parlent de renforcement (positif/négatif), on parle plus des \nréponses de l’organisme \n\nSelon  la  théorie  béhavioriste,  l'esprit humain  (et  animal)  était considéré  comme  une  boîte \nnoire dont les réponses (le comportement) devaient être analysables comme une fonction des \nstimulations  sans  qu'il  soit  nécessaire  de  faire  des  hypothèses  supplémentaires  sur  les \nmécanismes impliqués. \n\nDans cette approche, le \"Je\" et la conscience sont exclus des investigations… \n\nhttps://www.youtube.com/watch?v=hz08UfRU3R4  (Le Behaviourisme) \n\nL’approche psychanalytique / psychodynamique \n\nLes  origines  de  cette  approche  sont  issues  de  l’apport  de  Sigmund  Freud  (1856-1939), \nfondateur de la psychanalyse.  \n\nLa  théorie  Freudienne,  la  psychanalyse,  métaphorise  la  vie  mentale  humaine  comme  un \n\niceberg.  \n\nFreud  indique  que  les  expériences  conscientes  sont  seulement  la  partie  émergée  de \n\nl'iceberg.  \n\n=/=  en  sous-marin,  caché  de  la  vue,  flotte  un  vaste  stock  de  pulsions,  de  souhaits,  et  de \n\ndésirs inconscients.  \n\n \n \n\fPour  lui,  les  Hommes  ne  commandent  pas  consciemment  leurs  pensées,  sentiments,  et \n\ncomportements ; ceux-ci sont au contraire déterminés par des forces inconscientes. \n\n→ certains conflits internes qui peuvent créer de l’angoisse et des symptômes en chacun de \n\nnous et affecter la façon dont nous entrons en relation avec les autres. \n\nSelon  Freud,  tout  comportement,  normal  ou  anormal,  est  influencé  par  l’inconscient.  Cette \ncroyance s'appelle le déterminisme psychique. \n\nhttps://www.youtube.com/watch?v=jWsP4g6yekU&t=233s  (Approche psychanalytique) \n\nLA PSYCHOLOGIE COGNITIVE  \n\nElle se construit en complément au behaviorisme et contre lui \n\n=/=  de  concevoir  les  Hommes  comme  des  récepteurs  passifs  guidés  par  des  forces \nenvironnementales (modèle S-R) mais comme des acteurs des expériences qu'ils vivent. \n\n Tout  individu  change  et  forme  ses  expériences  en  employant  des  processus  mentaux  pour \ntransformer l'information.  \n\nLa psychologie cognitive étudie les processus mentaux tels que la mémoire, la résolution \ndes  problèmes,  le  raisonnement,  la  prise  de  décision,  la  perception,  le  langage,  et \nd'autres formes de connaissances.  \n\nElle Cherche à décrire scientifiquement la manière dont l’esprit fonctionne.   \n\n Pour  rendre  compte  du  comportement,  il  est  nécessaire  d'étudier  ses  mécanismes  sous-\njacents, c'est à dire ce qui se passe entre le stimulus et la réponse du schéma behavioriste \n(stimulus ---> réponse). \n\nCette démarche implique donc \"d'entrer dans la boîte noire\". \n\nPour  la  psychologie  cognitive,  le  comportement  ne  peut  être  simplement  spécifié  en \ntermes  de  propriétés  observables,  mais  requiert  des  explications  en  termes  de \nreprésentations mentales, processus mentaux, croyances, intentions, etc. (Reber, 1985) \n\nhttps://www.youtube.com/watch?v=fzUlpJTXryE  (la psychologie cognitive) \n\nHistoriquement, la psychologie cognitive prend source de deux courants de pensée :  \n\nUn,  porté  par  un  petit  groupe  de  scientifiques  allemands  étudiant  la  perception  humaine  au \ndébut du XXème siècle : la Gestalt psychologie,  \n\nUn,  concomitant  à  l'émergence  de  l'informatique  dans  la  deuxième  moitié  du  siècle :  la \ncybernétique.  \n\n \n \n \n \n\fLe gestaltisme a fait son apparition en Allemagne en 1912, il renaît dans la première moitié \ndu vingtième siècle,  \n\nGestalt signifie en allemand « entier, la forme, ou le modèle ». On le désigne d’ailleurs parfois \naussi sous le terme de théorie de la forme.  \n\nCommenté [EAA1]:  \n\nLes  psychologues  de  la  Gestalt,  notamment  Max  Wertheimer,  Kurt  Koffka,  et  Wolfgang \nKöhler, soulignent que les personnes perçoivent les objets et les modèles en tant qu'unités \nentières et que l'entier perçu est plus que la somme de ses parties. \n\n→  Ceci,  est  la  preuve  que  les  individus  perçoivent  des  totalités  ou  des  ensembles  plutôt \nque des séries de sensations distinctes. \n\nhttps://www.youtube.com/watch?v=tQZTDM3EeIs \n\nLa cybernétique  \n\nApparut dans les années 1940 et 1950 aux États-Unis  \n\nSelon cette approche, le cerveau traite l'information selon des étapes séquentielles, comme \n\nun ordinateur le fait - une étape à la fois.  \n\nLa  conscience  (les  états  mentaux)  est  organisée  comme  un  logiciel  de  traitement  de \n\nl’information  qui  établit  les  données  sortantes  (output)  en  fonction  des  données  entrantes \n\n(input).  On  parle  de  théorie  computationnelle  de  l’esprit  :  le  cerveau  traite  l’information \n\nsous  forme  de  symboles.  Les  symboles  sont  des  configurations  neuronales  spécifiques, \n\navec traitement syntaxique, aboutissant à un comportement. \n\nhttps://www.youtube.com/watch?v=u2NxSHdtJKg (cybernétique étymologie) \n\nhttps://www.youtube.com/watch?v=IY8UjFOh7Ew (la psychologie cybernétique) \n\nLa psychologie cognitive se concentre sur le traitement de l’information.  \n\nElle  est  concernée  par  l'acquisition,  le  stockage,  la  récupération,  et  l'utilisation  des \nconnaissances,  \n\nExemple : Si vous écoutez un de vos amis décrire étape par étape sa traversée à la nage d’une \nmer (ou plus modestement d’un lac !),  \n\nLa  psychologie  cognitive  s'intéressera  à  la  façon  dont  vous  déchiffrez  la  signification  de \nces  mots,  comment  vous  formez  des  images  mentales  de  la  traversée,  comment  vous \nincorporez son expérience à vos concepts précédents de ce type d’épreuve, etc.  \n\nSelon  l’approche  cognitiviste,  nous  recueillons  des  informations  de  l'environnement  qui \n\nsubissent ensuite un processus de traitement en une série d'étapes.  \n\n\fL'approche  du  traitement  de  l'information  est  basée  sur  l'idée  que  les  humains  sont \n\ncomme  des  ordinateurs  :  tous  deux  entrent  de  l'information,  la  traitent,  et  produisent \n\nune réponse.  \n\n Ainsi la psychologie cognitive peut être résumée en trois objectifs :  \n\n1. Comment un système naturel ou artificiel acquiert de l'information  \n\n2. Comment ces informations sont représentées et transformées en connaissance \n\n 3.Comment  ces  connaissances  sont  utilisées  pour  guider  notre  attention  et  notre \n\ncomportement.  Ce sont les  neuropsychologues cognitivistes  qui  ont  poussé le plus loin  ces \n\nidées, en faisant le lien entre les fonctions cognitives et les structures cérébrales. \n\n En  effet,  la  psychologie  cognitive  favorise  la  conception  de  méthodes  de  recherches \n\ninnovatrices  pour  étudier  les  processus  cognitifs.  Ainsi,  elle  offre  une  meilleure \n\ncompréhension de l'influence des pensées sur le comportement. En outre, la psychologie \n\ncognitive tente d’élaborer des stratégies visant à améliorer les capacités intellectuelles. \n\nLA PSYCHOLOGIE HUMANISTE (Née à partir des années 50) \n\nElle  se  concentre  sur  la  singularité  des  êtres  humains  et  sur  leur  capacité  de  choix, \nd’évolution et d’accomplissement \n\n Elle rejette avec une égale vigueur :  \n\nLa  perspective  béhavioriste  (le  comportement  est  déterminé  par  des  facteurs  de \nl'environnement)  \n\nLa  perspective  psychanalytique  (le  comportement  humain  est  déterminé  principalement \n\npar des forces inconscientes).  \n\nLes  humanistes  articulent,  au  contraire,  une  approche  beaucoup  plus  positive  de  la  nature \n\nhumaine.  Ils  maintiennent  que  les  gens  sont  de  façon  innée  bons  et  qu'ils  possèdent  un \n\nlibre arbitre. \n\nIls  croient  que  tout  sujet  est  capable  de  faire  des  choix  conscients  et  rationnels,  qui \n\npeuvent le mener à l’épanouissement personnel.  \n\n \n \n\fMaslow a proposé une théorie de la motivation qui se compose d'une hiérarchie des besoins. Il \n\na  considéré  le  besoin  d’autoréalisation  (se  développer  dans  ses  plus  pleines  capacités) \n\ncomme le besoin le plus élevé dans cette hiérarchie. \n\n Chef de file incontesté de ce mouvement, Carl Rogers postule que l'homme à une tendance \n\nfondamentale à la maturation en  fonction des expériences qu’il  vit  et il  a une  confiance \n\nabsolue dans les ressources et les possibilités d'adaptation de celui-ci \n\nRogers  pense  que  chaque  individu  à  une  tendance  et  une  capacité  latente  à  pouvoir  se \n\ncomprendre et résoudre ses problèmes.  \n\nMartin Seligman parle de psychologie positive et la définit comme l’étude scientifique des \n\ncaractéristiques  psychologiques,  tel  que  l'optimisme,  qui  permettent  à  des  sujets  et  à  des \n\ncommunautés de prospérer face à l'adversité  \n\nIl  souligne  que  ces  caractéristiques  sont  des  facteurs  protecteurs  contre  les  expériences \n\ndifficiles et traumatiques.  \n\nContrairement  au  behaviorisme  qui  considère  le  comportement  comme  une  réponse  à  un \n\nstimulus,  les  humanistes  soulignent  le  libre  arbitre  :  les  sujets  font  leurs  propres  choix  et \n\ndécident comment se comporter. En conséquence, chaque personne est une personne unique.  \n\nToutes  les  personnes,  selon  Maslow,  ont  la  nécessité  et  la  capacité  d'accomplir  leur \npotentiel unique et optimal.  \n\nhttps://www.youtube.com/watch?v=3B9XdQDuKMw  \n\nLA PSYCHOLOGIE SOCIALE ET CULTURELLE  \n\nL'approche  socioculturelle  souligne  les  influences  sociales  (psychologie  sociale)  et \nculturelles (psychologie interculturelle) sur le comportement humain  \n\nElle souligne l'importance de comprendre ces influences dans l’interprétation des \ncomportements (les siens et ceux des autres). \n\n--La psychologie sociale étudie comment les relations de la personne avec d'autres personnes \n\net groupes, et comment la culture et la société affectent le comportement humain.  \n\nConsidère  les  Hommes  comme  agissant  les  uns  sur  les  autres,  influençant  et  étant \n\ninfluencés par les autres.  \n\n \n\fElle  étudie  donc  comment  les  personnes  agissent  les  unes  sur  les  autres  (niveau \n\ninterindividuel)  et  comment  les  gens  se  comportent  en  groupes  (niveau  groupe  et \n\nintergroupe). \n\n C'est un vaste champ d’étude couvrant des problématiques telles que l'obéissance, la théorie \n\nde l’influence sociale, ou les stéréotypes.  \n\nCe n'est pas simplement les gens et les groupes qui affectent le comportement, mais aussi \n\nla situation sociale elle-même.  \n\nDans  toute  société,  l’individu  a  des  rôles  sociaux  et  ces  rôles  possèdent  des  attentes \n\nconnectées à eux. Les sujets tendent à agir selon leur rôle social. \n\n-- La psychologie culturelle \n\n La culture est le mode de vie partagé par un groupe de personnes. Ce mode de vie inclut \n\ndes  idéaux,  des  valeurs,  et  des  hypothèses  au  sujet  de  la  vie  et  des  grilles \n\ncomportementales  ;  et  permet  aux  personnes  de  survivre  dans  leur  environnement. \n\nChaque culture développe ses propres normes pour la tenue vestimentaire, le logement, et \n\nle  transport  etc.,  aussi  bien  que  ses  propres  langues,  religions,  traditions,  et  coutumes \n\nsociales.  Un  domaine  de  la  psychologie  qui  devient  de  plus  en  plus  important  est  ainsi  la \n\npsychologie culturelle. Ces chefs de file sont John Berry et A. BANDURA. \n\n Les psychologues culturels étudient l'influence de la culture et des pratiques ethniques sur le \n\ncomportement des personnes. Ils essayent de déterminer quels comportements sont universels \n\nà tous les êtres humains et ceux qui sont spécifiques à différentes cultures.  \n\nhttps://www.youtube.com/watch?v=fYWt_-L0MW4 (psychologie culturelle) \n\nConclusion \n\nLe  behaviorisme  considère  les  comportements  observables  et  mesurables  comme  seuls \nthèmes appropriés à la psychologie et souligne la fonction clé de l'environnement comme \ncause déterminante du comportement.  \n\nLa psychanalyse est le terme que Freud utilise pour sa  théorie de la  personnalité  et  sa \nthérapie  pour  le  traitement  des  troubles  psychologiques  ;  l'inconscient  est  le  centre \noriginel de la théorie psychanalytique. \n\nLa  psychologie  cognitive  voit  les  humains  comme  des  participants  actifs  de  leur \nenvironnement ; elle étudie les processus mentaux tels que la mémoire, la résolution des \n\n\fproblèmes,  le  raisonnement,  la  prise  de  décision,  la  perception,  le  langage,  et  d'autres \nformes de connaissance.  \n\nLe  gestaltisme  considère  que  les  personnes  perçoivent  des  objets  et  des  formes  en  tant \nqu'unité entière et que l'entier perçu est plus que la somme de ses parties. \n\nLa théorie du traitement de l'information est une approche de l'étude des structures et \ndes processus mentaux qui utilise l'ordinateur comme modèle pour la pensée humaine.  \n\nLa psychologie humaniste se concentre sur l'unicité, la singularité des êtres humains et \nde leurs capacités de choix, de maturation, et de santé psychologique.  \n\nLa  psychologie  positive  est  l'étude  scientifique  des  caractéristiques  psychologiques  qui \npermettent à des personnes et à des communautés de prospérer face à l'adversité. \n\n La  psychologie  socioculturelle  interroge  les  facteurs  sociaux  et  culturels  qui  peuvent \nêtre  des  facteurs  aussi  puissants  que  les  facteurs  évolutionnistes  et  physiologiques \naffectant le comportement et les processus mentaux ; et ces facteurs doivent être intégrés \ndans l’interprétation des comportements d’autrui. \n\n \n\f"
}