{
    "content": "1. Partie 2 – Simulation\n\n1.1 Introduction\nDans  cette  partie, on  va  essayer de  faire une  petite  simulation sur le logiciel THERMOPTIM.\nTHERMOPTIM a été conçu pour faciliter le calcul de cycles thermodynamiques complexes. Il nous\noffre la possibilité de créer un schéma comme le montre la figure 1, après avoir terminé cette partie,\non fait le paramétrage des composants et par la suite, on peut faire le calcul. Dans ce qui suit, on va\nessayer de modéliser notre système, faire le calcul et on va tracer à la fin le diagramme enthalpique.\n\nFigure 1: Editeur de schémas.\n\n1.2 Modélisation\nOn se propose d'étudier le cycle thermodynamique d’un moteur, le schéma est celui de la figure 2\ndessiner par le logiciel THERMOPTIM en utilisant l’éditeur des schémas.\n\nFigure 2: Cycle thermodynamique d'un moteur.\n\nMaintenant, après avoir dessiné le cycle, il faut configurer les points ainsi que les transformations.\nLe tableau suivant montre la température et la pression au niveau de chaque point.\n\nTable 1: Caractéristiques de chaque points.\n\nPoint\n\nTempérature (°C)\n\nPression (bar)\n\n1\n\n2\n\n3\n\n20\n\n20\n\n650\n\n1\n\n4\n\n4\n\n\fPoint\n\n4\n\nTempérature (°C)\n\n650\n\nPression (bar)\n\n1\n\nLes points sont maintenant configurés, il reste à paramétrer les transformations. On commence par\nle compresseur, la transformation dans ce cas est isentropique, pour indiquer à THERMOPTIM\ncette transformation, on double-clique sur le compresseur, une fenêtre se présente et c'est dans cette\ndernière qu'on va spécifier le type de transformation, ainsi que d'autre information.\n\nFigure 3: Paramétrage des composants.\n\n1.3 Résultats\nDans cette phase, on va essayer de déterminer le rendement, on va voir aussi la relation entre le\nrendement et la température et on va aussi tracer le diagramme entropique.\n\nFigure 4: Points, transformations et le bilan.\n\n\fDans la figure 4, lorsqu'on appuie sur le bouton bilan, on reçoit les valeurs de l'énergie payée,\nl'énergie utile ainsi que l'efficacité ou bien le rendement de notre cycle thermodynamique. Ces\nvaleurs sont obtenues pour une température de 650°C\n\nMaintenant, on va voir l'impact de la température sur l'efficacité du cycle thermodynamique.\n\nTable 2: Variation du rendement en fonction de la température.\n\nT3\n(°C)\n\n500\n550\n600\n650\n700\n\nH1\n(Kj/Kg)\n-4,86\n-4,86\n-4,86\n-4,86\n-4,86\n\nH2\n(Kj/Kg)\n138,26\n138,26\n138,26\n138,26\n138,26\n\nH3\n(Kj/Kg)\n495,19\n550,1\n605,55\n661,52\n717,98\n\nH4\n(Kj/Kg)\n238,06\n275,91\n314,21\n353,04\n392,34\n\nW12\n(Kw)\n143,12\n143,12\n143,12\n143,12\n143,12\n\nQ23\n(Kw)\n356,93\n411,85\n467,3\n523,26\n579,73\n\nW34\n(Kw)\n-257,13\n-274,19\n-291,34\n-308,48\n-325,65\n\nQ41\n(Kw)\n-242,92\n-280,77\n-319,07\n-357,91\n-397,2\n\nη\n\n0,319\n0,318\n0,317\n0,316\n0,315\n\nLorsqu'on trace l'évolution du rendement, en trouve la courbe suivante.\n\nRendement en fonction de la température.\n\n0,32\n\n0,319\n\n0,318\n\n0,317\n\nη\n\n0,316\n\n0,315\n\n0,314\n\n0,313\n\nη\n\n500\n\n550\n\n600\n\nT (°C)\n\n650\n\n700\n\nFigure 5: Rendement en fonction de la température.\n\n1.4 Editeur de diagrammes\nCette   fonction   nous   permet   de   tracer   le   cycle   thermodynamique   sous   forme   de   diagramme\nentropique (T, s), diagramme (P, v) ou digramme de Mollier.\n\nPour la vapeur condensable, on a les figures suivantes.\n\n\fFigure 6: Vapeur condensable - diagramme entropique.\n\nFigure 7: Vapeur condensable - diagramme (h, p).\n\n\fS\n\nFigure 8: Vapeur condensable - diagramme (P, v).\n\nFigure 9: Vapeur condensable - diagramme de Mollier.\n\nPour les gaz idéaux, on a les figures suivantes.\n\n\fFigure 10: Gaz idéaux - diagramme (P, v).\n\nFigure 11: Gaz idéaux - diagramme (T, s).\n\n\f"
}