{
    "content": "Situation à analyser : Corrigé   \n\nDéfinir l’analyse transactionnelle  \n\nPour analyser cette situation de communication je vais utiliser le modèle des Etats du moi \n\nSophie et Gérard sont deux collègues de la société TPX, secteur des travaux publiques, ils sont dans une relation \nprofessionnelle  non  hiérarchique  symétrique  car  ils  ont  le  même  statut  dans  la  société.  Leurs  rôles  sont \nproches  puisqu’ils  peuvent  prendre  en  charge  les dossiers  l’un  de  l’autre  en  cas  de  besoin.  Au  niveau de  leur \nidentité, Gérard est plus âgé et plus ancien que Sophie dans l’entreprise. Sophie est sympathique quoiqu’un peu \nstressée parfois car sa vie de famille, avec trois enfants, est délicate à concilier avec son travail qu’elle apprécie \ncependant beaucoup. \n\nLa  relation  entre  les  deux  collègues,  habituellement  sympathique,  est  influencée  par  le  comportement  de \nGérard  qui  prend  ses  distances  avec  sa  collègue  en  refusant  de  l’affronter  de  peur  de  compromettre  ses \nintérêts.      \n\n Ils  sont  en  conflit.  Il  s’agit  d’un  conflit  d’intérêts  ouvert,  puisque  les  acteurs  expriment  leurs  griefs  (plainte, \nprotestation, préjudice). L’événement déclencheur est la nouvelle de ses dates de congé pour Sophie. \n\nDans ce conflit, l’état du moi aux commandes pour Sophie est l’état du moi Enfant (Rebelle), Sophie est sous \nl’emprise  de  ses émotions,  elle est en colère, elle parle à haute voix, elle  proteste auprès d’Alexandra (verbal) \nElle a tenté une première transaction adulte en s’adressant à l’adulte de Gérard pour trouver une solution, Gérard \na répondu en adulte en refusant de changer ses dates de congé. Elle a tenté ensuite de jouer sur l’émotion auprès \nde  Gérard  par  la  culpabilisation  d’abord  qui  s’est  exprimée  par  des  signes  verbaux  en  affirmant  qu’elle  ne \npourrait pas être avec ses enfants pendant une semaine puis par la colère, affichée par des signes non-verbaux \n(Sophie n’a plus regardé Gérard et s’est murée dans le silence). Sophie est dans son enfant Rebelle, elle refuse \nd’accepter la décision concernant les congés. \n\nSophie adopte la position de vie (+-) Elle entre en conflit avec son collègue qui a changé d’état du moi et passé \ndans son Enfant adapté soumis, il opte plutôt pour la fuite puis le mutisme ‘Ne parle pas avec sa collègue, se \ntait  pendant  la  réunion),  Il  l’évite  de  peur  de  compromettre  ses  intérêts  et  s’en  remet  à  la  décision  du \nresponsable. Il se soumet aux lois et décisions de l’autorité, aux règles de l’organisation. \n\nSylvain  DECOMBES,  directeur  du département  «  suivi  des  chantiers  »  est  dans  son  parent  Normatif  sévère, \nactivé par le comportement de Sophie. Autoritaire, attaché aux normes et traditions de l’entreprise, il impose sa \ndécision en refusant d’écouter tout argument venant de ses subordonnés, il n’a pas réellement mis fin au conflit \net  s’est  contenté  de  réaffirmer  et  de  réexpliciter  son  arbitrage.  Il  n’a  tenté  aucune  médiation  entre  les  deux \nacteurs  pour  un  dépassement  du  conflit  par  un  autre  moyen.  Il  adopte  une  position  de  vie  (+-)  en  se \ndébarrassant  de  Sophie  tout  en  justifiant  sa  décision.  « Lorsque  deux  salariés…il  est  de  tradition  de  donner  la \npriorité au plus ancien. L’assistante Alexandra Salvina connu pour son Parent Nourricier, a accueilli l’enfant de \nSophie  avec bienveillance et compréhension, elle a utilisé son Adulte pour tenter une négociation qui aurait pu \naboutir à des concessions « Alexandra écoute sophie avec bienveillance » essaie d’intervenir en disant « on peut \ntoujours  trouver  un  arrangement.  Mais  la  transaction  adulte  Adulte-Adulte  a  été  croisée  par  une  transaction \nParent  –  Enfant,  elle  n’a  pas  été  légitimée  dans  ce  rôle  par  son  patron.  Le  parent  normatif  très  sévère  a \nconvoqué l’enfant adapté soumis de Sophie qui part sans rien dire au bord des larmes. Ce qui risque de laisser un \nimpact négatif sur la psychologie de Sophie et sur la relation dans le groupe. \n\nPour sortir de ce conflit, Sylvain Déscombes aurait pu Changer d’état du moi et adopter l’Adulte proposé par \nAlexandra, en essayant de réfléchir à une solution où les besoins et les intérêts des deux collègues seraient pris \nen considération, adopter une écoute empathique et active pour comprendre la position de Sophie et engager un \ndialogue entre les deux collègues pour parvenir à un compromis où ils seraient tous les deux gagnants. \n\n \n\f"
}