{
    "content": " Module :Organisation et méthodes de la maintenance  \n\n3ème année Licence , Spécialité Maintenance industrielle. \n\nSÉRIE DE TD N° 02 \n\nTechniques utilisées en maintenance \n\nExercice 1 : \n\n1)  Définir la fiabilité. Quels sont les quatre éléments importants de cette définition ? \n\n2)  Quels sont les deux principaux indicateurs de la fiabilité ? Les définir ? Enoncez  ses formules et \n\ndonnez ses unités ? \n\n3)  Qu’appelle-t-on : Défaillance, Causes de défaillance, Modes de défaillance ? \n\n4)  Que désigne l'AMDEC ? \n\nExercice 2 : \n\n      Complétez le tableau suivant ? avec ; C= O x D x G \n\nGrandeur \n\nDésignation \n\nValeurs possibles \n\nC \n\nO \n\nD \n\nG \n\n……………… \n\n……………… \n\n……………… \n\n……………… \n\n……………… \n\n……………… \n\n……………… \n\n……………… \n\nExercice 3 \n\nIndiquez suivant le niveau de C les actions correctives à engager ? \n\nNIVEAU de C \n\nACTIONS CORRECTIVES À ENGAGER \n\n….. ≤C˂…… \n\n32 ≤C˂……. \n\n…… ≤C˂48 \n\n…… ≤C˂64 \n\nC˂16 \n\nMise sous préventif à fréquence faible \n\n……………………………. \n\n……………………………. \n\n……………………………. \n\n……………………………. \n\nExercice 4 \n\n        La  figure  ci-dessous  représente  une  installation  série  d’une  installation  d’épuration  des  eaux \n\nusagées : \n\n      Le relevé de pannes de cette installation est illustré dans le tableau comme suit : \n\n1 \n\n \n \n \n \n \n \n \n\f Module :Organisation et méthodes de la maintenance  \n\n3ème année Licence , Spécialité Maintenance industrielle. \n\nPannes exprimées en heures (Temps de référence : 1500 heurs) \n\nStation de pompage \n\nDégrilleur  \n\nDéssableur  \n\nDécanteur  \n\n3  \n\n4 \n\n0.5  \n\n3  \n\n2.5  \n\n4  \n\n0.5  \n\n1.5  \n\n5  \n\n2  \n\n2  \n\n2 \n\n1 \n\n3  \n\n1.5  \n\n1.5  \n\n4  \n\n0.5 \n\n6  \n\n8.5  \n\n8 \n\n1- Calculer le MTBF de chaque élément. \n\n2- Calculer le Taux de défaillance λ de chaque élément. \n\n3- Déterminer la fiabilité R de la station : \n\n  par heure de fonctionnement \n\n  pour une semaine de fonctionnement \n\n  pour 4 semaines de fonctionnement \n\nExercice 5 \n\nUne  machine  de  production  dont  la  durée  totale  de  fonctionnement  est  de  15000heures,  se \n\ncompose de quatre sous-systèmes A, B, C et D montés en série et ayant les MTBF respectifs suivants \n\n: MTBFA = 4500 heures MTBFB= 3200 heures MTBFC= 6000 heures MTBFD= 10500 heures.  \n\n  Déterminons les taux de pannes et le MTBF global (MTBFS) \n\n  Taux de pannes de l’ensemble \n\n  Quelle est la probabilité que le système parvienne sans pannes jusqu'à 5000 heures. \n\nExercice 6 \n\n       La  figure  ci-dessous  représente  le  graphe  de  Markov  d’un  système  en  redondance  active  à  un \n\nréparateur : \n\n1- Déterminer la matrice de taux de transition. \n\n2- Ecrire l’équation d’état de la chaîne de Markov. \n\n3- Déterminer p1(t). \n\nExercice 7 \n\n        Calculer la fiabilité de l'ensemble du dispositif proposé ? \n\n2 \n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\f Module :Organisation et méthodes de la maintenance  \n\n3ème année Licence , Spécialité Maintenance industrielle. \n\nExercice 8 \n\n       Calculer la fiabilité du dispositif proposé  et le taux de défaillance de l’ensemble. \n\nExercice 9 \n\n       Calculez la disponibilité du dispositif suivant si pour i = 1 à 4,  DAi =0,91 ; DB =0,93 ; DC =0,8 ; \n\nDD =0,78 et DE =0,90. \n\nExercice 10  \n\nUne carte électronique est fabriquée à partir des éléments suivants :  \n\n  Soudures  \n\n  (2)-(3) capacités  \n\n  (4) résistance  \n\n  (5) transistor  \n\n  (6)-(7) circuit intégré  \n\n  (8) diode  \n\n  (9) transformateur  \n\n  (10) potentiomètre  \n\n  (11) Alimentation  \n\nLa structure de la carte est donnée par le graphe ci-dessous : \n\n3 \n\n \n \n \n \n \n \n \n\f Module :Organisation et méthodes de la maintenance  \n\n3ème année Licence , Spécialité Maintenance industrielle. \n\nLes paramètres de fiabilité sont donnés dans le tableau ci-dessous : \n\n  Déterminer le taux de défaillance de chaque élément en supposant la loi de fiabilité de chaque \n\ncomposant comme exponentielle ; \n\n  Déterminer la fiabilité de chaque élément au bout de 5 heures en supposant la loi de fiabilité \n\nde chaque composant comme exponentielle ; \n\n  Déterminer la fiabilité de la carte au bout de 5 heures . \n\nExercice 11 \n\n        Il  s’agit  d’optimiser  les  interventions  de  maintenance  préventive  sur  différentes  machines.  On \n\ndispose pour cela des historiques suivants : \n\nMachine N°1 \n\nMachine N°2 \n\nTemps entre pannes en heures  N° de panne  Temps entre pannes en heures  N° de panne \n\n400 \n230 \n330 \n720 \n635 \n\n1 \n2 \n3 \n4 \n5 \n\n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \nEn admettant que l’on a des lois de Weibull : \n\n400 \n140 \n300 \n220 \n440 \n530 \n620 \n710 \n850 \n1200 \n1000 \n\n  Tracer les 2 fonctions de répartition sur papier Weibull en utilisant les rangs médians ; \n\n  Déduire pour chaque loi, les paramètres de Weibull. \n\n  Calculer les MTBF. \n\n4 \n\n \n \n \n \n \n \n\f Module :Organisation et méthodes de la maintenance  \n\n3ème année Licence , Spécialité Maintenance industrielle. \n\n  Définir les périodes d’intervention systématique si on souhaite un fonctionnement avec une \n\nfiabilité de 95% Refaire le même travail en considérant que les machines sont identiques \n\nExercice 12  \n\n         Un composant électronique de puissance à un taux de panne constant de 0,333 pour 1000 heures \n\nde fonctionnement (une défaillance chaque 3000 heures).  \n\na) Quelle est la probabilité pour qu'un composant survive après 3000 heures ? \n\n b) Quelle est la probabilité que le composant dure entre 1000 et 3000 heures ? \n\n c)Quelle  est  la  probabilité  que  le  composant  dure  1000  heures  de  plus  après  3000  heures  de \n\nfonctionnement ? \n\nProblème  \n\nUn  technicien  en  maintenance  est  chargé  d’étudier  le  cas  d’une  pièce.  L’historique  permet  de \n\nconnaître  la  durée  de  vie  des  pièces  de  ce  type  déjà  utilisées.  Elles  sont  consignées  dans  le  tableau \n\nsuivant : \n\n  1)  On  note  R(t)  la  probabilité  de  survie  du  matériel  à  la  date  t.  Dresser  un  tableau  faisant \n\napparaître les temps de bon fonctionnement classés dans l’ordre croissant, les valeurs de F(t) \n\npar la méthode des rangs moyens, et les valeurs de R(t).  \n\n  2. On pose y(t) = ln(R(t)), avec R(t) en pourcentage. Placer les points de coordonnées (t; y(t)) \n\ndans un repère dont les unités sont en abscisses : 1 cm représente 25 heures ; en ordonnées : \n\n10 cm représente ln 10.  \n\n  3. Justifier l’approche de R(t) par une loi exponentielle.  \n\n  4.  Déterminer  graphiquement  la  MTBF  de  la  pièce.  Montrer  que  l’on  peut  prendre  pour \n\nvaleur approchée du paramètre λ de la loi exponentielle la valeur 0, 007.  \n\n  5.  On  envisage  de  placer  deux  pièces  en  parallèle,  c’est-à-dire  de  telle  sorte  que  le  système \n\nfonctionne tant que l’une des deux pièces fonctionne. Etant donné qu’à l’instant t0 la fiabilité \n\nd’une pièce est de 80 %, déterminer à cet instant celle du système ainsi formé si l’on admet \n\nque les deux pièces fonctionnent de manière indépendante.  \n\n  6. Quelle aurait été la fiabilité à l’instant t0 si, au lieu de placer les deux pièces en parallèle, \n\non les avait placées en série, c’est-à-dire de telle sorte que le système soit défaillant dès que \n\nl’une des deux pièces casse ? (On admettra encore l’indépendance des deux pièces). \n\n5 \n\n \n \n \n \n \n \n\f"
}