{
    "content": "Pr. EL Hassani - Pr Sekkat - Pr Mahfoud                                                   ENSAM - Systèmes de production\n\nTD4 - Mesure de Travail\n\nExercice 1\n\nL'entreprise \"G\" réalise des pièces mécaniques de type P. La série est de 400 pièces. Il y a 2 opérateurs notés\n\nop1 et op2 sur la machine M. op1 et op2 effectuent simultanément le montage et le démontage de chaque\n\npièce. op1 nettoie le montage qui tenait la pièce pendant l'usinage. Il effectue cette séquence à chaque\n\nchangement de pièce. L’usinage est automatique (la machine est un centre d’usinage). op2 effectue le contrôle\n\nde chaque pièce à l’aide de calibres de type « entre », « n’entre pas ». Ce contrôle manuel est effectué pendant\n\nle nettoyage. La machine ne peut pas être utilisée lors du nettoyage.\n\n1. Remplir le Tableau et tracer le simogramme.\n\nintitulé séquence\n\nNature temps\n\ndurée (dmh)\n\nmonter la pièce\n\nusiner la pièce\n\ndémonter la pièce\n\nnettoyer le montage\n\nContrôler\n\n150\n\n100\n\n150\n\n300\n\n200\n\n2. Quelle est la cadence horaire de ce poste?\n\nExercice 2\n\nL’entreprise X fabrique des cellules robotisées sur mesure. Un client automobile vient de lui passer une\n\ncommande de 10 cellules. X a fabriqué une première unité, la durée de ce premier cycle est de 450 heures\n\npersonnes. Nous souhaitons planifier les 9 unités suivantes. L’entreprise décide de déterminer son %c\n\n(coefficient d’apprentissage) en analysant la durée de réalisation des commandes précédentes. Les durées de\n\nces commandes sont reportées dans le tableau ci-dessous.\n\nCmd  1\n\nDurées\n\nCmd 2\n\nDurées\n\nCmd 3\n\nDurées\n\n1ère fois\n\n300h\n\n1ère fois\n\n200h\n\n1ère fois\n\n500h\n\n5ème fois\n\n211h\n\n10ème fois\n\n125h\n\n7ème fois\n\n317h\n\n1\n\n\fPr. EL Hassani - Pr Sekkat - Pr Mahfoud                                                   ENSAM - Systèmes de production\n\n1. Estimer les coefficients %c de chacune de ces commandes. En déduire une\n\nestimation du coefficient d’apprentissage de l’entreprise X.\nl’entreprise puisse planifier\n\n3. Pour que\n\nla production, calculer\n\nla durée\n\nprévisionnelle de la réalisation des 9 autres cellules.\n\nExercice 3\n\nTâche\n\nType\n\nLibellé\n\nDurée ( cmin )\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\ntm\n\nttm\n\ntm\n\nttm\n\ntt\n\nttm\n\ntmo\n\nPréparation de la Matière Première\n\nTournage de la pièce\n\nEbavurage de la pièce\n\nMise au four\n\nCuisson\n\nSortie du four\n\nApprovisionnement en Matière première (toutes\nles 10 pièces)\n\n20\n\n140\n\n40\n\n10\n\n600\n\n20\n\n60\n\n1.Combien y a t il de ressources? Tracer le simogramme.\n2.Calculer le temps de cycle de référence, la cadence horaire, le taux d’occupation de\nl’opérateur, le taux d’engagement du tour, le taux d’engagement du four,.\n3. Le préparation de la pièce peut se faire en temps caché, et le four peut accepter 3 pièce au\nmême temps. Améliorer le simogramme et recalculer les indicateurs.\n\nExercice 4\n\nNous donnons les tâches relatives à 3 phases de tournage nécessaires pour fabriquer une\n\npièce mécanique réalisée par un équipementier automobile.\n\nTâches de la phase 1 exécuté sur le Tour 1\n\nTâch\ne\n1\n\nType Libellé\n\nDurée (cmin)\n\nttm Serrer la pièce sur la machine et embrayer l’avance et la\n\n20\n\nvitesse de coupe\ntt\nTournage en automatique de la pièce\nttm Arrêter la machine desserrer la pièce\ntm\n\n2\n3\n4\nTâches de la phase 2 exécuté sur le Tour 2\n\nContrôler les cotes de la phase 1\n\n160\n10\n10\n\n2\n\n\fPr. EL Hassani - Pr Sekkat - Pr Mahfoud                                                   ENSAM - Systèmes de production\n\nTache Type Libellé\n5\n\nttm Serrer la pièce sur la machine et embrayer l’avance et la\n\nDurée (cmin)\n20\n\nvitesse de coupe\n\nttm Centrage en avance manuelle sur la pièce\ntt\nTournage en automatique de la pièce\nttm Arrêter la machine desserrer la pièce\n\n6\n7\n8\nTâches de la phase 3 exécuté sur le Tour 3\n\n20\n130\n10\n\nTache Type Libellé\n9\n\nttm Serrer la pièce sur la machine et embrayer l’avance et la\n\nDurée (cmin)\n20\n\n10\n11\n12\n\nvitesse de coupe\ntt\nTournage en automatique de la pièce\nttm Arrêter la machine desserrer la pièce\ntm\nUn poste de travail est conçu pour être supervisé par un seul opérateur qui réalise les 3\nphases de tournage sur les 3 tours automatiques. Cet opérateur peut alimenter une machine\nquand les deux autres sont occupées, et il peut aussi reprendre le travail sur une machine alors\nque les autres sont toujours occupées. Le contrôle de la pièce peut se faire en temps masqué. En\noptimisant le simogramme de ce poste de travail, répondre aux 4 questions.\n\nContrôler les cotes de la phase 3\n\n140\n10\n20\n\n1. Quel est le temps de cycle de ce poste en cmin? (Optimisé)\n2. Quelle est la cadence horaire de production de ce poste ? (un chiffre après la\n\nvirgule, si vous trouver 107,756 mettez seulement 107,7)\n\n3. Quel est le taux d'occupation de l’opérateur en %? (sans chiffre après la virgule, si\n\nvous trouvez (89,34 mettez 89)\n\n4. Quel est le taux d’engagement du Tour 1 en %? (sans chiffre après la virgule, si\n\nvous trouvez (89,34 mettez 89\n\nExercice 5\n\nSoit l’analyse du déroulement avant et après amélioration de l’opération d’installation d’un\ncompteur éléctrique.\n\n1. Quantifier le lead time avant et après.\n2. Quantifier le % du temps de la valeur par rapport au temps total avant et après\n\nl’amélioration.\n\n3\n\n\fPr. EL Hassani - Pr Sekkat - Pr Mahfoud                                                   ENSAM - Systèmes de production\n\nBon courage.\n\n4\n\n\f"
}