{
    "content": "1. Partie 2 – Simulation\n\n1.1 Introduction\nCyclePad effectue des analyses en régime permanent des cycles ouverts et fermés. Dans un cycle\nouvert,  le  fluide  passe   à  travers  divers   composants  \"ouverts\",  tandis  que  dans  un  cycle  fermé,\ndifférents processus agissent sur un volume fermé. Les turbines à gaz sont donc des cycles ouverts,\net les moteurs à pistons sont des cycles fermés. Notez qu'un cycle de vapeur en boucle fermée\ncontenant une chaudière, une turbine, un condenseur et une pompe est toujours considéré comme un\ncycle ouvert. Dans ce qui suit, on va étudier le cycle de Rankine sur un système ouvert comportant\nune turbine, une pompe, une chaudière et un condenseur.\n\n1.2 Cycle ouvert\nLe cycle ouvert est représenté dans la figure 1 et contient une turbine, une pompe, une chaudière et\nun condenseur. On peut tracer notre cycle à l'aide de la palette de composants.\n\nFigure 1: Cycle ouvert dessiné dans le logiciel cyclePad.\n\nConsidérons un cycle de vapeur idéal dans lequel la vapeur entre à la turbine à une pression de 5\nMPa, à une température de 400°C et sort à une pression de 10 KPa. On cherche dans la suite à\ncalculer l'efficacité thermique.\n\n1.3 Réponses\nQ.1) La valeur du rendement thermique est 36.21 %, cette valeur est donné par le logiciel et se\ntrouve dans la figure 2.\n\nFigure 2: Les résulats du CyclePad.\n\n\fQ.2) On compare le rendement thermique à celui de carnot, on remarque que le ηthermique<ηcarnot.\n\nQ.3) Remplissons les tableaux suivants :\n\nTable 1: Rendement et titre en fonction de la pression.\n\nPression P (Turbine)\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nηthermique\n\n29.208\n\n32.336\n\n33.815\n\n35.312\n\n36.214\n\n36.923\n\n37.442\n\n37.968\n\nTitre à la sortie\n\n0.908\n\n0.864\n\n0.839\n\n0.816\n\n0.799\n\n0.786\n\n0.774\n\n0.762\n\nTable 2: Rendement et titre en fonction de la température.\n\nT° (Turbine)\n\n350\n\n400\n\n450\n\n500\n\n550\n\n600\n\n650\n\n700\n\nηthermique\n\n35.568\n\n36.131\n\n36.735\n\n37.373\n\n38.041\n\n39.437\n\n40.156\n\n40.884\n\nTitre à la sortie\n\n0.773\n\n0.796\n\n0.817\n\n0.836\n\n0.853\n\n0.886\n\n0.901\n\n0.915\n\nTable 3: Rendement et titre en fonction de la pression du condenseur.\n\nPression  P du condenseur\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n100\n\nηthermique\n\n36.214 34.086 32.735 31.726 30.908 30.218 29.618 28.173\n\nTitre à la sortie\n\n0.799\n\n0.822\n\n0.836\n\n0.846\n\n0.854\n\n0.861\n\n0.867\n\n0.882\n\nLes données des tableaux peuvent être représentées sous forme des graphes comme suit.\n\nQ.4)\n\nQ.5)\n\nFigure 3: Variation du rendement et le titre en fonction de la pression de la turbine.\n\n\fFigure 4: Variation du rendement et le titre en fonction de la température de la turbine.\n\nFigure 5: Variation du rendement et le titre en fonction de la pression du condenseur.\n\nQ.6)\n\nQ.7) \n\nOn remarque dans la figure 4 que lorsqu’on augmente la température, le titre augmente, ce qui veut\ndire que le fluide est formé principalement de vapeur. Lorsqu’on a un fluide avec une partie liquide,\nça influence négativement l’efficacité thermique. C’est pour cela dans la figure 4 quand le titre\naugmente, l’efficacité thermique augmente aussi.\n\nOn remarque dans les figures 3 et 5 que l’efficacité thermique diminue à cause de la pression qui est\nen train d’augmenter. L’augmentation de la pression transforme le fluide qui est à l’état gaz en état\nliquide\n\n\f"
}