{
    "content": "Introduction à l’analyse transactionnelle \n\n2- Les Transactions \n\n              Psychosociologie de la communication \n\n                Prof. Asmae El Arfaoui \n\nUne transaction est un échange de signes de reconnaissance, verbal ou non verbal, entre deux \npersonnes,  c’est-à-dire  un  stimulus  et  une  réponse  à  ce  stimulus. Si  deux  personnes  sont  en \nprésence et se mettent à communiquer, il y’aura un stimulus de l’une auquel répondra l’autre \nprobablement. \nOn distingue trois types de transactions : Les transactions parallèles ou complémentaires ; les \ntransactions  croisées ;  les transactions cachées  ou à double fond. Certaines transactions  sont \nplus faciles à analyser que d’autres.  \n\nLes transactions simples complémentaires : Elles mettent en relation un couple d’états du \nmoi  qui  se  répond  de  manière  parfaitement  parallèle.  L’État  du  moi  \"visé\"  est  celui  qui \nrépond.  Quand  les  vecteurs  sont  parallèles  ou  complémentaires,  la  communication  peut  se \npoursuivre indéfiniment : \n\n\"Dis-moi à quelle heure est ton train ? \n A 20h, tu peux venir me chercher ?  \nOui, tu penses à me rapporter mon livre ?  \nOui, il est déjà dans mon sac…\") \n\nLes transactions parallèles  \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n \n \n \n \n \n \n \n\fAutres Exemples \n\n-\" Avez-vous tapé le compte-rendu ? \" Adulte-Adulte \n\n -  \" Je  suis  en  train  d'en  terminer  la  rédaction.  Je  vous  le  fais  parvenir  dès  qu'il  est \nfinalisé \". Adulte-Adulte \n\n\" J'attends  toujours  que  vous  me  tapiez  ce  compte-rendu  !  Qu'est-ce  que  vous  attendez \npour vous y mettre ?! \" Parent-Enfant \n\n- \" Je m'excuse. Je m'y mets tout de suite \". Enfant-Parent \n\nLes Transactions croisées : l'État du Moi \"visé\" n'est pas celui qui répond, ou/et l'État du \nMoi qui répond \"vise\" un autre État du Moi que l'État du Moi émetteur. La réponse n’est pas \ncelle qu’on attend, l’interlocuteur choisit un autre mode de communication. On dit qu’il \n« croise la transaction ». Les transactions croisées sont toujours sources de conflit, \nl’incompréhension et le malentendu interrompent la communication entre les deux personnes. \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\fAutres exemples :  \n\n- \" Avez-vous tapé le compte-rendu ? \" (Question Adulte-Adulte) \n\n- \" Vous m'aviez donné demain comme échéance ! J'ai encore le temps de le faire !!!\"       \n\n(Réponse Enfant-Parent sur un ton emporté).  \n\n-\"J'attends  toujours  que  vous  me  tapiez  ce  compte-rendu  !  Qu'est-ce  que  vous  attendez \npour vous y mettre ?! \" (Question Parent-Enfant)  \n\n-  \" Avez-vous  vérifié  vos  mails,  je  vous  l'ai  envoyé  en  fin  de  matinée » (Réponse  A-A). \nQuand  les  vecteurs  se  croisent,  la  communication  change,  ce  changement  de  cap  entraîne \nune  réorganisation  des  échanges  qui  ne  peuvent  plus  continuer  sur  leur  lancée.  Pour  que  la \ncommunication  se  poursuive,  il  faut  que  l’un  des  interlocuteurs  ou  bien  les  deux  changent \nd’état du moi.  \n\nTransactions croisées : intérêt Si quelqu’un s’obstine à nous critiquer depuis une position de \nParent,  nous  avons  intérêt  à  chercher  une  façon  de  réorienter  la  communication.  Les \ncroisements  d’Adulte  à  Adulte  se  révèlent  le  plus  souvent  utiles,  surtout  en  milieu \nprofessionnel \n\nInconvénients : Risque d’incompréhension, de malentendus \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\fLes Transactions cachées ou à double-fond : ce sont des transactions dites complexes parce \nqu'une seule phrase comporte ici deux messages. Le  premier message est appelé le message \nde  niveau  social,  ce  sont  les  mots  prononcés,  ce  qui  est  dit  verbalement.  Le  second  est  le \nmessage caché ou psychologique, ce sont \"les mots\" que l'on ne dit pas verbalement, mais qui \npeuvent  -  ou  non  -  être  très  bien  \"entendus\" par  son  interlocuteur.    L'une  des  formes  bien \nconnues  de  ce  type  de  communication  sont  les  sous-entendus.  Il  s'agit  d'interactions  plus \ncomplexes à analyser : transactions étant ou pouvant être perçues comme étant à double sens \nou  biaisées  (langage  verbal  incohérent  avec  le  non  verbal,  insinuations  diverses,  etc.)  ou \ntransactions tangentielles (l'un des protagonistes élude ou répond à côté du sujet) \n\nInconvénients :  Risque  d’erreur  d’interprétation  quand  un  message  n’est  pas  exprimé \nouvertement (sous-entendu= risque malentendu  \n\nAvantages : communiquer des choses subtilement sans avoir à les dire  \n\nHumour, taquineries, sous-entendus charmeurs sont basés sur des aspects non explicites. \n\n  Je ne vous pardonnerai pas une telle chose (Enfant rebelle)             \n\n Réprobation : je suis indigné par votre demande (PNf) \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\fLes  transactions  angulaires :  Dans  les transactions  angulaires, c’est  un  message  que  l’on \nenvoie  en  apparence  vers  un  état  du  moi  alors  que  l’on  a  décidé  sciemment  d’accrocher  un \nautre état de l’interlocuteur. Une personne tente par exemple de dominer son interlocuteur en \ns’adressant à un état du moi (par exemple l’Adulte) mais en visant secrètement un autre état \n(par exemple l’Enfant). S’il parvient à son objectif, la transaction est dite réussie. \n\nI \n\nElles visent consciemment deux niveaux. L’Adulte gère la situation pour manipuler de façon \nvolontaire. Une transaction est une manipulation lorsque l’un des deux partenaires n’est pas \nau courant des objectifs poursuivis. Lorsque les deux sont informés, il s’agit d’influence.  \n\nLa  compréhension  de  ces  types  de  transactions  nous  permet  de  mieux  élucider  les \nproblèmes  de  communication,  de  mieux  comprendre  nos  relations,  d’établir  une \nmeilleure communication en éclairant considérablement la situation.  \n\nNB :  Lorsque  des  personnes  sont  dans  une  transaction,  elles  s’envoient  mutuellement  des \nsignaux,  verbaux  ou  non,  au  travers  desquels  elles  se  «  reconnaissent  ».  Les  signes  de \nreconnaissance peuvent être positifs : « c’est très bien ce que vous faites, je vous félicite… » \nou  négatifs  :  «  vous  vous  êtes  encore  trompé,  vous  êtes  vraiment  nul…  ».  Les  signes  de \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\freconnaissance sont vitaux : ils permettent aux personnes de maintenir leur niveau de confort \ntant physique que psychologique  \n\nhttps://www.youtube.com/watch?v=kKm8EOdZMFA \n\nRepérez la nature des transactions dans les exemples suivants  \n\nExemple 1 \n\n-  Avons-nous reçu les devis pour le projet X \n-  Oui, ils sont arrivés hier. Je te les apporte ? \n-  S’il te plaît, oui. J’ai besoin des chiffres que nous avons déterminés \n-  Pas de problème, je les ai dans mon dossier. \n-  Merci, zoé, tu les as regardés ? Qu’en penses-tu ? \n-  Oui, j’y ai jeté un coup d’œil, ça me semble juste. \n-  Je suis d’accord avec toi, je crois que ça va aller \n\nExemple 2   \nQuoi ? Tu n’es pas passé chez le traiteur pour prendre les commandes ?  \nC’est moi qui devais y aller ? Non, c’est pas mon tour, j’y suis allé la dernière fois !  \nIl fallait me le dire si tu ne voulais pas y aller. Tu m’as mise dans le pétrin, \nC’est malin ! Tu n’es vraiment pas sympa ! tu m’as causé des ennuis \n-voilà, c’est toujours ma faute ! Stagiaire, C’est vraiment le pire des boulots ! on est le \nlarbin de service, et on prend pour tout le monde   \n\nExemple 3  \n\n -Alors, Zoé, qu’y-a-il pour déjeuner pendant la réunion ?  \n\n-  Euh,  justement,  je  suis  désolée,  il  n’y  a  que  la  boisson.  Jérôme  devait  passer  chez  le \ntraiteur prendre les plateaux repas que j’ai commandés, mais il a oublié  \n\n-Comment ça, « il a oublié » ? Je m’en moque, de ça ! Tu devais nous arranger un repas \nléger. Je ne vais pas garder tout le monde ici, s’il y’a pas de quoi les nourrir !  \n\n-Oui, je suis vraiment désolée…Tu veux que j’aille prendre la livraison maintenant, \n\n-Mais  non,  c’est  trop  tard,  et  c’est  trop  loin !  Je  suis  vraiment  contrariée,  Zoé.  Je  te \ncroyais plus fiable. \n\nTransactions croisées  \n\nExemple 1 \n\n-Tu devais nous arranger un repas léger. Je ne vais pas garder tout le monde ici, s’il n’y \na pas de quoi les nourrir ! \n\n-Je suis désolée, je te propose deux options : soit tu les fais patienter en commençant la \ndiscussion pendant que je vais chercher la commande, soit tu les amènes au café. \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\f-  «  Oui,  mais  quand  même,  j’aimerais  bien  pouvoir  compter  sur  toi !  je  t’avais  dit  de \npréparer quelque chose. \n\n-Tu as raison. Je suis désolée d’avoir oublié, c’est vraiment problématique pour toi, j’en \nsuis consciente. Penses-tu que l’alternative que je t’ai proposée puisse convenir, ou veux-\ntu que je cherche autre chose ? \n\n-Non, non, ça ira ! Mais, quand-même… \n\n-Oui, Charlotte, je t’ai bien entendue, cela ne se reproduira plus. \n\nExemple : 2 \n\n -Tu devais nous arranger un repas léger. Je ne vais pas garder tout le monde ici, s’il n’y \na pas de quoi les nourrir ! \n\nArrête  de  t’énerver,  Charlotte.  Tu  perds  toute  crédibilité,  quand  tu  cries  comme  ça. \nReprends-toi. \n\n-Tu devais nous arranger un repas léger. Je ne vais pas garder tout le monde ici, s’il n’y \na pas de quoi les nourrir ! \n\n-Bon,  je  vais  les  chercher  tes  sandwichs !  oh  la  la !  Pas  la  peine  d’en  faire  toute  une \nhistoire ! ce n’est quand même pas la fin du monde ! \n\nTransactions cachées Exemple 1 \n\n« Tiens, la fenêtre est ouverte ? Demande Charlotte, frileuse notoire. Juste un petit peu, \npour aérer. Je la referme tout de suite ! réplique Zoé en se précipitant. \n\nExemple 2  \n\n« En  rentrant  chez  lui,  Pierre,  trouve  la  porte  de  son  appartement  entrouverte.  Il \ncherche Charlotte et s’enquiert d’un air innocent :  \n\n-C’est normal que la porte soit restée ouverte ?  \n\n- « Bien sûr que c’est normal, tu n’avais pas remarqué que personne ne ferme sa porte, à \nParis ? » \n\nExemple 3 \n\n Sarah et Sébastien s’apprêtent à diner chez les parents de ce dernier :  \n\n-Tu vas mettre cette robe ? S’enquiert Sébastien, inquiet. \n\n-Pourquoi est-ce que je ne la mettrais pas ? Je l’aime bien, cette robe ? \n\nJ’en ai assez à la fin, tu es toujours en train de me critiquer ! \n\n-Mais je ne t’ai pas critiquée, ma chérie, j’ai juste posé une question. \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n\f-Oui mais j’ai bien compris qu’en réalité tu me reprochais de mal m’habiller, tu détestes \nmon goût, en fait !  \n\nSarah s’enferme dans sa chambre en pleurant. \n\nSynthèse :  Nous  partons  souvent  du  principe  que  les  phrases  énoncées  par  nos  interlocuteurs \nsont univoques et que la signification que nous en tirons est partagée. Mais, vous l’avez compris, \nce  n’est  que  rarement  le  cas.  La  communication  devient  complexe  lorsque  les  transactions  ne \nsont  pas  complémentaires  et  qu’il  n’y  a  pas  d’équilibre  dans  les  états  du  moi  en  présence. \nDifficile  alors  d’arriver  à  une  situation  gagnant-gagnant.  La  solution ?  Savoir  repérer  le \ndéséquilibre, faire  preuve  d’écoute pour  comprendre  le  point  de  vue  de  l’autre, ce  qu’il  désire \nvraiment.  Puis  orienter  la  discussion  vers  une  issue  favorable  pour  chacun  en  utilisant  un \nraisonnement objectif. Dans un jeu, cela doit avoir pour effet de casser la permutation infinie et \ndéboucher sur une communication d’Adulte à Adulte.  \n\nPour avoir une communication optimale, il est nécessaire de reformuler ce que nous entendons \npour  nous  assurer  de  l’avoir  bien  compris.  De  la  même  manière,  il  convient  d’exprimer  nos \nressentis de manière à ce qu’ils soient compris et bien reçus par nos interlocuteurs. \n\nAfin  de  résoudre  des  problèmes  de  vies  collectives,  les  transactions  à  privilégier  sont  les \ntransactions Adulte - Adulte. Ce type de communication privilégie la partie objective, raisonnée. \nElle  est  orientée  vers  la  réalité  et  fonctionne  dans  le  présent.  Elle  met  en  avant  observation, \névaluation, compréhension, analyse et décision. \n\nCe type de transaction est donc indispensable dans l’entreprise et permet d’éviter les conflits. \n\n Dans le monde du travail, les transactions Adulte-Adulte sont généralement préférables aux \nautres. Chacun interagit de manière posée, respectueuse envers son interlocuteur et \nconstructive. Il n'est toutefois pas toujours aisé de conserver cette relation d'état de moi adulte à \nadulte. \n\nSi ces interactions ne sont pas toujours sources de profonds malaises, elles sont toutefois \nrarement bénéfiques au travail. En apprenant à décoder les différents états du moi lors de ses \ninteractions avec ses collaborateurs, le manager s'assure d'une communication et d'une \nambiance propices au travail et à l'efficacité individuelle et collective. \n\nPsychologie de la Communication. Prof. A. El Arfaoui.S3 Cycle ingénieur. 2021-22. P.8 \n\n \n \n \n \n \n\f"
}